[{
		"body": "On the condition he gets to install windows.   ",
		"id": "5tn84z",
		"score": 48526,
		"title": "Breaking News: Bill Gates has agreed to pay for Trump's wall"
	}, {
		"body": "/r/Jokes",
		"id": "4xjyho",
		"score": 45500,
		"title": "I found a place where the recycling rate is 98%"
	}, {
		"body": "But its a silly comparison really, its like comparing apples to oranges. ",
		"id": "5s9jog",
		"score": 39570,
		"title": "Steve jobs would have been a better president than Donald Trump."
	}, {
		"body": "We went and had some drinks. Cool guy. Wants to be a web developer.",
		"id": "4wgall",
		"score": 36421,
		"title": "My girlfriend told me to take the spider out instead of killing it."
	}, {
		"body": "Please don't upvote. Her strap-on is huge. ",
		"id": "4pj3q3",
		"score": 35772,
		"title": "For every upvote this gets, my girlfriend and I will try one thrust of anal sex."
	}, {
		"body": "'Forget everything you learned in college. You won't need it working here.'  'But I never went to college.'  'Well then, I'm sorry. You are underqualified to work here.'",
		"id": "4zu8ii",
		"score": 33626,
		"title": "Forget everything you learned in college..."
	}, {
		"body": "Dear sir,  Your internet access has been terminated due to illegal usage.  Sincerely, your service provider.",
		"id": "4vvaie",
		"score": 32974,
		"title": "What's a pirate's least favorite letter?"
	}, {
		"body": "So I made her marry an old guy she's never met to secure an alliance with the French. ",
		"id": "5qeezz",
		"score": 31006,
		"title": "My girlfriend kept telling me to treat her like a princess."
	}, {
		"body": "because you can't truly be Hitler until you blame a jew for all your problems.",
		"id": "4a9ax9",
		"score": 30882,
		"title": "Trump is blaming Sanders for the violence at his rally..."
	}, {
		"body": "Whoops, wrong sub.",
		"id": "2qmkf0",
		"score": 30863,
		"title": "TIFU by mixing up by wifes sandwich order at Subway"
	}, {
		"body": "With iPhone accessories.  ",
		"id": "51t7fe",
		"score": 30499,
		"title": "How do you milk sheep?"
	}, {
		"body": "Social security",
		"id": "5sqnqg",
		"score": 29617,
		"title": "'90s kids won't get this"
	}, {
		"body": "[removed]",
		"id": "4nr6gd",
		"score": 29290,
		"title": "So I went on r/news today.."
	}, {
		"body": "\"...and I would have gotten away with it if it weren't for you medaling kids!\"",
		"id": "4yiv2v",
		"score": 29049,
		"title": "What did Lochte say after his teammates told the police what really happened?"
	}, {
		"body": "they're white, they're cold, and if you put enough of em together they'll shut down public schools  EDIT* Thanks for the gold! You popped my gold cherry!   its a joke folks. just a joke.",
		"id": "5sxr4y",
		"score": 28995,
		"title": "Republicans are the true snowflakes..."
	}, {
		"body": "America.",
		"id": "48sxql",
		"score": 27873,
		"title": "If Hillary Clinton and Donald Trump are in a boat and it capsizes. Who survives?"
	}, {
		"body": "You should've seen her face when I tossed her some diet pills.  ",
		"id": "5s50we",
		"score": 27434,
		"title": "My wife told me to go and get some pills that help with an erection..."
	}, {
		"body": "So we can think about a solution in silence.",
		"id": "4gzfj0",
		"score": 26603,
		"title": "Why are women and children evacuated first in a disaster?"
	}, {
		"body": "To beat the crowd.",
		"id": "51plu4",
		"score": 26514,
		"title": "Why do riot police like to get to work early?"
	}, {
		"body": "Completely ruined our 10-year anniversary.",
		"id": "4ukfxr",
		"score": 26241,
		"title": "My girlfriend's father called me a pedophile just because she's 22 and I'm 36."
	}, {
		"body": "Whoops wrong sub",
		"id": "3ll81d",
		"score": 25824,
		"title": "TIL you can get dishonorably discharged from the Navy for boarding the wrong vessel just once"
	}, {
		"body": "Kinda like yo momma.",
		"id": "5rx2qm",
		"score": 25454,
		"title": "Every \"yo momma\" joke has been done thousands of times, by thousands of different people."
	}, {
		"body": "[removed]",
		"id": "2pzjyg",
		"score": 24985,
		"title": "A Joke About Kim Jong Un"
	}, {
		"body": "\"This is not working I'm going to my mum's house.\"  So, I opened the fridge's door, the light came on and the juice was cold.   - What the hell did she mean?",
		"id": "5qn4zn",
		"score": 24815,
		"title": "My girlfriend left a note on the fridge"
	}, {
		"body": "Apparently the correct term is 'conjoined twins'",
		"id": "5q6xuu",
		"score": 24610,
		"title": "I pissed off two men today because I referred to them as hipsters.."
	}, {
		"body": "Out of respect, we should at least wait until it takes place.",
		"id": "5smhxt",
		"score": 24226,
		"title": "These Bowling Green Massacre jokes are too soon"
	}, {
		"body": "\"Jump in, I'll give you a lift home\" I said. \"Fuck off\" he shouted back. \"What an ungrateful little cunt\" I thought as I zipped up my backpack and continued my walk.",
		"id": "4fbjvk",
		"score": 24065,
		"title": "I saw my dwarf neighbor at a bus stop"
	}, {
		"body": "C",
		"id": "3rw2du",
		"score": 23943,
		"title": "Open letter to the mods of /r/jokes"
	}, {
		"body": "Oranges have thick skin.  Let the downvotes fly, people! You've only got one!  Edit: Did not expect this joke to get this good of a reception. Thanks, guys!",
		"id": "4vqjp2",
		"score": 23922,
		"title": "What's the difference between Donald and a piece of fruit?"
	}, {
		"body": "But when I do, he laughs ",
		"id": "4zck28",
		"score": 23481,
		"title": "I don't always tell dad jokes"
	}, {
		"body": "Britain is in the lead, but America has a Trump card.",
		"id": "4pqu2j",
		"score": 23363,
		"title": "The United States and Britain are having a competition on who can fuck themselves up the most."
	}, {
		"body": "A bad joke timing",
		"id": "4o9g4b",
		"score": 23199,
		"title": "What's the difference between a good joke and"
	}, {
		"body": "She said \"Yes!\". I said \"Good, because I'm breaking up with you.\"  Edit: Front page! Hi mom.  Thanks for the gold you amazing stranger, you.",
		"id": "4hmfy8",
		"score": 23090,
		"title": "I asked my girlfriend if she'd like a day of eating ice cream and hanging with her girl friends."
	}, {
		"body": "\"Please Get Out The Pool\"",
		"id": "4w1wce",
		"score": 23005,
		"title": "How do you get 30 drunk Canadians out of the pool?"
	}, {
		"body": "Probably because Mexico has more aliens",
		"id": "5tk1na",
		"score": 22322,
		"title": "Trump's wall will cost 21.6 billion, Nasa's budget is only 19 billion"
	}, {
		"body": "There used to be two and now it's too offensive to talk about.",
		"id": "50dxt6",
		"score": 22192,
		"title": "What do the twin towers and genders have in common?"
	}, {
		"body": "What a ridiculous thing to fallout 4",
		"id": "3sodvg",
		"score": 21928,
		"title": "My girlfriend just dumped me for talking too much about video games"
	}, {
		"body": "Dear Sir/Ma'am  We are cutting your internet connection due to the following reasons:  1. Illegal Downloading ",
		"id": "48m1su",
		"score": 21498,
		"title": "What is a pirate's least favorite letter?"
	}, {
		"body": "\"Peter, you've been a doctor for over 8 years now, please stop starting every phone conversation we have with that.\"",
		"id": "4yp0ex",
		"score": 21482,
		"title": "\"Mom? Don't freak out, but I'm in the hospital...\""
	}, {
		"body": "The man answers: \"Wow, how did you know?\"  Cashier: \"Because you're ugly.\"",
		"id": "4hj06f",
		"score": 21409,
		"title": "A man is buying a banana, an apple and two eggs. The female cashier says: \"You must be single.\""
	}, {
		"body": "Nobody expects the Spanish in position.",
		"id": "529lph",
		"score": 21109,
		"title": "I've finally worked out why Spain is so good at football."
	}, {
		"body": "The fire consumed both books and in a tragic twist he hadn't even finished coloring the second one",
		"id": "5ser5q",
		"score": 21008,
		"title": "In breaking news, Trump's personal library has burned down"
	}, {
		"body": "When the punchline becomes apparent.",
		"id": "4bzb1n",
		"score": 20992,
		"title": "When does a joke become a dad joke?"
	}, {
		"body": "Because they are more likely to be dead.",
		"id": "4mdm5a",
		"score": 20976,
		"title": "A new study shows that unvaccinated children are less likely to be autistic"
	}, {
		"body": "A family walks into a hotel and the father goes to the front desk and says \"I hope the porn is disabled.\" The guy at the desk replies. \"It's just regular porn you sick fuck.\"",
		"id": "2cgtk1",
		"score": 20878,
		"title": "A family walks into a hotel... NSFW"
	}, {
		"body": "My german girlfriend likes to rate my sexual performances on a scale of 1-10.  Last night we tried anal. She kept yelling 9. That's the best I've ever done. ",
		"id": "4tav80",
		"score": 20709,
		"title": "German girlfriend"
	}, {
		"body": "[removed]  ",
		"id": "4vb4bl",
		"score": 20695,
		"title": "How do you disappoint a Redditor?"
	}, {
		"body": "One.  Men can be Feminists, too.",
		"id": "4y28jy",
		"score": 20353,
		"title": "How many Feminists does it take to screw in a lightbulb?"
	}, {
		"body": "\"coup coup\"",
		"id": "4t2htj",
		"score": 20324,
		"title": "What sound does a Turkey make?"
	}, {
		"body": "They wanted to keep alcohol out of the high schools",
		"id": "4d6ow3",
		"score": 20093,
		"title": "Alabama changed the drinking age to 34"
	}, {
		"body": "asked a son to his father.  \"It means 'happy,'\" replied the father.  \"Oh,\" contested the son, \"so are you gay, then?\"  \"No, son, I have a wife.\" ",
		"id": "4ttyja",
		"score": 19834,
		"title": "What does the word 'gay' mean?"
	}, {
		"body": "\"NASA: The Sky's The Limit\"",
		"id": "5tlztr",
		"score": 19674,
		"title": "Did you hear what NASA's new slogan will be once their budget is cut?"
	}, {
		"body": "Then I could afford a house in the economy they ruined.",
		"id": "32vfr6",
		"score": 19563,
		"title": "If I had a dollar for every time someone over 40 told me my generation sucks..."
	}, {
		"body": "Dad: \"Not yet. We still haven't found anyone who wants you.\"",
		"id": "5trtfi",
		"score": 19525,
		"title": "Son: \"Dad, Am I adopted\"?"
	}, {
		"body": "I said, \"Just because you're unwilling to try new things, doesn't mean everyone's that frigid.\"  \"Not that,\" she explained, \"It's just the plumbers that come to our house have tiny dicks.\"",
		"id": "4y4qij",
		"score": 19346,
		"title": "I was watching porn with the missus and she complained, \"This is so unrealistic.\""
	}, {
		"body": "Oops, wrong sub",
		"id": "4nuftd",
		"score": 19239,
		"title": "TIL in 1974 Russians accidentally blew up their own submarine, thinking it was an enemy"
	}, {
		"body": "Everybody misses Harambe.",
		"id": "4zqox0",
		"score": 19153,
		"title": "What's the difference between everybody and bullets?"
	}, {
		"body": "\"A man has been arrested after half a million indecent images of children were found at his home in Bradford. Our reporter Gary O'Donoghue has more.\"  Gary, you filthy bastard.",
		"id": "4y9nn6",
		"score": 18905,
		"title": "I was watching the news this morning when the presenter said.."
	}, {
		"body": "[deleted]",
		"id": "40lhzp",
		"score": 18818,
		"title": "3 mods walk into a bar"
	}, {
		"body": " \"I'm in Darwin with my sheila and she's been stung on the minge by a wasp, and now her pussy has completely closed up.\"    \"Bummer, mate...!!!\"    \"Thanks mate, I hadnt thought of that. Bye.\"",
		"id": "5q9qxg",
		"score": 18757,
		"title": "\"G'Day mate, Aussie help line here..........What's the problem,.... Cobber?\""
	}, {
		"body": "They picked pizza. Then I made tacos because they don't live in a swing state.",
		"id": "4w7prj",
		"score": 18673,
		"title": "To teach kids about democracy, I let them vote on dinner."
	}, {
		"body": "Because they are more likely to be dead",
		"id": "4wz39j",
		"score": 18606,
		"title": "TIL unvaccinated children are less likely to be autistic"
	}, {
		"body": "Not only was it embarrassing, but it also cost me a fortune in stamps. ",
		"id": "5scr7a",
		"score": 18552,
		"title": "I accidentally sent a dick pic to everyone in my address book."
	}, {
		"body": "A perfect 10, but completely imaginary.",
		"id": "3r7zed",
		"score": 18251,
		"title": "My girlfriend is like the square root of -100"
	}, {
		"body": "Calls her husband up to the room to show him and discuss. \"What do you think we should do?\" she asks. Father frowns and responds \"Well I guess spanking him is out of the question\"",
		"id": "4smxjj",
		"score": 18194,
		"title": "Mom finds a large number of BDSM magazines beneath her sons bed."
	}, {
		"body": "... ironic that 72 virgins are now attacking the terrorists  EDIT: Almost 4 years on Reddit and I´m finally a faget! Yay!! EDIT2: Wow, thanks u/lordzxil for the gold!",
		"id": "3t06w4",
		"score": 18032,
		"title": "So, Anonymous has declared war on ISIS"
	}, {
		"body": "For Hispanic attacks. ",
		"id": "4tkbft",
		"score": 18000,
		"title": "Why does Donald Trump take Xanax?"
	}, {
		"body": "But if I'm gonna have sex, it's going to be on my own Accord.",
		"id": "5qy146",
		"score": 17976,
		"title": "My girlfriend tried to make me have sex on the hood of her Honda Civic..."
	}, {
		"body": "Like you don't see med students calling themselves doctors or arts students calling themselves unemployed.",
		"id": "49o14n",
		"score": 17973,
		"title": "I hate it when engineering students refer to themselves as engineers..."
	}, {
		"body": "“Wow, your dad’s a millionaire?” “No, but he always wanted to be.” ",
		"id": "5s09lq",
		"score": 17861,
		"title": "I want to be a millionaire just like my dad!!"
	}, {
		"body": "Her: Why did the chicken cross the road? Me: Why? Her: To get to the ugly guy's house. Me:??? Her: Knock knock Me: Who's there? Her: It's the chicken!",
		"id": "2propg",
		"score": 17800,
		"title": "Joke from my daughter"
	}, {
		"body": "It means a lot.",
		"id": "4f6e6i",
		"score": 17748,
		"title": "Thanks for explaining the word \"many\" to me."
	}, {
		"body": "An Englishman, a Scotsman and an Irishman walk into a bar...  The Englishman wanted to go so they all had to leave.",
		"id": "4q355h",
		"score": 17596,
		"title": "An Englishman, a Scotsman and an Irishman walk into a bar..."
	}, {
		"body": "",
		"id": "3t95sa",
		"score": 17453,
		"title": "One in every 2 and a half men is HIV positive."
	}, {
		"body": "Dear Sir,  We are writing to you because you have violated copyright ...",
		"id": "31w4s1",
		"score": 17331,
		"title": "What's a pirate's least favourite letter?"
	}, {
		"body": "Orange will be the new Black. ",
		"id": "4xdxwo",
		"score": 17321,
		"title": "If Trump replaces Obama as president,"
	}, {
		"body": "after a moment of awkward silence, I said: \"Well I guess you should have been there\".",
		"id": "4i5p7u",
		"score": 17289,
		"title": "I told god a Holocaust joke. He didn't laugh."
	}, {
		"body": "\"Gee, thanks, Grandpa!\"  \"Why are you calling me Grandpa?\"  \"Because I couldn't find it yesterday.\"",
		"id": "4sjkh8",
		"score": 17011,
		"title": "\"Son, I found a condom in your room\""
	}, {
		"body": "I replied, \"Dude, it's 2017, you can use any printer you want.\"",
		"id": "5sfwmc",
		"score": 16824,
		"title": "A black guy in a library asked me where the colored printer was"
	}, {
		"body": "They both feel good until you look down and realize you're gay.  TAKE THAT CROC LOBBY #againstbigcroc   I understand if I get downvoted. ",
		"id": "4i0jrx",
		"score": 16790,
		"title": "What does wearing crocs and getting a blowjob from a man have in common?"
	}, {
		"body": "\"Are you kidding? Really?\" I shouted.  \"Yup, get ready,\" he said. \"They'll be picking you up in about an hour.\"",
		"id": "3hvisa",
		"score": 16633,
		"title": "\"Son, I wanted to let you know you were adopted,\" my dad told me."
	}, {
		"body": "She looked ecstatic until I picked up her box and started walking away",
		"id": "5rpqie",
		"score": 16136,
		"title": "I went up to this really cute homeless girl and asked if I could take her home"
	}, {
		"body": "It seems they want to keep alcohol out of the high schools.",
		"id": "4xbp58",
		"score": 16116,
		"title": "TIL that they have raised the minimum drinking age in Arkansas to 32."
	}, {
		"body": "The plot thickens.",
		"id": "4rmqx8",
		"score": 16052,
		"title": "As I suspected, someone has been adding soil to my garden."
	}, {
		"body": "They both contain high amounts of trans fats.  Edit: Omg guys! I didn't expect this to take off this much, thanks guys!",
		"id": "4vk75w",
		"score": 15956,
		"title": "What does Tumblr and KFC's chicken have in common?"
	}, {
		"body": "Total recall",
		"id": "50yeda",
		"score": 15931,
		"title": "What is Samsung CEO's favorite movie"
	}, {
		"body": "I'm not letting you out.",
		"id": "50gyvt",
		"score": 15819,
		"title": "To the woman who keeps pounding on my door at night:"
	}, {
		"body": "She told me to use the back door and I'd have to be quick.  In retrospect I should have just left, but it's not every day you get an offer like that.",
		"id": "4niphi",
		"score": 15734,
		"title": "I was having sex with a woman when her husband came home early."
	}, {
		"body": "If it floats:  boy ant.",
		"id": "2snmui",
		"score": 15653,
		"title": "You can tell the sex of an ant by dropping it into a jug of water. If it sinks: girl ant...."
	}, {
		"body": "For instance:    \"Ben is in a hurry.\"   \"Ben is in a coma.\"  ",
		"id": "4ir53p",
		"score": 15569,
		"title": "Comas can really change the meaning of a sentence..."
	}, {
		"body": "Find out next time, on Dragon Ball Z!",
		"id": "535a2y",
		"score": 15454,
		"title": "How many super saiyans does it take to change a light bulb?"
	}, {
		"body": "I mean the verb, not the adjective. ",
		"id": "4n9jmm",
		"score": 15435,
		"title": "In my spare time I help blind children."
	}, {
		"body": "...could have been avoided completely if cowboy architects had just made their towns big enough for everyone...",
		"id": "4k89av",
		"score": 15405,
		"title": "I believe a lot of conflict in the Wild West..."
	}, {
		"body": "She was eaten by a giant crab  Edit: Bo Burnham is my god, this joke is his, I masturbate thinking of his talent to make people laugh without stealing jokes from other people",
		"id": "518t2q",
		"score": 15385,
		"title": "My aunt's star sign was cancer, pretty ironic how she died"
	}, {
		"body": "They're there for the kid, but dad ends up playing with them.",
		"id": "4fstj9",
		"score": 15384,
		"title": "Tits are like Lego bricks."
	}, {
		"body": "Teach a Nigerian to phish and he'll become a prince.",
		"id": "4tqzcv",
		"score": 15346,
		"title": "Give a man a fish, and he eats for a day"
	}, {
		"body": "They come into your life wild and free and then leave with the PATIO FURNITURE WE BOUGHT TOGETHER SARAH YOU BITCH",
		"id": "4no0bh",
		"score": 15300,
		"title": "Women are like Hurricanes"
	}, {
		"body": "I'm glad to be the 1%",
		"id": "4lvcla",
		"score": 15176,
		"title": "9/10 Redditors are idiots"
	}, {
		"body": "You know...heroin.",
		"id": "4lg0nd",
		"score": 15148,
		"title": "I've been so stressed recently I've been doing that Chinese thing with the needles."
	}, {
		"body": "We shoot each other in schools, because we have class.",
		"id": "4mlh0b",
		"score": 15138,
		"title": "White people don't shoot each other in the streets like black people do..."
	}, {
		"body": "It's seven ",
		"id": "527c4s",
		"score": 15040,
		"title": "I can count the number of times I've been to Chernobyl on one hand"
	}, {
		"body": "A ton of feathers. Because you also have to carry the weight of what you did to those poor birds.",
		"id": "4vybks",
		"score": 14842,
		"title": "What's heavier, a ton of bricks or a ton of feathers?"
	}, {
		"body": "which also means nothing",
		"id": "51lpgl",
		"score": 14811,
		"title": "The word 'nothing' is a palindrome. 'Nothing' reversed is 'Gnihton'"
	}, {
		"body": "Because I don't really understand your terms and you keep saying you have no interest.",
		"id": "3h28pu",
		"score": 14802,
		"title": "Yo girl, are you a zero APR loan?"
	}, {
		"body": "A blueberry hahaha fuck you all",
		"id": "4hyfv9",
		"score": 14795,
		"title": "What do you call a sad strawberry?"
	}, {
		"body": "50 Cent feat. Nickelback   Go ahead, down vote me to oblivion  Edit: thanks for all the love, appreciated",
		"id": "4z4hcn",
		"score": 14754,
		"title": "What concert costs 45 cents?"
	}, {
		"body": "The other says, \"I'm a big metal fan\"",
		"id": "4p8qkb",
		"score": 14670,
		"title": "Two windmills are standing in a field and one asks the other, \"What kind of music do you like?\""
	}, {
		"body": "Horse dick ",
		"id": "4ov2lr",
		"score": 14611,
		"title": "What do gay horses eat?"
	}, {
		"body": "Social Security benefits.",
		"id": "33ljbh",
		"score": 14604,
		"title": "90s kids won't get this . . ."
	}, {
		"body": "Obviously not.  gg y'all, inbox = rekt",
		"id": "2tijba",
		"score": 14574,
		"title": "Do you know the one step to avoiding clickbait?"
	}, {
		"body": "He wants to make America grate again.",
		"id": "46r5ai",
		"score": 14501,
		"title": "Trump wants to ban the sale of pre-shredded cheese."
	}, {
		"body": "I guess the N's justify the means. ",
		"id": "4qzif1",
		"score": 14383,
		"title": "My stats professor told me that the larger the sample size the more trustworthy the data."
	}, {
		"body": "Lazy",
		"id": "4vmopp",
		"score": 14307,
		"title": "My friend asked me to describe myself in 3 words..."
	}, {
		"body": "Bartender says \"Three feet tall.\"  Guy says \"Oh my God! I just ran over a nun!\"",
		"id": "4spmkr",
		"score": 14277,
		"title": "Guy runs into a bar, yells \"Quick! How tall is a penguin?\""
	}, {
		"body": "The Black Plague ",
		"id": "5std5f",
		"score": 14199,
		"title": "Only 1300's kids will get this.."
	}, {
		"body": "An Edison.",
		"id": "4tgwrd",
		"score": 14093,
		"title": "What do you call a stolen Tesla?"
	}, {
		"body": "21.",
		"id": "4ru1dt",
		"score": 14045,
		"title": "19 and 20 had a fight."
	}, {
		"body": "I really hope it's Todd, he's cute",
		"id": "4m1ag7",
		"score": 13992,
		"title": "My friends say there is a gay guy in our circle of friends..."
	}, {
		"body": "π-rates.",
		"id": "4ofred",
		"score": 13882,
		"title": "3.14% of sailors are..."
	}, {
		"body": "Nothing. Our engineering is perfect.",
		"id": "3oc8k3",
		"score": 13819,
		"title": "As a german I have to ask: You know what really grinds my gears?"
	}, {
		"body": "He was high on my list of priorities",
		"id": "4e2nal",
		"score": 13798,
		"title": "Today my stoner friend used my to-do list as a blunt wrap"
	}, {
		"body": "...has always been my Achilles' elbow.",
		"id": "522ymn",
		"score": 13776,
		"title": "My poor knowledge of Greek mythology..."
	}, {
		"body": "The look on their face when you're nailing them.",
		"id": "4c2hvq",
		"score": 13703,
		"title": "What's the difference between a hooker and jesus?"
	}, {
		"body": "www.reddit.com",
		"id": "34ckv7",
		"score": 13685,
		"title": "I found a website with guaranteed real virgins [NSFW]"
	}, {
		"body": "\\-Son, leave the room please.  \\-Dad, but I'm 23...  \\-I don't give a fuck how old you are, you're not going to watch me jack off.",
		"id": "52y76a",
		"score": 13677,
		"title": "Dad with his son are watching a movie when a sex scene begins"
	}, {
		"body": "\"Jeremy, you've been a doctor for over 8 years now, please stop starting every phone conversation we have with that.\"",
		"id": "3w3sol",
		"score": 13667,
		"title": "\"Mom? Don't freak out, but I'm in the hospital...\""
	}, {
		"body": "Last night, for example, I couldn't fall asleep because the rain kept telling me to go fuck myself.",
		"id": "5ru638",
		"score": 13626,
		"title": "My life completely changed after I learned Morse Code"
	}, {
		"body": "The cop opens the door and the driver falls out onto the asphalt. The cop says :  \"Holy shit, you're so drunk, you can't even walk!\"  The drunk says \"No shit, that's why I took my car!\"",
		"id": "4ugrah",
		"score": 13532,
		"title": "A cop pulls a guy over for suspected drunk driving."
	}, {
		"body": "Must be why I'm an only child  Edit: First time on front page thanks guys!",
		"id": "5rf224",
		"score": 13497,
		"title": "My dad always told me he never made the same mistake twice"
	}, {
		"body": "I know he's going to treat her well, I heard they worship cows.",
		"id": "4lklsg",
		"score": 13453,
		"title": "My wife left me for an Indian guy"
	}, {
		"body": "You will be mist.",
		"id": "52nq0f",
		"score": 13371,
		"title": "RIP boiling water"
	}, {
		"body": "that 1 doctor lives in flint michigan",
		"id": "43x82y",
		"score": 13358,
		"title": "9 out of 10 doctors reccommend for children to drink water instead of soda"
	}, {
		"body": "Him: \"What's the only mammal that can breathe under water?\"  Me: \"I dunno, what?\"  Him (loudly): \"An elephant sticking his trunk up!\"",
		"id": "50ka52",
		"score": 13353,
		"title": "A joke my 4 year old came up with today..."
	}, {
		"body": "black people would rob me",
		"id": "3i41wp",
		"score": 13344,
		"title": "If I got $1 every time somebody called me a racist"
	}, {
		"body": "Remove the ring and boom, house is gone!",
		"id": "4hutiw",
		"score": 13324,
		"title": "Wives are like grenades..."
	}, {
		"body": "Trying to get into smaller pants. ",
		"id": "3hm1sv",
		"score": 13323,
		"title": "Jared Fogle Of Subway Started and Ended His Career The Same Way."
	}, {
		"body": "Disabled.     EDIT: First post and front page. Woohoo!",
		"id": "4mzfo1",
		"score": 13315,
		"title": "I like my porn just how I like my search history"
	}, {
		"body": "They did unspeakable things to me.",
		"id": "4or8y7",
		"score": 13268,
		"title": "Ive just been molested by a group of mime artists..."
	}, {
		"body": "If it gets any worse, I'll have to let her in...",
		"id": "4rcmyl",
		"score": 13249,
		"title": "Since it started raining, all my wife has done is look sadly through the stupid window..."
	}, {
		"body": "The title says it all.",
		"id": "4pamaz",
		"score": 13221,
		"title": "It all."
	}, {
		"body": "Because it had a bad driver!  *drops mic*",
		"id": "3k8vdu",
		"score": 13206,
		"title": "I give to you a joke I made up when I was seven: Why did the computer crash?"
	}, {
		"body": "The Ex-Men.",
		"id": "4bhurd",
		"score": 13176,
		"title": "If Caitlyn Jenner were a super hero, what team would she be on?"
	}, {
		"body": "So they throw a cigarette overboard and the whole boat becomes a cigarette lighter.         Edit:   This got a lot more upvotes than i expected.",
		"id": "3v966f",
		"score": 13102,
		"title": "Three men are on a boat. They have four cigarettes, but nothing to light them with."
	}, {
		"body": "That way it will never come for me",
		"id": "453t62",
		"score": 13092,
		"title": "I hope Death is a woman"
	}, {
		"body": "At his funeral, we placed a lifejacket on his coffin.   It's what he would have wanted...",
		"id": "4kzkaj",
		"score": 13090,
		"title": "My friend Tommy drowned the other day..."
	}, {
		"body": "April, fools",
		"id": "4cvm0b",
		"score": 13026,
		"title": "What is Mr. T's favorite month?"
	}, {
		"body": "I started a company selling land mines that look like prayer mats.  Prophets are going through the roof.",
		"id": "4aol73",
		"score": 13021,
		"title": "I started a company..."
	}, {
		"body": "Because fuck you, you stupid piece of shit. ",
		"id": "3o86pg",
		"score": 12975,
		"title": "Damn girl are you a Rubik's cube?"
	}, {
		"body": "He started counting and fell asleep.",
		"id": "5qorbh",
		"score": 12914,
		"title": "I asked my Welsh mate how many sexual partners he's had."
	}, {
		"body": "It was having a mid-life crisis.",
		"id": "4ywvul",
		"score": 12907,
		"title": "Why was the baby in Africa crying?"
	}, {
		"body": "Apparently she left me two days ago.",
		"id": "4v7k9q",
		"score": 12901,
		"title": "I couldn't find the thingy that peels the potatoes and the carrots, so I asked the kids..."
	}, {
		"body": "Mumbai! ",
		"id": "4vgu6t",
		"score": 12881,
		"title": "What did the Indian boy say to his mother as he left for school?"
	}, {
		"body": "...is only one sea away from Ireland?",
		"id": "531f5z",
		"score": 12832,
		"title": "Did you know that Iceland..."
	}, {
		"body": "People in Dubai don't like the Flintstones but people in Abu Dhabi doooooo.",
		"id": "3mioq3",
		"score": 12812,
		"title": "What's the difference between Dubai and Abu Dhabi?"
	}, {
		"body": "For Hispanic attacks.",
		"id": "4e6nu9",
		"score": 12733,
		"title": "Why did the Mexican take Xanax?"
	}, {
		"body": "Would it be safe to say that my addiction got out of hand?",
		"id": "444db4",
		"score": 12588,
		"title": "If I was addicted to masturbation, and then became addicted to sex..."
	}, {
		"body": "She's a reddit admin ",
		"id": "39flhw",
		"score": 12582,
		"title": "Yo mama so fat"
	}, {
		"body": "The constant beeping was giving me a headache and making me feel sick.",
		"id": "4lnm2l",
		"score": 12549,
		"title": "I had to remove the battery from my carbon monoxide detector."
	}, {
		"body": "There's no dental records and all the DNA matches",
		"id": "4jfo1n",
		"score": 12467,
		"title": "Why are redneck murders so hard to solve?"
	}, {
		"body": "Not a political post, I just love to travel",
		"id": "4r6wfa",
		"score": 12437,
		"title": "If Trump wins Im leaving the country if Clinton wins Im leaving the country"
	}, {
		"body": "Husband texts back: \"Gently pour some lukewarm water over it and then *gently* tap edges with hammer.\"  Wife texts back 10 minutes later: \"Computer really messed up now.\"",
		"id": "3u539f",
		"score": 12427,
		"title": "Wife texts husband on a cold winter morning: \"Windows frozen, won't open.\""
	}, {
		"body": "I don't fucking know I'm just a drone pilot",
		"id": "5r37xu",
		"score": 12388,
		"title": "What's the difference between a Pakistani school and a terrorist camp?"
	}, {
		"body": "Every time a girl gets pregnant, a guy leaves town.",
		"id": "4yzwrx",
		"score": 12379,
		"title": "My town's population never changes"
	}, {
		"body": "This is my first post, make it good. I want memes",
		"id": "4kfbst",
		"score": 12328,
		"title": "Memes"
	}, {
		"body": "“Hey kid, want to buy some candy?”",
		"id": "4b3rai",
		"score": 12321,
		"title": "What do Jewish pedophiles say?"
	}, {
		"body": "Honey I'll be home in 20 minutes.",
		"id": "47zm2c",
		"score": 12284,
		"title": "What does Bill say to Hillary after sex?"
	}, {
		"body": "But I guess I'll take a shot at it. ",
		"id": "53jg40",
		"score": 12282,
		"title": "As a cop, I don't know how to deal with black people..."
	}, {
		"body": "They both change your ring tone",
		"id": "4x7ywp",
		"score": 12263,
		"title": "What do a cell phone and anal bleach have in common?"
	}, {
		"body": "Because if he wins, he'll have to move into a smaller house in a black neighborhood.",
		"id": "44k10x",
		"score": 12258,
		"title": "Why does Donald Trump secretly want to lose the election?"
	}, {
		"body": "Whoops, wrong sub.",
		"id": "3di2v3",
		"score": 12197,
		"title": "TIL: After Pearl Harbor, US warships fired upon friendly u boats heading back to port."
	}, {
		"body": "They didn't spend all that time in the closet doing nothing.  Edit: ( ͡ʘ ͜ʖ ͡ʘ)",
		"id": "3gyusq",
		"score": 12177,
		"title": "Why are gay men so well dressed?"
	}, {
		"body": "They'll kill your dog.",
		"id": "4jmi2a",
		"score": 12137,
		"title": "Police are like a box of chocolates...."
	}, {
		"body": "How I bought your mother",
		"id": "4dyyyp",
		"score": 12126,
		"title": "Whats Saudi Arabia's highest rated sitcom?"
	}, {
		"body": "You can hide, but you can't run.",
		"id": "3nimwj",
		"score": 12099,
		"title": "To the guy in the wheelchair who stole my camouflage jacket:"
	}, {
		"body": "You don't have to beg your wife to blow your paycheck",
		"id": "4m71t5",
		"score": 12076,
		"title": "What's the difference between a paycheck and a penis?"
	}, {
		"body": "Obviously not 8, because its still dark in my basement.",
		"id": "4teb7r",
		"score": 12071,
		"title": "How many dead prostitutes does it take to change a lightbulb?"
	}, {
		"body": "All of its servers were busy...",
		"id": "3logxu",
		"score": 12061,
		"title": "I went to the Reddit restaurant"
	}, {
		"body": "They'll kill your dog",
		"id": "2kzxpp",
		"score": 11960,
		"title": "Crazy ex-girlfriends are like a box of chocolate"
	}, {
		"body": "Because Ken always came in another box.",
		"id": "5rjwbv",
		"score": 11921,
		"title": "Why didn't barbie ever get pregnant?"
	}, {
		"body": "Because his whole life he's Ben Solo",
		"id": "4d1nl0",
		"score": 11890,
		"title": "Why does Kylo Ren have no friends?"
	}, {
		"body": "I asked him the other day \"how do you tell them apart?\"  He said   \"Well, Stacy is the blonde with a perfect ass, great tits, and a fantastic figure...   ... And Brian's got a cock\" ",
		"id": "4tng1l",
		"score": 11856,
		"title": "So my mate has started dating twins!"
	}, {
		"body": "How many \"friend zoned\" guys does it take to change a light bulb?   None. They just compliment it and get mad when it won't screw. ",
		"id": "3g68j3",
		"score": 11801,
		"title": "How many \"friend zoned\" guys does it take to change a lightbulb?"
	}, {
		"body": "My friend gave it to me as he was dying.  It seemed very important to him that I have it.",
		"id": "2g7yxo",
		"score": 11798,
		"title": "I have an EpiPen."
	}, {
		"body": "Youd almost think it was built on top of thousands of ancient indian burial grounds.   Edit: Hey thanks for the gold stranger! ",
		"id": "3gq3i8",
		"score": 11780,
		"title": "The US is having so many disasters and tragedies"
	}, {
		"body": " \"Surely it's not going to rain today?\"  She said \"it will, and don't call me Shirley\"    ...Forgot to take my phone off Airplane mode.  ",
		"id": "2fpuid",
		"score": 11778,
		"title": "Just asked Siri."
	}, {
		"body": "Yeah, I gave 'em my too weak notice ",
		"id": "4dowl0",
		"score": 11775,
		"title": "I'm kinda scrawny, so I had to quit my job as a personal trainer"
	}, {
		"body": "It's called 'Facebook'",
		"id": "4olcyo",
		"score": 11739,
		"title": "I just installed a new app on my phone that lets me know which of my friends are racist."
	}, {
		"body": "Donald Trump's tie.",
		"id": "3lx6gb",
		"score": 11688,
		"title": "What's 18 inches long and hangs in front of an asshole?"
	}, {
		"body": "When he suddenly mumbled, \"Fucking shitty lid!\". My wife immediately looked at me and said, \"I wonder where he's got that from?\". I said, \"The fucking fridge, you silly cunt.\"",
		"id": "4ybov2",
		"score": 11673,
		"title": "My 4yr old was struggling to open his yoghurt, today."
	}, {
		"body": " Hot, clean, and she'll kill any baby I put inside her.",
		"id": "4o0vvv",
		"score": 11639,
		"title": "I like my women like I like my microwave"
	}, {
		"body": "Seven",
		"id": "4vc9yf",
		"score": 11634,
		"title": "How do you confuse a gay person?"
	}, {
		"body": ".",
		"id": "3u8yg1",
		"score": 11623,
		"title": "I don't know what the big deal is about Black Friday. All Fridays matter."
	}, {
		"body": "They both want to get there before the hare does.  ",
		"id": "40eh7v",
		"score": 11593,
		"title": "What does a turtle and a pedophile have in common?"
	}, {
		"body": "Quite ironic that 72 virgins will be attacking the terrorists!",
		"id": "2sf00p",
		"score": 11586,
		"title": "So I heard that the hackers \"Anonymous\" are waging war on ISIS and al-Qaeda..."
	}, {
		"body": "You have my Word.",
		"id": "4qg030",
		"score": 11491,
		"title": "To whoever stole my copy of Microsoft Office: I will find you.."
	}, {
		"body": "Girlfriend: \"I'm sick of you pretending you're a detective. I think we should split up.\"  Me: \"Good idea. We can cover more ground that way.\"",
		"id": "437bdk",
		"score": 11460,
		"title": "My girlfriend told me she's sick of me pretending to be a detective."
	}, {
		"body": "That takes the number of girls I've made wet this year to -1.",
		"id": "373dmv",
		"score": 11459,
		"title": "I lent a hot girl my umbrella yesterday."
	}, {
		"body": "... and I said, yes, but they R2D2.",
		"id": "3xl44b",
		"score": 11458,
		"title": "My friend asked me if the new Star Wars was in 3D..."
	}, {
		"body": "now I only drink for evil",
		"id": "53eq57",
		"score": 11439,
		"title": "Today I quit drinking for good"
	}, {
		"body": "Anybody know what \"ternative\" means?",
		"id": "4zfbw9",
		"score": 11397,
		"title": "My girlfriend texted me \"helpmyspacebarbrokecanyoucomeoverandgivemeanalternative\""
	}, {
		"body": "Then I remembered that my wife & I have different dentists.",
		"id": "43tmyd",
		"score": 11286,
		"title": "My dentist reminded me of my wife's sensitive gag reflex. We laughed & laughed."
	}, {
		"body": "Because if they fell forward, they'd still be in the boat.",
		"id": "3gthr3",
		"score": 11230,
		"title": "Why do scuba divers fall backwards off of the boat?"
	}, {
		"body": "Just like one of his characters.  (If this trash of a post hit the front page, the title could really mess with some GoT fans, I'm just saying)",
		"id": "503dys",
		"score": 11222,
		"title": "George R R Martin, dead after reaching peak popularity"
	}, {
		"body": "Will make your car look fucking stupid",
		"id": "4ikqzj",
		"score": 11219,
		"title": "Warning: Game of Thrones Spoilers"
	}, {
		"body": "Mount Rushmore",
		"id": "4cak7q",
		"score": 11178,
		"title": "What rock group has four men that don't sing?"
	}, {
		"body": "Cost me a fortune in stamps ",
		"id": "45qjaq",
		"score": 11171,
		"title": "TIFU by sending my nudes to everyone in my address book"
	}, {
		"body": "Nothing, they fast.   I'll see myself out. ",
		"id": "2z0wx5",
		"score": 11170,
		"title": "What do sprinters eat before a race?"
	}, {
		"body": "Because that's where students have the most potential.",
		"id": "52te9z",
		"score": 11164,
		"title": "Why is it best to teach physics on the edge of a cliff? (Original joke)"
	}, {
		"body": "Remains to be seen.",
		"id": "4176c2",
		"score": 11163,
		"title": "Will glass coffins be a success?"
	}, {
		"body": "On my lap. Turned on. Virus free.",
		"id": "4a0s3o",
		"score": 11157,
		"title": "I like my women how I like my computer."
	}, {
		"body": "I can't remember the last time I ate a monkey.",
		"id": "4awt3d",
		"score": 11147,
		"title": "TIL Humans eat more bananas than monkeys."
	}, {
		"body": "The people in Dubai don't watch the Flintstones but the people in Abu Dhabidoooo!",
		"id": "4l61v8",
		"score": 11128,
		"title": "What is the difference between Dubai and Abu Dhabi?"
	}, {
		"body": "Unfortunately my pen turned into a gorilla and the floor melted",
		"id": "4zo7vf",
		"score": 11104,
		"title": "For our chemistry exam we had to write a thousand words on acid."
	}, {
		"body": "I stick a tube of toothpaste up my ass for complete cavity protection.",
		"id": "52vluu",
		"score": 11098,
		"title": "To avoid being raped when I am in jail..."
	}, {
		"body": "How shitty of a parent are you?",
		"id": "4oixux",
		"score": 11078,
		"title": "On a scale of Alligator to Gorilla...."
	}, {
		"body": "I shout, \"Fuck! Seriously? I was going to eat that later, and now it's just going to taste like carrots!\"",
		"id": "4mgt31",
		"score": 11078,
		"title": "So, I walk in on daughter masturbating with a carrot."
	}, {
		"body": "Because you're super annoying and won't shut up",
		"id": "3o5how",
		"score": 11034,
		"title": "Damn girl are you a smoke detector?"
	}, {
		"body": "I'll be in my lab.",
		"id": "4id1go",
		"score": 11024,
		"title": "I'm a scientist that's researching beastiality between humans and dogs"
	}, {
		"body": "That's common sense leaving your body.   Edit: now I know what people mean when they say \"RIP inbox\". ",
		"id": "5r5h9a",
		"score": 10960,
		"title": "You know that tingly sensation you get when you like somebody?"
	}, {
		"body": "hope you find it funny!",
		"id": "2aj3p9",
		"score": 10956,
		"title": "I tried changing my password to \"brazildefense\" but Reddit said it was too weak"
	}, {
		"body": "So I have.   She's 25 and her name is Candy.",
		"id": "4xz3a1",
		"score": 10896,
		"title": "As I approach 50, my wife suggested I get myself one of those high performance penis enlargers..."
	}, {
		"body": "They're so full of themselves.",
		"id": "53b07y",
		"score": 10764,
		"title": "I hate Russian dolls."
	}, {
		"body": "You can hide, but you can't run. ",
		"id": "4nb5ei",
		"score": 10733,
		"title": "To the guy in the wheelchair who stole my camouflage jacket,"
	}, {
		"body": "A new Cadillac Escalade with cruise control, lane alert, navigation, downhill descent control and parking assist.",
		"id": "4jwf3y",
		"score": 10697,
		"title": "What's big, black and loaded with aids?"
	}, {
		"body": "If I had a dollar for every girl that found me unattractive, they would eventually find me attractive. ",
		"id": "2r9bds",
		"score": 10696,
		"title": "Women and not being attractive"
	}, {
		"body": "...because its not a Target.",
		"id": "4rzv9b",
		"score": 10622,
		"title": "Why wont ISIS bomb my local Walmart?"
	}, {
		"body": "The police told us to stay inside until they shot him",
		"id": "511jsd",
		"score": 10605,
		"title": "There was a blackout in my neighborhood last night"
	}, {
		"body": "He started counting but fell asleep.    Edit: WOW my top post is now a bestiality joke. Thanks guys :)",
		"id": "4lyk2f",
		"score": 10565,
		"title": "I asked a Scottish friend of mine how many sexual partners he'd had."
	}, {
		"body": "Now it's a Ford Focus. ",
		"id": "4lj8lm",
		"score": 10538,
		"title": "I left my adderall in my Ford Fiesta."
	}, {
		"body": "She will kill me if she finds out.   Edit: Holy poop, front page of reddit mum get the camera ",
		"id": "49in74",
		"score": 10498,
		"title": "My girlfriend is a pornstar"
	}, {
		"body": "The police told us to stay in our houses until they'd shot him   Edit: I am not black, nor am i a racist! My aim was to get to the front page and i BOOYAA Mission accomplished.",
		"id": "45b019",
		"score": 10445,
		"title": "There was a blackout in my neighborhood last night."
	}, {
		"body": "You know he's guilty.",
		"id": "3ro9qg",
		"score": 10436,
		"title": "Why is the white guy the scariest guy in prison?"
	}, {
		"body": "Or just mine ?",
		"id": "4t92tm",
		"score": 10406,
		"title": "Is it all black people that have a problem with slavery?"
	}, {
		"body": "just dim down the lights and put on a couple horror movies. After a while, you won't feel like you are alone anymore.",
		"id": "4s2iu7",
		"score": 10398,
		"title": "If you ever feel lonely..."
	}, {
		"body": "Without other people's dicks in it.",
		"id": "4lsyl9",
		"score": 10362,
		"title": "I broke up with my girlfriend because I like my women like I like my coffee"
	}, {
		"body": "I had the joy of meeting a couple of hipsters today, and they yelled at me for making fun of them. Apparently the politically correct term is \"conjoined twins\".",
		"id": "3je9b2",
		"score": 10278,
		"title": "Hipsters"
	}, {
		"body": "I'll let you know",
		"id": "2moy4x",
		"score": 10248,
		"title": "I just ordered a chicken and an egg from Amazon."
	}, {
		"body": " Well she’s in for a shock. ",
		"id": "4gk79i",
		"score": 10213,
		"title": "My girlfriend says I’m hopeless at fixing appliances."
	}, {
		"body": "her mom says \"A WHAT\"?!!   The daughter says \"a prostitute\" then the mom says \"thank god... I thought you said a Protestant\"",
		"id": "4dbwpx",
		"score": 10204,
		"title": "An Irish girl tells her mom she decided to be a prostitute."
	}, {
		"body": "Their knees.  (Not sure if this one translates well to english)    EDIT: Wow guys I didn't think you would like this joke that much. This was something I read on a book like 6 years ago. Thanks! ",
		"id": "2h1sfp",
		"score": 10194,
		"title": "What do women put on their ears to look more attractive?..."
	}, {
		"body": "It's not my fault they don't have Windows",
		"id": "4f1jfi",
		"score": 10090,
		"title": "I once farted in the Apple Store and everybody got pissed"
	}, {
		"body": "",
		"id": "3x9ym5",
		"score": 10082,
		"title": "5 out of 6 scientists say Russian Roulette is safe."
	}, {
		"body": "  It could happen.",
		"id": "4asj1j",
		"score": 10080,
		"title": "An Irish guy walks out of a bar...."
	}, {
		"body": "Don't worry ladies, I also donated $7.80 to Hilary.",
		"id": "462amt",
		"score": 10049,
		"title": "I donated $10 to Bernie's campaign"
	}, {
		"body": "...hands down.",
		"id": "525f2m",
		"score": 10020,
		"title": "6:30 is the best time on a clock..."
	}, {
		"body": "One. We are efficient and dont have humour.     Edit: Wow this blew up. As a German, I didnt expect this. ",
		"id": "3i2z4r",
		"score": 10012,
		"title": "How many Germans does it take to change a light bulb?"
	}, {
		"body": "He's gay, definitely gay.",
		"id": "4xwgqw",
		"score": 10007,
		"title": "If a woman sleeps with 10 men she's a slut, but if a man does it.........."
	}, {
		"body": "\"Why the long face?\" asks the bartender... The horse replies, \"I can no longer make ends meet based solely on the royalties from Sex in the City.\"",
		"id": "4rj9cn",
		"score": 9978,
		"title": "A horse walks into a bar..."
	}, {
		"body": "",
		"id": "3oljnm",
		"score": 9963,
		"title": "My new thesaurus is terrible. Not only that, but it's also terrible."
	}, {
		"body": "Two. One to change it, and the other to hold the penis.   EDIT: LADDER. I MEANT LADDER.",
		"id": "4clcqu",
		"score": 9949,
		"title": "How many Freudian analysts does it take to change a light bulb?"
	}, {
		"body": "                             They all looked shocked when I didn't stop ",
		"id": "3rlj3w",
		"score": 9939,
		"title": "I walked into a room full of men masturbating"
	}, {
		"body": "Credit to my friend Chris",
		"id": "4xg2ng",
		"score": 9937,
		"title": "If a rich man dies from a drug overdose, the headline should read \"Pills bury dough boy\""
	}, {
		"body": "Use chemicals to remove the Polish and you're literally Hitler.",
		"id": "4efica",
		"score": 9910,
		"title": "Use chemicals to remove polish and no one bats an eye"
	}, {
		"body": "Anybody know what 'ternative' means?",
		"id": "2ijhhi",
		"score": 9898,
		"title": "My girlfriend just text me, 'thespacebuttonisbrokenonmyphonecanyoupleasegivemeanalternative'"
	}, {
		"body": "She felt threatened by someone more malignant than herself",
		"id": "3c46zr",
		"score": 9868,
		"title": "Why did Ellen Pao fire an employee with cancer?"
	}, {
		"body": "1) I want my remains spread out at Disney World  2) I do not want to be cremated. ",
		"id": "4068c8",
		"score": 9840,
		"title": "I have two requirements in my will...."
	}, {
		"body": "You can tuna piano, but you can't piano a tuna.",
		"id": "3jqq8t",
		"score": 9814,
		"title": "What's the difference between tuna, a piano and glue?"
	}, {
		"body": "For the watch",
		"id": "3a4ut1",
		"score": 9814,
		"title": "Why did Jon Snow stand in line for 6 hours at the Apple Store?"
	}, {
		"body": "Because they are dead. ",
		"id": "3s7vif",
		"score": 9791,
		"title": "Why can't you hear a pterodactyl go to the bathroom?"
	}, {
		"body": "Because black men always get a longer sentence",
		"id": "4r2j17",
		"score": 9769,
		"title": "Why did Obama get two terms?"
	}, {
		"body": "My dad was holding me from behind .",
		"id": "51kp3v",
		"score": 9762,
		"title": "My first time having sex was like my first time riding a bike"
	}, {
		"body": "",
		"id": "2uor3n",
		"score": 9723,
		"title": "If Al Gore started a math rock band it should be called Algorhythm"
	}, {
		"body": "The higher they are, the more spaced out they get",
		"id": "3qkaoy",
		"score": 9709,
		"title": "What do prime numbers and stoners have in common?"
	}, {
		"body": "Because it's white and settles on their land.  Edit: well now I know what people mean by rip inbox.  Edit2: wtf happened to my headline, why is it Donald trump?",
		"id": "4cpfjq",
		"score": 9571,
		"title": "Why do Indians hate snow?"
	}, {
		"body": "Jesus: A table for 26, please.  Headwaiter:  But there's only . . . um, 13 of you.  Jesus: Yeah, we're all going to sit on the same side.",
		"id": "4bwui4",
		"score": 9563,
		"title": "Jesus and his disciples walk into a restaurant."
	}, {
		"body": "whether they like it or not.",
		"id": "367pl1",
		"score": 9520,
		"title": "My neighbors listen to awesome music"
	}, {
		"body": "That wasn't a very nice postcard to receive.",
		"id": "3ss42z",
		"score": 9514,
		"title": "My girlfriend said to me \"sex is better on holiday\"..."
	}, {
		"body": "Because of the triggers.  I'm sorry",
		"id": "3hdnu9",
		"score": 9491,
		"title": "Why don't feminists carry handguns?"
	}, {
		"body": "",
		"id": "3ke87k",
		"score": 9444,
		"title": "Wife: \"I look fat. Can you give me a compliment?\" Husband: \"You have perfect eyesight.\""
	}, {
		"body": "So I was like na, more like pirate and booty.",
		"id": "3pwpu9",
		"score": 9424,
		"title": "Girl asked me to netflix and chill, but I download all my movies illegally...."
	}, {
		"body": "And the bartender says ''How did you do that?''",
		"id": "4i9kps",
		"score": 9422,
		"title": "Snake walks into a bar."
	}, {
		"body": "WHAT DO WE WANT?!?!?  LOW FLYING AIRPLANE NOISES!!!  WHEN DO WE WANT ‘EM?!?!?  *NEEEEEYYYYOOOOOOOOWWWW*  Edit: Wow, this really took off. ",
		"id": "3p5en9",
		"score": 9394,
		"title": "WHAT DO WE WANT?!?!!"
	}, {
		"body": "The Somalian Olympics Team has just apologised to the Olympic Committee after realising that sailing and shooting were 2 separate events!!",
		"id": "4wwajg",
		"score": 9372,
		"title": "The Somalian Olympics team has just apologised"
	}, {
		"body": "A gun has only one trigger.",
		"id": "4hfevp",
		"score": 9333,
		"title": "What's the difference between a feminist and a gun?"
	}, {
		"body": "Turns out, all it does is just change the color of the baby. ",
		"id": "5tuntg",
		"score": 9318,
		"title": "I thought a vasectomy wouldn't get my wife pregnant.."
	}, {
		"body": "The blonde, because she's the only one who's 18.",
		"id": "44n8ix",
		"score": 9304,
		"title": "A blonde, brunette, and a redhead are all in the 9th Grade. Which one is the sexiest?"
	}, {
		"body": "One connects to all of your devices and accesses the data, the other is a hardware standard.",
		"id": "42l5vo",
		"score": 9304,
		"title": "What is the difference between USA and USB?"
	}, {
		"body": "Because they can't C#. ",
		"id": "53gvk1",
		"score": 9268,
		"title": "Why do Java programmers need glasses?"
	}, {
		"body": "After it wouldn't wash off this morning I went back to complain, but the tattoo parlour wasn't there.",
		"id": "2rbif4",
		"score": 9250,
		"title": "Yesterday I went to a temporary tattoo parlour to get a tattoo."
	}, {
		"body": "2, 3, 5, 7 and 11 are the prime suspects.  ",
		"id": "30tqhu",
		"score": 9245,
		"title": "4, 6, 8 and 9 have all been killed."
	}, {
		"body": "I don't think I can ever repay you.",
		"id": "3mdmue",
		"score": 9235,
		"title": "Thank you, student loans, for helping me get through college."
	}, {
		"body": "Bless her, she thinks I'm digging a pond.",
		"id": "49chan",
		"score": 9225,
		"title": "Spent over an hour at the wife's grave this morning."
	}, {
		"body": "IT'S FUCKING FROZEN",
		"id": "3nz3te",
		"score": 9221,
		"title": "What's Gordon Ramsay's favorite movie?"
	}, {
		"body": "Nothing. She's fine.   Edit: Wow guys. Thanks so much for the upvotes, the hilarious comments and I finally got my 1st gold! ",
		"id": "33h1x6",
		"score": 9219,
		"title": "What does a girl want more than anything in the world?"
	}, {
		"body": "1.   2.   3.",
		"id": "47u9xn",
		"score": 9215,
		"title": "The three unwritten rules of life"
	}, {
		"body": "1. Murderer 2. Police telling me everyone is dead 3. That book I ordered about positive thinking",
		"id": "4r9yei",
		"score": 9195,
		"title": "My top 3 assumptions when doorbell rings:"
	}, {
		"body": "A Marxman.",
		"id": "48dgl4",
		"score": 9171,
		"title": "What do you call a Communist sniper?"
	}, {
		"body": "I'm not really a mourning person. ",
		"id": "50rx0c",
		"score": 9134,
		"title": "I hate how funerals are always at 9 or 10am..."
	}, {
		"body": "It's a complex complex complex.",
		"id": "3tjxw6",
		"score": 9113,
		"title": "I have a phobia of over engineered buildings"
	}, {
		"body": "\"Dad, my girlfriend's pregnant.\"  \"I'm not mad, just disappointed.\"  \"Hi disappointed, I'm dad.\"  \"Did you jus...\"  \"Yes.\"  \"You're ready.\"  \"I'm not ready, I just told you that I'm dad.\"",
		"id": "3fbdgd",
		"score": 9078,
		"title": "Dad my girlfriends pregnant"
	}, {
		"body": "1) legalize all drugs. 2) require that all drugs be purchased through Comcast customer service.",
		"id": "2y4wh6",
		"score": 9077,
		"title": "How to win the war on drugs"
	}, {
		"body": "My girlfriend said if this gets 1000 votes we'll try anal. So please don't vote, her strap on is huge and it really scares me.   ",
		"id": "384b2y",
		"score": 9067,
		"title": "my girlfriends said if this gets 1000 up votes"
	}, {
		"body": "No name was given but he was a high wanking officer.",
		"id": "49v13m",
		"score": 9052,
		"title": "An officer was fired for smoking cannabis and masturbating on the job."
	}, {
		"body": "So I got a dog, a new motorbike, shagged 2 women and blew a grand on drugs and alcohol.   She's going to go fucking nuts when she gets back from work.",
		"id": "44avcp",
		"score": 9010,
		"title": "When my wife left, I was sad and lonely"
	}, {
		"body": "Tell a woman she's fat once and she will remember it for the rest of her life because elephants never forget. ",
		"id": "43hj53",
		"score": 9006,
		"title": "Tell a woman she's beautiful a hundred times and she won't believe you."
	}, {
		"body": "He replied, \"I still love Vista, baby\". ",
		"id": "3f05ye",
		"score": 8991,
		"title": "Arnold Schwarzenegger was asked if he wanted to upgrade to Windows 10."
	}, {
		"body": "Then I would be able to afford a house in the economy they ruined.",
		"id": "387r7w",
		"score": 8965,
		"title": "You know, if I had a dollar for every time someone over fifty told me my generation sucks..."
	}, {
		"body": "It can be understood through tough thorough thought, though.  Edit: R.I.P My inbox",
		"id": "35edaq",
		"score": 8952,
		"title": "English is weird.."
	}, {
		"body": "after all those extra hours I put in.",
		"id": "4osu4v",
		"score": 8950,
		"title": "I've just been fired from the clock making factory"
	}, {
		"body": "Mom: *Stares at Dad*  Dad: *Clenches fist*  Mom: \"Don't!\"  Dad: *Sweats Profusely*  Mom: \"...\"  Dad: \"HI GAY, I'M DAD\"   Edit: Yay top of r/jokes, #lifegoals Also formatting",
		"id": "3z7ia9",
		"score": 8936,
		"title": "Son: \"Mom, Dad, I'm gay.\""
	}, {
		"body": "Because the sign says No Tres passing",
		"id": "4ym2cy",
		"score": 8928,
		"title": "Why do Mexicans always cross the border in twos?"
	}, {
		"body": "unless everyone gets them",
		"id": "42cs0m",
		"score": 8914,
		"title": "Communist jokes are not funny..."
	}, {
		"body": "..is 25.8069758 the root of all evil?  Edit: My first gold! Thank you kind stranger.",
		"id": "456qj9",
		"score": 8863,
		"title": "If the number 666 is considered evil"
	}, {
		"body": "He was in the middle of 9/11.",
		"id": "3haaho",
		"score": 8805,
		"title": "Why did 10 die?"
	}, {
		"body": "I've entered my sister...   ",
		"id": "4k0ws9",
		"score": 8756,
		"title": "My city is holding their annual incest competition..."
	}, {
		"body": "Then the librarian told me to take it out.",
		"id": "2hoygf",
		"score": 8745,
		"title": "My penis was in the Guinness book of world records..."
	}, {
		"body": "Because he couldn't find the Droid he was looking for.",
		"id": "41p1ns",
		"score": 8744,
		"title": "Why did the Stormtrooper buy an iPhone?"
	}, {
		"body": "Plagiarism.  ---   EDIT : This joke was invented by me and copyrighted. Dare to take it and a lawsuit shall find you.  ",
		"id": "43jk9a",
		"score": 8722,
		"title": "I invented a new word."
	}, {
		"body": "not every one gets it.",
		"id": "2jqk02",
		"score": 8715,
		"title": "Food is like dark humor"
	}, {
		"body": "- comedy removed due to complaints -  ",
		"id": "3n7vdt",
		"score": 8697,
		"title": "A feminist and a Muslim walk into a bar."
	}, {
		"body": "But I couldn't find a manual.",
		"id": "3098tw",
		"score": 8680,
		"title": "I wanted to learn how to drive a stick shift."
	}, {
		"body": "Without looking like a twat",
		"id": "34mgc2",
		"score": 8657,
		"title": "TIL it's impossible to stick your tongue out and look up at the same time"
	}, {
		"body": "...\"Well I'm your man\" I replied,\"In my last job, whenever anything went wrong they said I was responsible\"",
		"id": "4ucvkk",
		"score": 8640,
		"title": "I went for a job interview today and the manager said,\"We're looking for someone who is responsible\""
	}, {
		"body": "I've been his customer for 6 years. I had no idea he was a barber",
		"id": "496u0p",
		"score": 8637,
		"title": "My neighborhood barber just got arrested for selling drugs.."
	}, {
		"body": "...at least Charlie Sheen is staying positive.",
		"id": "3t5z8o",
		"score": 8624,
		"title": "With all the negativity in the world today..."
	}, {
		"body": "I'm so glad I'm in the 1%.",
		"id": "43dwjg",
		"score": 8619,
		"title": "9 out of 10 Americans are stupid..."
	}, {
		"body": "You could say they are going toupée for it. ",
		"id": "3khkw1",
		"score": 8588,
		"title": "America is going to suffer if Donald Trump becomes president."
	}, {
		"body": "When I rolled down my window to ask what was wrong, she said  \"NOTHING\"",
		"id": "2u9n6x",
		"score": 8574,
		"title": "I got pulled over by a female cop..."
	}, {
		"body": "I wish I could post it in another subreddit  Edit: Thanks for gold :D",
		"id": "3odlum",
		"score": 8567,
		"title": "Today a girl kissed me"
	}, {
		"body": "The Spanish Inquisition.",
		"id": "476u7p",
		"score": 8558,
		"title": "Who wears a red suit and knows if you were naughty or nice?"
	}, {
		"body": "They did unspeakable things to me",
		"id": "4e62ah",
		"score": 8556,
		"title": "I was raped by a group of mimes"
	}, {
		"body": "In 200 years the milk will have developed a culture",
		"id": "4gtli4",
		"score": 8556,
		"title": "What's the difference between america and a bottle of milk?"
	}, {
		"body": "I hope.      Edit: Guys I'm so confused, wtf is going on",
		"id": "4csixa",
		"score": 8547,
		"title": "Dads are like boomerangs...."
	}, {
		"body": "Give a man a plane ticket and he'll fly for a day.  Push a man from a plane and he'll fly for the rest of his life.",
		"id": "4s83lx",
		"score": 8540,
		"title": "Give a man a plane ticket..."
	}, {
		"body": "He said, \"Do you know how fast you were going?\"   \"I was trying to keep up with traffic,\" he replied.  He said, \"There is no traffic.\"   And the guy answered, \"That's how far behind I am.\"  ",
		"id": "3i1p09",
		"score": 8538,
		"title": "A cop stopped a guy for speeding..."
	}, {
		"body": "You have to drop the bomb on her twice before she gets it.",
		"id": "2lkg6d",
		"score": 8519,
		"title": "What's the hardest part breaking up with a Japanese girlfriend?"
	}, {
		"body": "I can't wait to introduce my parents to my bride 2B",
		"id": "4ms3jo",
		"score": 8470,
		"title": "I've decided to marry a pencil"
	}, {
		"body": "He's an \"alternative romantic.\"",
		"id": "5qh9f7",
		"score": 8458,
		"title": "Donald Trump is not a rapist."
	}, {
		"body": "I haven't had to buy dog food in a long, long time.",
		"id": "50pqw1",
		"score": 8444,
		"title": "The best part about being an abortionist..? [NSFW]"
	}, {
		"body": "I said: \"Of course I would. I'd miss you, but I'd still love you.\"",
		"id": "36jip0",
		"score": 8438,
		"title": "My wife said to me: \"If you won the lottery, would you still love me?\""
	}, {
		"body": "If they are on your shoulders, she probably likes you.",
		"id": "4o6qvd",
		"score": 8419,
		"title": "You can tell a lot about a woman from her ankles."
	}, {
		"body": "Juan by Juan.",
		"id": "3icqz1",
		"score": 8400,
		"title": "How's Donald Trump going to get rid of all the Mexicans?"
	}, {
		"body": "All of the ones I've met have just been Jew-ish",
		"id": "3parv4",
		"score": 8391,
		"title": "Why haven't I ever met a full blooded jew?"
	}, {
		"body": "than the men who mention it",
		"id": "41ebua",
		"score": 8385,
		"title": "New study reveals that women slightly overweight live longer"
	}, {
		"body": "They said thank you. I said don't mention it.",
		"id": "3ys0xp",
		"score": 8373,
		"title": "I bought my friend an elephant for their room."
	}, {
		"body": "I lost my case.",
		"id": "3rhi7f",
		"score": 8295,
		"title": "I tried to sue the airport for misplacing my luggage."
	}, {
		"body": "By holding the bulb up to the socket and waiting for the world to revolve around them  EDIT: Rip inbox   EDIT 2: Thanks for the gold!",
		"id": "51rwp3",
		"score": 8289,
		"title": "How do feminists screw in a lightbulb?"
	}, {
		"body": "It's gonna take me a little while to get hard, I just got laid by this chick.",
		"id": "31bkc6",
		"score": 8282,
		"title": "What did the egg say to the boiling water?"
	}, {
		"body": "Find out next time, on Dragon Ball Z!",
		"id": "3hssdt",
		"score": 8265,
		"title": "How many super saiyans does it take to change a light bulb?"
	}, {
		"body": "Who says they can't integrate into American culture?",
		"id": "4o32lp",
		"score": 8242,
		"title": "A Muslim guy killed 50 people in a mass shooting…"
	}, {
		"body": "1, 2, 3, 95, 98, NT, 2000, XP, Vista, 7, 8, 10    ----  Edit: I think I may be missing a version, but looking through the comments it seems no one else knows what it is either. I'll have to google it.",
		"id": "38u98f",
		"score": 8239,
		"title": "Hi. My name is Bill Gates and today, I will be teaching you how to count to ten:"
	}, {
		"body": "",
		"id": "3bxrfq",
		"score": 8236,
		"title": "Reddit"
	}, {
		"body": "Actually, you'll get it tomorrow",
		"id": "3l1vzm",
		"score": 8230,
		"title": "Here's a FedEx joke"
	}, {
		"body": "...it was Luke warm.",
		"id": "2iouap",
		"score": 8211,
		"title": "Why was Han Solo so suspicious when he put his penis inside Princess Leia for the first time?"
	}, {
		"body": "Because in charge of sequence, Yoda was.",
		"id": "3sm0qb",
		"score": 8207,
		"title": "Why did the Star Wars movies come out in the sequence 4, 5, 6, 1, 2, 3?"
	}, {
		"body": "[Removed]",
		"id": "51u30w",
		"score": 8203,
		"title": "Headphone Jack"
	}, {
		"body": "We went and had drinks. Cool guy, wants to be a web designer. ",
		"id": "3t42fi",
		"score": 8191,
		"title": "My wife told me to take a spider out instead of killing it"
	}, {
		"body": "He'll be warm for the winter. Teach a man to jacket he won't leave the house.",
		"id": "3uuwra",
		"score": 8176,
		"title": "Give a man a jacket"
	}, {
		"body": "But I laugh more.",
		"id": "3x71il",
		"score": 8121,
		"title": "My girlfriend and I often laugh about how competitive we are"
	}, {
		"body": "Donald Trump",
		"id": "3vrh5x",
		"score": 8110,
		"title": "Wanna hear a racist joke?"
	}, {
		"body": "To reverse and leaving the scene",
		"id": "37choa",
		"score": 8104,
		"title": "I saved a bunch of money on my car insurance by switching"
	}, {
		"body": "America.",
		"id": "4hsdai",
		"score": 8098,
		"title": "Donald Trump and Hillary Clinton are in a plane crash. Who survives?"
	}, {
		"body": "They couldn't settle on a name, until it hit them!  They named him Ravi O. Lee  Sorry",
		"id": "3hyz96",
		"score": 8084,
		"title": "A boy was born of an Indian, Chinese, Irish, and Italian grandmother..."
	}, {
		"body": "In the ark hives",
		"id": "45e9si",
		"score": 8074,
		"title": "Where did Noah keep his bees?"
	}, {
		"body": "",
		"id": "3nuffk",
		"score": 8066,
		"title": "A Japanese man once tried to fake his own death. His family didn't bereave him."
	}, {
		"body": "But apparently it just changes the colour of the baby  EDIT: Holy shit my first front page! Also RIP inbox ",
		"id": "39d5kt",
		"score": 8066,
		"title": "I thought my vasectomy would keep my wife from getting pregnant"
	}, {
		"body": "I wore the wrong socks this morning    *Edit: Not my joke but haven't seen it here and thought it was funny :)*",
		"id": "4bbwdk",
		"score": 8053,
		"title": "Why did the semen cross the road?"
	}, {
		"body": "Damn dial-up!",
		"id": "40heu4",
		"score": 8050,
		"title": "When I see a girl, I first look at her hair. Then at her eyes, lips, neck..."
	}, {
		"body": "Police think it might be race related. ",
		"id": "3es554",
		"score": 8021,
		"title": "Today someone was killed with a starter pistol."
	}, {
		"body": "\"And then things got worse.\"",
		"id": "340qv8",
		"score": 8020,
		"title": "Russian history in 5 words:"
	}, {
		"body": "Mom: \"Well pick one sweetie, you can't do both.﻿\"",
		"id": "4eh2jn",
		"score": 8016,
		"title": "Little girl: \"Mommy, I want to be a feminist when I grow up.\""
	}, {
		"body": "At least the one I fucked did.",
		"id": "4buvas",
		"score": 8007,
		"title": "Did you know, that pigeons die when they have sex?"
	}, {
		"body": "About 10 dollars.",
		"id": "41ldce",
		"score": 8002,
		"title": "What is the capital of Greece?"
	}, {
		"body": "",
		"id": "31ma0f",
		"score": 7983,
		"title": "My roommate's diary says I have boundary issues."
	}, {
		"body": "My wife flashed before my eyes.",
		"id": "4daa7d",
		"score": 7980,
		"title": "I was in a near-sex experience."
	}, {
		"body": "I bought my 19 year old daughter a new bed for when she goes off to university. She was undecided about whether she wanted to keep it.  I told her to sleep on it.",
		"id": "2dpuyb",
		"score": 7970,
		"title": "This is probably the best joke that I -a dad- have ever come up with"
	}, {
		"body": "Measles",
		"id": "33j2c5",
		"score": 7965,
		"title": "Only 2010's kids will get this..."
	}, {
		"body": "American teenage girls get stoned BEFORE they have sex.",
		"id": "3sea42",
		"score": 7929,
		"title": "What is the difference between American teenage girls amd Muslim teenage girls? (Offensive)"
	}, {
		"body": "\"Over there by mine\", was not the answer I was expecting.  ",
		"id": "2n623h",
		"score": 7909,
		"title": "During my prostate exam I asked the doctor, \"where should I put my pants\"?"
	}, {
		"body": "Because he finally got it﻿",
		"id": "49sbog",
		"score": 7904,
		"title": "Why did Leonardo DiCaprio laugh at the Oscar joke?"
	}, {
		"body": "I told her to go ahead and blow my mind.",
		"id": "3ec6o9",
		"score": 7869,
		"title": "My gf said men only think with their penis."
	}, {
		"body": "They would eventually find me attractive. ",
		"id": "4ivu8k",
		"score": 7869,
		"title": "If I had a dollar for every girl that found me unattractive..."
	}, {
		"body": "",
		"id": "330bw7",
		"score": 7863,
		"title": "I am a dyslexic AMA fighter, MMA"
	}, {
		"body": "She was clever, funny, flirty, and sexy. I suggested we meet up.   She turned out to be an undercover detective.   How cool is that at her age?! ",
		"id": "36vhuj",
		"score": 7862,
		"title": "I met a 14 year old girl on the internet."
	}, {
		"body": "Because in charge of directing, Yoda was",
		"id": "3kslip",
		"score": 7855,
		"title": "Why was Star Wars shot Episodes 4, 5, 6, then 1, 2, 3?"
	}, {
		"body": "",
		"id": "3t28tg",
		"score": 7847,
		"title": "Never make fun of a fat girl with a lisp, she's probably thick and tired of it."
	}, {
		"body": "It's already run out of battery.",
		"id": "38zztm",
		"score": 7828,
		"title": "How does an Apple Watch owner know that it's midday?"
	}, {
		"body": " Pao!   Edit: Whoa, FP *and* gold. Thank you! ",
		"id": "3c05wq",
		"score": 7828,
		"title": "What sound does Reddit make when it blows up?"
	}, {
		"body": "Not having to listen to awful dad jokes.",
		"id": "3z2s4d",
		"score": 7826,
		"title": "What's the best thing about being black?"
	}, {
		"body": "I was drinking at a local bar last night when a waitress screamed, “Does anyone know CPR?”  I shouted, “Hell, I know the whole alphabet.”  Everyone laughed… Well everyone except this one guy.",
		"id": "4g3ow2",
		"score": 7807,
		"title": "Screaming Waitress"
	}, {
		"body": "So I fucked her in the ass and left without paying.",
		"id": "3dxe2u",
		"score": 7795,
		"title": "I went to a prostitute and asked her if I could do her Greek style. \"Sure\" she said"
	}, {
		"body": "Because I know how to reduce fractions unlike the rest of you morons. ",
		"id": "3dkaos",
		"score": 7784,
		"title": "I celebrate 4/20 on January 5th..."
	}, {
		"body": "Well they're not laughing now!",
		"id": "4a3qlp",
		"score": 7783,
		"title": "They used to laugh when I said I wanted to be a comedian."
	}, {
		"body": "I said, \"Dude, it's 2016 you can use any printer you want.\"",
		"id": "4928ql",
		"score": 7737,
		"title": "I work in a library and a black guy asked me if there are any coloured printers..."
	}, {
		"body": "His ears.  Oooo! I get to say it! \"Front page?! Wow! Thanks y'all!\" Oh yea, and \"RIP my inbox\" Good times!   ",
		"id": "3s27kw",
		"score": 7734,
		"title": "What is the most sensitive part of a mans anatomy while he's masturbating?"
	}, {
		"body": "Battle Royale with Cheese.",
		"id": "2o74on",
		"score": 7720,
		"title": "What do they call the Hunger Games in France?"
	}, {
		"body": "Remember kids, 'Netflix and Chill' is only one \"D\" away from 'Netflix and Child.'",
		"id": "3uyd9z",
		"score": 7701,
		"title": "Sex Ed in 2015"
	}, {
		"body": "Income.",
		"id": "4m9vxq",
		"score": 7687,
		"title": "What are pornstars paid?"
	}, {
		"body": "an Envelope  EDIT: My deepest Canadian apologies to those who are calling this a riddle. I always took it as a cheesy joke",
		"id": "39ku0h",
		"score": 7686,
		"title": "What starts with e, ends with e, and only contains one letter?"
	}, {
		"body": "Step 1  Step 2  Step 5  Step 9  Step 12  Floor",
		"id": "4dg4l3",
		"score": 7646,
		"title": "How to Fall Down the Stairs"
	}, {
		"body": "She replied:   \"Beats the hell outta me\"   Edit: holy shit front page, thanks guys",
		"id": "3mmm91",
		"score": 7645,
		"title": "Rihanna was asked; \"why do you think Chris Brown was denied a visa in Australia?\""
	}, {
		"body": "Candidate: 'I'd say my biggest weakness is my listening skills.'",
		"id": "2t6med",
		"score": 7644,
		"title": "*During an interview* Interviewer: 'So how long were you employed in your last job?'"
	}, {
		"body": "Free",
		"id": "2s6mtp",
		"score": 7628,
		"title": "I like my coffee like I like my slaves..."
	}, {
		"body": "Which makes me an eighth theist.",
		"id": "4jelh0",
		"score": 7606,
		"title": "I only believe in 12.5% of everything the Bible says."
	}, {
		"body": "The man at customs asks him \"Do you have a criminal record?\" The British man replies \"I didn't think you'd need one to get into Australia any more.\"",
		"id": "4onshn",
		"score": 7572,
		"title": "A British man is visiting Australia."
	}, {
		"body": "\"friends\"",
		"id": "4uyb83",
		"score": 7569,
		"title": "If men call short women \"petite\", what do women call short men?"
	}, {
		"body": "The first one got no response and the second one was shot down in flames",
		"id": "2csb4u",
		"score": 7566,
		"title": "I heard some guy tell two terrible Malaysian Airline jokes..."
	}, {
		"body": "You either get twice the usual amount of dad jokes or get stuck in an infinite loop of \"go ask your mom\"",
		"id": "3zk950",
		"score": 7561,
		"title": "Having gay parents must be horrible"
	}, {
		"body": "Oh the irony.",
		"id": "3ayhb6",
		"score": 7539,
		"title": "Pretty soon the only place you will be able to buy a Confederate flag will be the black market."
	}, {
		"body": "It's not a question. ",
		"id": "38rtoj",
		"score": 7507,
		"title": "How Long is a Chinese name."
	}, {
		"body": "Now I drink for evil  EDIT: Thanks for front page",
		"id": "3cgs07",
		"score": 7507,
		"title": "I've finally stopped drinking for good."
	}, {
		"body": "In retrospect, there were a lot of red flags...",
		"id": "2o9fln",
		"score": 7504,
		"title": "We should've known about the failure of communism"
	}, {
		"body": "On the front page of reddit.",
		"id": "4bpvk5",
		"score": 7501,
		"title": "What's the best way to break up with your girlfriend?"
	}, {
		"body": "The execution",
		"id": "4tw95r",
		"score": 7472,
		"title": "What makes an ISIS joke funny?"
	}, {
		"body": "I'm gonna miss tumblr",
		"id": "42xchq",
		"score": 7461,
		"title": "For health reasons, my doctor says I should avoid trans fats"
	}, {
		"body": "A woman asked me to check her balance, so I pushed her over.",
		"id": "4blcik",
		"score": 7461,
		"title": "I lost my job at the bank on my very first day."
	}, {
		"body": "Nothing. Our engineering is perfect.",
		"id": "5ski6z",
		"score": 7448,
		"title": "As a German, you know what really grinds my gears?"
	}, {
		"body": "They told me to try Vine.",
		"id": "2no1fz",
		"score": 7441,
		"title": "I tried uploading my sex tape to PornHub."
	}, {
		"body": "Wife: I can't believe they're still together after all that shit.  Me: Who?  Wife: My butt cheeks.",
		"id": "3bkxoz",
		"score": 7433,
		"title": "My wife told me this in the car the other day. Thought you might enjoy!"
	}, {
		"body": "He nuts and bolts.",
		"id": "4b8fqe",
		"score": 7424,
		"title": "What does a robot do at the end of a one night stand?"
	}, {
		"body": "If no one buys it I'm going to kill myself.",
		"id": "4fkldb",
		"score": 7405,
		"title": "I'm writing a book called 'Stop Overreacting.'"
	}, {
		"body": "\"Was it something I said?\" Asks the son.  \"Yes.\"",
		"id": "2ryl97",
		"score": 7395,
		"title": "\"Son, I don't think you're cut out to be a mime.\""
	}, {
		"body": "You can't fix shit with all that screaming and crying.  (**Yes, you can evacuate people.** Check #2 here: http://www.dictionary.com/browse/evacuate)",
		"id": "4vjigx",
		"score": 7382,
		"title": "Why do they evacuate women and children first?"
	}, {
		"body": "I said \"Hey Denzel! Can I get a picture with you?\" And he's all like \"I'm not Denzel Washington you racist piece of shit.\" Classic Denzel.  ",
		"id": "2n8yal",
		"score": 7382,
		"title": "I saw Denzel Washington on the street today."
	}, {
		"body": "3.14 feet. Well, at least the πthon is     (I'm so sorry)",
		"id": "5t43gl",
		"score": 7361,
		"title": "How long are math snakes?"
	}, {
		"body": "a new last name",
		"id": "3tbrm7",
		"score": 7338,
		"title": "What does a polish bride get on her wedding night that is long and hard?"
	}, {
		"body": "One of them turns to the other and says \"I can't believe I blew thirty bucks in there\" ",
		"id": "450kcd",
		"score": 7322,
		"title": "Two deer walk out of a gay bar..."
	}, {
		"body": "But if I'm going to have sex, it's going to be on my own Accord.",
		"id": "4946r5",
		"score": 7313,
		"title": "My girlfriend tried to make me have sex on the hood of her Honda Civic..."
	}, {
		"body": "After a while, my wife said, \"Just use a fucking spoon Mike, you're not a Jedi.\"",
		"id": "2hz7xk",
		"score": 7312,
		"title": "I tried to force feed my child..."
	}, {
		"body": "Seriously, there are terrorists waiting for you. ",
		"id": "4d11zv",
		"score": 7311,
		"title": "Don't die a virgin."
	}, {
		"body": "Because bears don't go to college.",
		"id": "3btiwt",
		"score": 7309,
		"title": "Why didn't the bear go to college?"
	}, {
		"body": "I just find it weird why it wasn't cremated with the rest of him.",
		"id": "4ciw8c",
		"score": 7306,
		"title": "The other day i walked in on my grandmother sucking my grandfather's dick."
	}, {
		"body": "How do you ruin a joke?",
		"id": "2zougu",
		"score": 7304,
		"title": "Put the punchline in the title."
	}, {
		"body": "",
		"id": "3nrc0r",
		"score": 7274,
		"title": "I, for one, like Roman Numerals"
	}, {
		"body": "...they told me I exceeded my maximum number of Loggins attempts",
		"id": "3oi6m3",
		"score": 7258,
		"title": "I just got kicked out of karaoke night for singing \"Danger Zone\" six times in a row..."
	}, {
		"body": "Well, it's what he would have wanted.",
		"id": "3kwmu5",
		"score": 7200,
		"title": "Dave drowned. So at the funeral we got him a wreath in the shape of a lifebelt."
	}, {
		"body": "You gonna eat that?",
		"id": "4evxj2",
		"score": 7178,
		"title": "What did Mike Tyson say to Vincent van Gogh??"
	}, {
		"body": "Philippe Philoppe.",
		"id": "3yefpd",
		"score": 7170,
		"title": "What do you call a Frenchman wearing sandals?"
	}, {
		"body": "and charged with impersonating an officer",
		"id": "34xr09",
		"score": 7144,
		"title": "I was arrested for killing a black man"
	}, {
		"body": "I now have $999,999.75",
		"id": "3vk0wo",
		"score": 7139,
		"title": "I won the lottery for a million dollars today so I decided to donate a quarter of it to charity."
	}, {
		"body": "Now it doesn't work.  Then I painted my computer white so it would work.  Now the whole system is corrupt.",
		"id": "4eiwtz",
		"score": 7123,
		"title": "I painted my computer black so it would run faster."
	}, {
		"body": "The good ones are all taken.  The rest are either handicapped or too far away.",
		"id": "3k5omn",
		"score": 7118,
		"title": "Dating in your 30s is like looking for a parking spot..."
	}, {
		"body": "Just one. All he has to do is hold it in place while the world revolves around him.",
		"id": "3oy5qy",
		"score": 7109,
		"title": "How many narcissists does it take to change a lightbulb?"
	}, {
		"body": "The car started right up but they said I'd need a new battery.",
		"id": "343nz1",
		"score": 7106,
		"title": "I got jumped by five black guys in Baltimore."
	}, {
		"body": "idk what he laced them with but I've been tripping all day ",
		"id": "2nuoyl",
		"score": 7089,
		"title": "Bought some shoes from my drug dealer."
	}, {
		"body": "She said \"You have the biggest dick i've ever put my hands on\" I said    \"Nah, you're pulling my leg\"",
		"id": "3r13is",
		"score": 7071,
		"title": "Got a Handjob from a Blind Girl last night..."
	}, {
		"body": "\"Anycockledoooooo!\"",
		"id": "4vf5bd",
		"score": 7069,
		"title": "What does a gay rooster say?"
	}, {
		"body": "I said \"Yeah, they came out of the closet this morning.\"",
		"id": "527wp3",
		"score": 7058,
		"title": "Somebody told me my clothes were gay."
	}, {
		"body": "Why does it have to be a group activity?",
		"id": "537nmx",
		"score": 7051,
		"title": "How many introverts does it take to change a lightbulb?"
	}, {
		"body": "Guess who got the front porch repainted.  EDIT: Holy crap this blew up (no pun intended). Front page! RIP to my inbox.   Thank you kind Redditor for my first gold! ",
		"id": "3q2zi3",
		"score": 7051,
		"title": "Saw a hooker on the street who said she'd do anything for $50."
	}, {
		"body": "I get it, you have more money than me.  No need to be a dick about it.",
		"id": "3fxhqt",
		"score": 7002,
		"title": "I hate it when homeless people shake their change cups at me."
	}, {
		"body": "It was a disaster. Nobody came.   Edit: Wow! While I was gone this really...exploded.",
		"id": "2f6002",
		"score": 7000,
		"title": "I had a bukkake party last night."
	}, {
		"body": "Sorry, wrong thread",
		"id": "32bq6e",
		"score": 6988,
		"title": "I bought pink cotton but my wife wanted purple"
	}, {
		"body": "I just sit at green lights until I feel good about myself.",
		"id": "2oir42",
		"score": 6972,
		"title": "I have a bumper sticker that says, \"honk if you think I'm sexy\"..."
	}, {
		"body": "",
		"id": "36tkvd",
		"score": 6952,
		"title": "How many dyslexics does it change to take a light bulb?"
	}, {
		"body": "I can get through a Jimmy Fallon joke without laughing. ",
		"id": "2ssndg",
		"score": 6908,
		"title": "What's the difference between Jimmy Fallon and myself?"
	}, {
		"body": "I didn't want to interrupt her.",
		"id": "3rslp6",
		"score": 6906,
		"title": "I haven't talked to my wife in three weeks."
	}, {
		"body": "Robber:  \"Give me all your money or you are GEOGRAPHY!'  Cashier (puzzled) \"Did you mean to say \"or you're history?\"  Robber: \"Don't change the subject.\"",
		"id": "2zjm7g",
		"score": 6890,
		"title": "Bank robber pulls out gun, points it at the teller..."
	}, {
		"body": "they told me she was imaginary, but the jokes on them, because they are too.",
		"id": "2zfwul",
		"score": 6889,
		"title": "I told my friends I had a date with a really attractive girl..."
	}, {
		"body": "That means the entire country went black and successfully went back.",
		"id": "3ia9d7",
		"score": 6859,
		"title": "If the next president is white...."
	}, {
		"body": "It's not true, I love Matthew and Not-Matthew equally.",
		"id": "2nrv35",
		"score": 6848,
		"title": "My wife always accuses me of having a favorite child."
	}, {
		"body": "None, they'll just compliment it and get pissed when it won't screw.",
		"id": "3x2bd6",
		"score": 6833,
		"title": "How many \"friend-zoned\" guys does it take to screw in a light bulb?"
	}, {
		"body": "Not me, I live next to 2 smoking hot 10 year olds",
		"id": "3zpb7l",
		"score": 6816,
		"title": "They say that every 2 out of 3 people live next to a pedophile"
	}, {
		"body": "It was given two consecutive sentences. ",
		"id": "42g2ze",
		"score": 6804,
		"title": "What happened when the semicolon broke grammar laws?"
	}, {
		"body": "When this gets 500 upvotes, I'll tell you the answer.  EDIT: Slightly late, but:  10: one to change it, one to post about it for karma and eight to repost it a few months later.  ",
		"id": "2q2uaq",
		"score": 6801,
		"title": "How many karma whores does it take to change a lightbulb?"
	}, {
		"body": "Apparently, it just changes the color of the baby. Go figure.",
		"id": "3orvu0",
		"score": 6796,
		"title": "I thought vasectomies were supposed to keep me from getting my wife pregnant??"
	}, {
		"body": "To look sharp.  &nbsp; &nbsp;  Credit: 3rd grade me.",
		"id": "3op5rq",
		"score": 6787,
		"title": "Why do pencils shave?"
	}, {
		"body": "Because there used to be two of them, but it's offensive to joke about that now.",
		"id": "4qvf7p",
		"score": 6763,
		"title": "Why are the twin towers and genders so similar?"
	}, {
		"body": "I always thought they were gunna hit me, not that they were going to destroy the housing market 20 years later.",
		"id": "4lbpsc",
		"score": 6756,
		"title": "Remember when you were a kid and when you cried your parents said, \"I'll give you a reason to cry\"?"
	}, {
		"body": "The bartender says \" Sorry,  we don't serve breakfast here\".",
		"id": "2nkp3p",
		"score": 6754,
		"title": "A piece of toast and a hard boiled egg walked into a bar....."
	}, {
		"body": "There was no coffin at the funeral",
		"id": "473ihq",
		"score": 6739,
		"title": "The guy who invented throat lozenges died last week."
	}, {
		"body": "\"No way. That's impossible!\" she said.  \"Trust me,\" I said, \"I have no idea where our baby is.\"",
		"id": "319og1",
		"score": 6737,
		"title": "I told my wife I lost 10 lbs in one hour"
	}, {
		"body": "A waist of time.",
		"id": "4017dh",
		"score": 6735,
		"title": "What do you call a girl with an hourglass figure?"
	}, {
		"body": "I like to joke about it, but I never want to see it live.",
		"id": "3ldpqi",
		"score": 6688,
		"title": "Racism is like Nickelback..."
	}, {
		"body": "It had a bad driver!  **bows **  I'll show myself out.",
		"id": "2dsq8l",
		"score": 6688,
		"title": "I give to you a joke I made up when I was seven: Why did the computer crash?"
	}, {
		"body": "Because you're supposed to learn from your mistakes.  Edit: Apparently a lot of you are all teaching my mother new things too. Weird. ",
		"id": "3q8klr",
		"score": 6687,
		"title": "I try to teach my mom something new everyday."
	}, {
		"body": "John Cena: Where am I?  Nurse: ICU  John Cena: No you don't.  Edit: double enter",
		"id": "42r97c",
		"score": 6656,
		"title": "John Cena woke up from a coma"
	}, {
		"body": "",
		"id": "38d1if",
		"score": 6649,
		"title": "My poor knowledge of Greek mythology has always been my Achilles elbow"
	}, {
		"body": "So if you're a good driver, watch out for women who are turning!",
		"id": "2zqnwx",
		"score": 6635,
		"title": "Fact: A lot of women turn into good drivers."
	}, {
		"body": "But they canceled the interview",
		"id": "2q5kpq",
		"score": 6634,
		"title": "I recently submitted my resume to Sony"
	}, {
		"body": "Help us get rid of the Ecuadorian fag-hating spider :(",
		"id": "3np98z",
		"score": 6631,
		"title": "Homosexuality is found in over 450 species. Homophobia is only found in two."
	}, {
		"body": "She was lack-toes intolerant.",
		"id": "5rekem",
		"score": 6628,
		"title": "I got frostbite and had part of my foot amputated. Then my girlfriend left me."
	}, {
		"body": "My wife told me that she wanted to give me a deepthroat blowjob today.  \"Really!\" I exclaimed.  \"No,\" She said, \"April Foogargagggrraggggle.\"  That'll teach her to try and be funny...",
		"id": "312p64",
		"score": 6626,
		"title": "It's a healthy relationship"
	}, {
		"body": "...you were a good idea last night but now I just want you to shut the fuck up",
		"id": "3p7z6r",
		"score": 6625,
		"title": "Girl, you remind me of an alarm clock..."
	}, {
		"body": "Is it alright if I cum inside? ",
		"id": "3gnliw",
		"score": 6605,
		"title": "(Nsfw)What must a vampire ask before he has sex?"
	}, {
		"body": "Laughing stock. ",
		"id": "3v5iez",
		"score": 6595,
		"title": "What do you call cows that have a sense of humor?"
	}, {
		"body": "It's called \"world history\".  #TRUMP 2016! YOU CAN'T STUMP THE TRUMP!",
		"id": "3kqyxw",
		"score": 6585,
		"title": "I have a degree in men's studies."
	}, {
		"body": "He was in the middle of 9/11",
		"id": "4ydadf",
		"score": 6582,
		"title": "Why did 10 die?"
	}, {
		"body": "This month, lunch is on me.",
		"id": "4ndsww",
		"score": 6551,
		"title": "Happy Ramadan to all my Muslim brothers and sisters!"
	}, {
		"body": "Him: What's a pirates favorite letter? Me: ARRRGH! Him: You would think it would be ARRRGH but my first love be the \"C\"!",
		"id": "2pw136",
		"score": 6548,
		"title": "As told to me by my 7 YO son this morning..."
	}, {
		"body": "Vladimir Putin arrives at an airport, gets in line at customs desk.   Customs officer: Occupation?  Putin: No, just visiting. ",
		"id": "2vofep",
		"score": 6542,
		"title": "Putin at the airport"
	}, {
		"body": "",
		"id": "3pxy9k",
		"score": 6522,
		"title": "I often say to myself, \"I can't believe that cloning machine worked.\""
	}, {
		"body": "Artificial intelligence  *edit: I kinda thought it was funny, and* poof  *it has 3000 upvotes. Thanks for the motivation*",
		"id": "4c8rix",
		"score": 6518,
		"title": "What do you call a blonde who dyes her hair brunette?"
	}, {
		"body": "They'll frame you, shoot you, blow you up and then hang you. ",
		"id": "3ullvl",
		"score": 6517,
		"title": "Photographers are so violent."
	}, {
		"body": "   Police Let It Go With A Warning",
		"id": "2ru882",
		"score": 6511,
		"title": "My Cocaine Is So White"
	}, {
		"body": "",
		"id": "3mgpy7",
		"score": 6506,
		"title": "Moses was the first person to use Control-C as a shortcut"
	}, {
		"body": "Does that make you an iWitness?",
		"id": "4r1wee",
		"score": 6479,
		"title": "If you watch an Apple store get robbed,"
	}, {
		"body": "It can be understood through tough thorough thought though.",
		"id": "3pjsus",
		"score": 6457,
		"title": "English can be weird."
	}, {
		"body": "Banned from the zoo.",
		"id": "2xgboe",
		"score": 6454,
		"title": "What do you get if you insert human DNA into a goat?"
	}, {
		"body": "Artificial Swedeners",
		"id": "30lqfm",
		"score": 6398,
		"title": "What do you call immigrants to Sweden?"
	}, {
		"body": " Since then, my mugging attempts have been a lot more successful.",
		"id": "2xt2n0",
		"score": 6393,
		"title": "I started carrying a knife after an attempted mugging a few years ago."
	}, {
		"body": "They say he fears the wurst",
		"id": "48h1j2",
		"score": 6387,
		"title": "Did you hear about the pessimist who hates sausage?"
	}, {
		"body": "...Police say it's impossible to tell if the act was committed by Trump's opponents or supporters.",
		"id": "43m9gc",
		"score": 6381,
		"title": "A swastika has been spray painted over Donald Trump's star on the Hollywood Walk of Fame..."
	}, {
		"body": "Mark Hamill pulled JJ Abrams to the side and said \"Can I have a word?\"",
		"id": "3xwv9r",
		"score": 6354,
		"title": "The cast of Star Wars VII just finished their first read through (spoilers)"
	}, {
		"body": "An incognito window opens.",
		"id": "40qrqq",
		"score": 6344,
		"title": "When one door closes..."
	}, {
		"body": "I asked him and he said, \"I still love vista, baby!\"",
		"id": "49ffgj",
		"score": 6338,
		"title": "Why didn't the terminator upgrade to windows 10?"
	}, {
		"body": "That wasn't a very nice postcard to receive. ",
		"id": "34567n",
		"score": 6337,
		"title": "My girlfriend said to me \"sex is better on holiday\"..."
	}, {
		"body": "Because it's either Sunni or Shi'ite",
		"id": "40bljb",
		"score": 6322,
		"title": "Why is the British weather like Islam?"
	}, {
		"body": "Apparently, \"Heating your dinner\" wasn't a good answer.",
		"id": "40tb53",
		"score": 6319,
		"title": "My girl caught me blowing my dick with the air dryer, and asked what I was doing."
	}, {
		"body": "He goes home and tears his pants off, eager to show his girlfriend. She looks at him and shakes her head saying \"there you go again trying to put words in my mouth\".",
		"id": "4oc1vx",
		"score": 6318,
		"title": "A man gets \"I love you\" tattooed on his penis."
	}, {
		"body": "Waiter: \"And to drink, sir?\"  Dad: \"I'll have a blind coke.\"  Waiter: \"I'm sorry?\"  Dad: \"You know, a blind coke. No ice.\"",
		"id": "37wilr",
		"score": 6314,
		"title": "In honor of his passing, my dad's favorite joke to tell waiters"
	}, {
		"body": "Christian Bale",
		"id": "43zkg0",
		"score": 6284,
		"title": "What do you call batman when he skips church?"
	}, {
		"body": "...and his wife is livid.  “You SWORE that you’d be home by 11:45!”  \"No,\" slurs the mathematician...   “I said I’d be home by a quarter of 12.”   ",
		"id": "2r7tr8",
		"score": 6275,
		"title": "A mathematician stumbles home drunk at 3 a.m."
	}, {
		"body": "You will be mist.  EDIT: AWESOME my gold cherry is gone!",
		"id": "2xzau2",
		"score": 6255,
		"title": "RIP boiling water"
	}, {
		"body": "Because they're both cauldron",
		"id": "4izm9o",
		"score": 6253,
		"title": "Why can't Harry Potter tell the difference between his cooking pot and his best friend?"
	}, {
		"body": "Months pregnant and I'm starting to panic a little. Do you think I am too old to be a dad? ",
		"id": "4z64qc",
		"score": 6220,
		"title": "I am 51 and my girlfriend is 8"
	}, {
		"body": "Apparently, that is an insensitive thing to say to a cancer patient.",
		"id": "3vm6cv",
		"score": 6195,
		"title": "I suggested to my wife that she'd look sexier with her hair back"
	}, {
		"body": "M'genta ",
		"id": "2r62fr",
		"score": 6193,
		"title": "Whats a fedora clad, neck bearded gentlemen's favorite color?"
	}, {
		"body": "Now you can legally blow the cartridges.",
		"id": "3syh8y",
		"score": 6175,
		"title": "The Nintendo 64 turned 18 today"
	}, {
		"body": "I don't know I just fly the drone.",
		"id": "4g22rh",
		"score": 6173,
		"title": "Whats the difference between a terrorist training camp and an orphanage?"
	}, {
		"body": " but only for like 20 seconds...",
		"id": "4v5v17",
		"score": 6153,
		"title": "I once had a goldfish that could break-dance on a carpet,"
	}, {
		"body": "Me: Answering the semantics of a question but ignoring the pragmatics  Interviewer: Could you give me an example?   Me: Yes I could",
		"id": "5044l4",
		"score": 6133,
		"title": "Interviewer: What's your greatest weakness?"
	}, {
		"body": "...except at a funeral",
		"id": "3b3yfa",
		"score": 6112,
		"title": "\"I'm sorry\" and \"I apologise\" usually mean the same thing"
	}, {
		"body": "Edit: Wow, I did not expect this to get so many upvotes!",
		"id": "3jn1jc",
		"score": 6098,
		"title": "How do you spot an attention whore on reddit?"
	}, {
		"body": "He looked at me wide eyed and yelled \"WHY THE HELL ARE YOU MASTURBATING?!?\"  Edit: FrontPage thanks and all. But for those comments saying go knuckle deep, I'm a guy.",
		"id": "2kkquh",
		"score": 6091,
		"title": "Tifu by walking in on my roommate masturbating"
	}, {
		"body": "Brothel Sprouts.",
		"id": "3uetgk",
		"score": 6090,
		"title": "What do you call children who are born into a Whorehouse?"
	}, {
		"body": "Son: Dad, what does gay mean?  Dad: Happy son. It means happy.  Son: Then are YOU gay DAD?  Dad: No son...... i have a wife...     EDIT: Damn this blew up. Thanks guys!",
		"id": "3g4fs2",
		"score": 6061,
		"title": "His son asked him what gay meant."
	}, {
		"body": "it's like I've never seen herbivore.   edit: I think I summoned the pun cult.",
		"id": "3bvdjc",
		"score": 6060,
		"title": "My friend really changed when she became a vegetarian..."
	}, {
		"body": "No one knows. They never get to keep the house.  Edit: Thanks for all the awesome comments. I can't keep up!",
		"id": "2gc7iu",
		"score": 6053,
		"title": "How many divorced men does it take to change a light bulb?"
	}, {
		"body": "Because they're easy to push around and never stand up for themselves",
		"id": "4yeunb",
		"score": 6043,
		"title": "Why are people in wheelchairs always getting taken advantage of?"
	}, {
		"body": "A Tupac...",
		"id": "3e7n2c",
		"score": 6030,
		"title": "What do you get when you shoot four bullets into a six pack?"
	}, {
		"body": "But no evidence is good enough for a Creationist.",
		"id": "3dsj6l",
		"score": 5990,
		"title": "No evidence is good enough for a Creationist..."
	}, {
		"body": "Because I'd vote for it.",
		"id": "4scp0i",
		"score": 5976,
		"title": "Is your refrigerator running?"
	}, {
		"body": "A black guy and a white girl are at a party. After a while they go together to a room, and she asks excited: \"Show me if what they say about black men is true\". He grabs her purse and runs",
		"id": "4jbbcc",
		"score": 5973,
		"title": "A black guy and a white girl are at a party"
	}, {
		"body": "I'd have $ 6.30 now",
		"id": "4wduew",
		"score": 5972,
		"title": "If i got 50 cents for every failed math exam,"
	}, {
		"body": "Classic conditioning.",
		"id": "2v7jav",
		"score": 5962,
		"title": "Why is Pavlov's hair so soft?"
	}, {
		"body": "It confuses me and I'm pretty sure it's all the same.  EDIT: Front page? Hot damn! Now what do I do with my life?",
		"id": "4b6x5n",
		"score": 5928,
		"title": "Great wine is like great jazz..."
	}, {
		"body": "It's cool though, she said we can still be cousins.",
		"id": "3rcdms",
		"score": 5924,
		"title": "Broke up with my girlfriend today"
	}, {
		"body": "But on the other hand I am completely fine.",
		"id": "31065v",
		"score": 5916,
		"title": "I broke my finger today..."
	}, {
		"body": "Get another one to yell BINGO",
		"id": "2pctwz",
		"score": 5912,
		"title": "How do you get a sweet little old lady to say F***?"
	}, {
		"body": "She said, \"Three of the girls in the office have just received some flowers for Valentines Day. They are absolutely gorgeous.\"    I said, \"Well that's probably why they've received flowers then.\"  ",
		"id": "39q489",
		"score": 5901,
		"title": "My wife just called me."
	}, {
		"body": "A threesome",
		"id": "42aj2i",
		"score": 5894,
		"title": "What do you call 5 black people having sex?"
	}, {
		"body": "and I only know this because they won't shut the fuck up about it.",
		"id": "34u0fd",
		"score": 5893,
		"title": "An atheist, a crossfitter, and a vegan are all sitting at a bar..."
	}, {
		"body": "It was having a mid life crisis",
		"id": "3w7gnu",
		"score": 5887,
		"title": "why was the 6 month old African baby crying?"
	}, {
		"body": "**One is twenty, and the other is twenty too!**  Edit: RIP Inbox. We hardly knew ye.   First front page ever! Woo!",
		"id": "3awn7o",
		"score": 5886,
		"title": "Did you know 2 x 10 is the same as 2 x 11?"
	}, {
		"body": "[deleted]",
		"id": "44u9yu",
		"score": 5880,
		"title": "How do you disappoint a Redditor?"
	}, {
		"body": "Hitler was good at making speeches",
		"id": "5qnzn5",
		"score": 5874,
		"title": "People compare Trump and hitler all the time, but there is one major difference."
	}, {
		"body": "The Polar bear.",
		"id": "31rlhp",
		"score": 5872,
		"title": "What's the stupidest animal in the jungle?"
	}, {
		"body": "1080pee",
		"id": "3am5z0",
		"score": 5862,
		"title": "What do you call crystal clear urine?"
	}, {
		"body": "It's fun at the time, but in the end you're just fucking yourself. ",
		"id": "4od3ey",
		"score": 5852,
		"title": "Procrastination is like masturbation"
	}, {
		"body": "Just took a shower with my girlfriend.....  And stood in the corner freezing for 20 minutes handing her different shampoos.",
		"id": "5s0uq4",
		"score": 5849,
		"title": "Porn is so unrealistic"
	}, {
		"body": "He pasta way. We cannoli do so much. His legacy will be a pizza history.     Edit: Thank you for getting this on the front page!",
		"id": "2yjray",
		"score": 5846,
		"title": "Did you hear about the Italian chef that died?"
	}, {
		"body": "A girl says to her friend \"The last time I had sex was like the 100 meter dash\"  Her friend says \"What, over in 6 seconds?\"  \"No, with 8 black men and a gun.\"",
		"id": "3jufre",
		"score": 5845,
		"title": "100m Dash"
	}, {
		"body": "Concrete floors are really hard to crack.   Then he said \"you were thinking about the egg weren't you!\"",
		"id": "2f305c",
		"score": 5836,
		"title": "Told by a 7 year old boy: How do you drop on an egg on a concrete floor without cracking it."
	}, {
		"body": "They know my name isnt Someone Help",
		"id": "4geq6n",
		"score": 5834,
		"title": "I hate when a girl says the wrong name during sex"
	}, {
		"body": "Genocide",
		"id": "304d0v",
		"score": 5833,
		"title": "If April showers bring May flowers, then what do May Flowers bring?"
	}, {
		"body": "Dad: Drugs, usually.",
		"id": "3lgaiw",
		"score": 5821,
		"title": "Son: Dad, how do stars die?"
	}, {
		"body": "Because most hackers don't get it",
		"id": "4278he",
		"score": 5810,
		"title": "My password is pussy"
	}, {
		"body": "She told me she's been having sex with an asshole for years",
		"id": "42ihx3",
		"score": 5808,
		"title": "I told my wife I wanted to try anal sex"
	}, {
		"body": "Envelope!",
		"id": "3xnyv7",
		"score": 5806,
		"title": "What starts with “E” and has only one letter in it?"
	}, {
		"body": "And says \"ladies, is anything ok?\"",
		"id": "3g8snq",
		"score": 5801,
		"title": "A waiter walks up to a table full of Jewish women dining"
	}, {
		"body": "osMoses",
		"id": "3qv6bj",
		"score": 5794,
		"title": "Who led the Jews across a semi-permeable membrane?"
	}, {
		"body": "\"Can't complain\", he said.",
		"id": "4ac2wf",
		"score": 5786,
		"title": "I asked my North Korean friend what life was like in North Korea"
	}, {
		"body": "None. He fell.",
		"id": "4qpfsl",
		"score": 5783,
		"title": "How many cops does it take to push a black man down the stairs?"
	}, {
		"body": "Because fuck u   that's why",
		"id": "2b83sp",
		"score": 5781,
		"title": "Why did America remove the \"u\" from \"colour\"?"
	}, {
		"body": "My mom answered \"Who?\"  \"Your daughter\"  courtesy of my 4 year old sister about 20 minutes ago   ",
		"id": "2wr12h",
		"score": 5775,
		"title": "My little sister made a face at my mom and said \"Guess who I am?\""
	}, {
		"body": "I'm taking steps to avoid them.",
		"id": "36m1a3",
		"score": 5764,
		"title": "I've recently developed a severe phobia of elevators."
	}, {
		"body": "He should've watched the trailer.",
		"id": "4s6igx",
		"score": 5762,
		"title": "Shame about the Tesla driver that crashed while watching a movie."
	}, {
		"body": "I said, is that a fret?",
		"id": "4i439i",
		"score": 5736,
		"title": "Some bloke just told me he was gonna smack me with the neck of his guitar...."
	}, {
		"body": "They pass a gay bar and one condom says to the other \"hey, do you wanna get shit-faced?\"",
		"id": "39x3hz",
		"score": 5724,
		"title": "Two condoms are walking down the street..."
	}, {
		"body": "My girlfriend of 5 years asked me when was the last time I had sex with someone before her.      I said \"back in '09\". It sounds much better than saying September.",
		"id": "3s9xb3",
		"score": 5722,
		"title": "My girlfriend of 5 years asked me..."
	}, {
		"body": "It's a perfect 5/7.",
		"id": "40o86h",
		"score": 5712,
		"title": "Why is Empire Strikes Back the best Star Wars movie?"
	}, {
		"body": "I saw a black guy running down the street with a TV and I thought \"that's mine\"   Then I realized mine is at home, polishing my shoes",
		"id": "4jyfbi",
		"score": 5711,
		"title": "I'm not racist but.."
	}, {
		"body": "If we don't get support soon, people will think we are nuts.",
		"id": "2s29js",
		"score": 5711,
		"title": "What did one saggy boob say to the other?"
	}, {
		"body": "He said, \"I was a brick layer for 20 years and no one called me 'Randy the brick layer.'   Then I farmed for 25 year and no one called me 'Randy the farmer.'  But you fuck just one goat.",
		"id": "4gh7q0",
		"score": 5698,
		"title": "My great Grandpa Randy was a brick layer..."
	}, {
		"body": "You have my word",
		"id": "2z80l6",
		"score": 5687,
		"title": "Whoever stole my Microsoft Office, I'm coming after you..."
	}, {
		"body": "Booze  ",
		"id": "4kz00g",
		"score": 5686,
		"title": "What's a comedians least favorite drink?"
	}, {
		"body": "When does a Pentagon have only 4 sides?   When it is intercepted by a plane.",
		"id": "2yqi0y",
		"score": 5673,
		"title": "Worst Geometry Joke I Know"
	}, {
		"body": "So he can fit in his spaceship.",
		"id": "3ys65r",
		"score": 5670,
		"title": "What's E.T. short for?"
	}, {
		"body": "Keyboard manufacturing isn't as easy as you think",
		"id": "2mhauz",
		"score": 5666,
		"title": "I've been fired from work for putting in too many shifts"
	}, {
		"body": "The Camelot.   PS Booze helped with this and now I'm laughing alone in my apartment  Edit: Went to class, came back, saw this. Me and my cat are thoroughly pleased.",
		"id": "3pun9a",
		"score": 5659,
		"title": "Where would you park your camel?"
	}, {
		"body": "None, because they can't climb the ladder.  *Edit: Wasn't my joke, it was a friends but I can't credit him since I don't know his account name*",
		"id": "2zwm28",
		"score": 5644,
		"title": "How many McDonalds workers does it take to change a lightbulb?"
	}, {
		"body": "The pot was calling the cattle back",
		"id": "4jq69b",
		"score": 5639,
		"title": "Why did the cows come back to the marijuana field?"
	}, {
		"body": "I thought he didn't care about the 1%",
		"id": "440nu1",
		"score": 5631,
		"title": "Why is Bernie Sanders challenging his 49 vs 50% loss in Iowa?"
	}, {
		"body": "My family takes monopoly way too seriously.",
		"id": "3tlwcy",
		"score": 5630,
		"title": "I almost got raped in jail ..."
	}, {
		"body": "What a shit way to start a game of Scrabble.",
		"id": "42uw0i",
		"score": 5626,
		"title": "I was given MDMA and LSD tonight..."
	}, {
		"body": "The police are pretty upset about it.",
		"id": "3twii6",
		"score": 5582,
		"title": "I'm 36 but have the body an 18-year-old"
	}, {
		"body": "I guess that's why they call me handsome...  Edit: front page! Everyone hating on my joke can suck it",
		"id": "2zh60j",
		"score": 5573,
		"title": "When 2 people have sex it's called a twosome. When 3 people do it it's called a threesom"
	}, {
		"body": "My black friend asked me if there was a colored printer in the library I said wtf man it's 2015 you can use whatever printer you want",
		"id": "3boy3k",
		"score": 5568,
		"title": "My black friend asked me..."
	}, {
		"body": "",
		"id": "2ujfg3",
		"score": 5560,
		"title": "I hate being bipolar, it's great"
	}, {
		"body": "[deleted]",
		"id": "2l4nz3",
		"score": 5559,
		"title": "Wanna know how to piss off over a billion people on the Internet at once?"
	}, {
		"body": "A piiig",
		"id": "32jxbt",
		"score": 5555,
		"title": "\"You want to see a pig with three eyes?\""
	}, {
		"body": "Because tea leaves.",
		"id": "4py5u5",
		"score": 5552,
		"title": "Why does Britain like tea so much?"
	}, {
		"body": "How mean.",
		"id": "33vus6",
		"score": 5540,
		"title": "My math teacher called me average..."
	}, {
		"body": "I had to explain to him i was married now and that's where i sleep.",
		"id": "2jwffg",
		"score": 5523,
		"title": "Tonight a friend asked if he could crash on my couch."
	}, {
		"body": "Hispanic attacks.",
		"id": "3b9a6t",
		"score": 5510,
		"title": "Why did the Mexican take xanax?"
	}, {
		"body": "A widow",
		"id": "2uerio",
		"score": 5508,
		"title": "What do you call a wife that knows where her husband is at all time?"
	}, {
		"body": "But it was just my imaginasian. ",
		"id": "31iolh",
		"score": 5497,
		"title": "When I was a kid I thought I had a Chinese friend"
	}, {
		"body": "Because they spend years at C.",
		"id": "3ugdrv",
		"score": 5490,
		"title": "Why can't pirates learn the alphabet?"
	}, {
		"body": "Because he wore a scarf before it was cool.",
		"id": "39skdk",
		"score": 5485,
		"title": "Why is the hipster sweating?"
	}, {
		"body": "The neighbours think I am a stud when they hear her panting heavily \"give it to me!\"  ",
		"id": "2hbvqi",
		"score": 5464,
		"title": "Sometimes I hide my wife's inhaler...."
	}, {
		"body": "None, it's already lit fam.",
		"id": "4nqx77",
		"score": 5458,
		"title": "How many \"sup dude\"s does it take to screw in a lightbulb?"
	}, {
		"body": "I also pull out way to late.",
		"id": "46vo4z",
		"score": 5437,
		"title": "Last night my wife started calling me Jeb Bush."
	}, {
		"body": "\"Nervous?\" asked the interviewer, I simply replied \"No I always give 110%\"",
		"id": "3coey4",
		"score": 5435,
		"title": "During a job interview yestarday I poured some water into a cup and it overflowed slightly"
	}, {
		"body": "I mean, there were red flags everywhere.",
		"id": "33qli6",
		"score": 5427,
		"title": "No one should have been surprised by the rise of the USSR after World War II."
	}, {
		"body": ". . . Any good tips with dealing with pepper spray?",
		"id": "44gird",
		"score": 5427,
		"title": "I always start crying uncontrollably whenever I am about to get intimate with a girl . . ."
	}, {
		"body": "Why the fuck would I want 2 empty glasses?",
		"id": "51410x",
		"score": 5410,
		"title": "In was in a bar the other day. The barman said \"I see your glass is empty. Do you want another one?\""
	}, {
		"body": "They're thick and tired of it",
		"id": "47icdf",
		"score": 5408,
		"title": "Don't make fun of fat people with lisps..."
	}, {
		"body": "\"Herman, I just heard on the news that there's a car going the wrong way on Interstate 90, Please be careful!\"  Herman said, \"It's not just one car. There’s hundreds of them!\"",
		"id": "3v0b76",
		"score": 5404,
		"title": "A senior citizen called her husband during his drive home."
	}, {
		"body": "Give her a used tampon and ask her what period it came from.",
		"id": "381t5o",
		"score": 5382,
		"title": "How do you piss off a female archaeologist?"
	}, {
		"body": "None it's all tongue and groove",
		"id": "3jgzmn",
		"score": 5382,
		"title": "how many screws hold together a lesbians bed?"
	}, {
		"body": "With iPhone accessories.",
		"id": "5tscx1",
		"score": 5378,
		"title": "How do you milk sheep?"
	}, {
		"body": "You.  Why I oughta...!  Edit: Wow, thanks for all the love. My son is quite the character and he really caught me off guard with this!",
		"id": "2pljk0",
		"score": 5370,
		"title": "From my 7 year-old son: What rhymes with 'boo' and really stinks?"
	}, {
		"body": "The punchline?  It was my mom, then my sister, then me",
		"id": "52cx8g",
		"score": 5368,
		"title": "My dad was always drunk when I was a kid"
	}, {
		"body": "Free",
		"id": "2axk6q",
		"score": 5361,
		"title": "I like my coffee like I like my slaves"
	}, {
		"body": " .... then soviet.",
		"id": "4zr408",
		"score": 5354,
		"title": "If pronouncing my b's as v's makes me sound Russian..."
	}, {
		"body": "Fission chips.",
		"id": "2u2syb",
		"score": 5342,
		"title": "What do British nuclear engineers eat?"
	}, {
		"body": "J.K!   Rowling.",
		"id": "2nbefg",
		"score": 5316,
		"title": "How does Harry Potter get down a hill? By running."
	}, {
		"body": "Man:\"Why did you make women so beautiful?\" God:\"So you would love her.\" Man:\"Then why did you make her so dumb?\" God:\"So she would love you.\"",
		"id": "3sv3j5",
		"score": 5312,
		"title": "A man asks god..."
	}, {
		"body": "Really makes my day.",
		"id": "398nei",
		"score": 5308,
		"title": "The rotation of earth"
	}, {
		"body": "Because his career is in ruins.",
		"id": "3zuwaq",
		"score": 5302,
		"title": "Why is the archaeologist sad?"
	}, {
		"body": "He said \"Can you describe the symptoms?\" So I replied \"Homers fat, and Marge has blue hair\"",
		"id": "4twbks",
		"score": 5293,
		"title": "I went to the doctors with hearing problems..."
	}, {
		"body": "I never get included in anything either.",
		"id": "41zyms",
		"score": 5271,
		"title": "I can sympathize with batteries."
	}, {
		"body": "Because you are getting old",
		"id": "3oajo2",
		"score": 5270,
		"title": "Damn girl, are you /r/jokes"
	}, {
		"body": "\"To fight the Decepticons,\" I said.  She laughed.  I laughed.  The toaster laughed.  I shot the toaster.",
		"id": "3koim4",
		"score": 5267,
		"title": "My wife asked me why I carry a gun around the house."
	}, {
		"body": "- Hello, I'd like to reserve a table for the pharaoh Sakhrakhotep I. - Could you spell it out, please? - Of course. Bird, two triangles, wavy line, the sun, bird again, jackal's head and a scarab.",
		"id": "489y42",
		"score": 5263,
		"title": "A mummy calls a restauraunt."
	}, {
		"body": "He can't read it anyway",
		"id": "34pyto",
		"score": 5258,
		"title": "Say what you want about Floyd Mayweather"
	}, {
		"body": "",
		"id": "3ai1x4",
		"score": 5253,
		"title": "An Irishman walks out of a bar"
	}, {
		"body": "I could immediately feel it getting wetter and wetter.  I took my finger back out and within seconds she was going down on me.  \"I really need a new fucking boat,\" I thought to myself.",
		"id": "42xhcs",
		"score": 5243,
		"title": "As I slipped my finger slowly inside her hole..."
	}, {
		"body": "I like it more than blue and red combined.   ",
		"id": "4iy8l2",
		"score": 5238,
		"title": "Purple is my favorite color!"
	}, {
		"body": "Seven",
		"id": "3xbthh",
		"score": 5235,
		"title": "How do you confuse a gay person?"
	}, {
		"body": "a priest just asked me in and offered me a Slowpoke  edit: whoops, rip inbox. don't get sucked in by priests, kiddies.",
		"id": "4sgnkd",
		"score": 5233,
		"title": "I'm not sure churches are the best places for PokèStops..."
	}, {
		"body": "The police. ",
		"id": "2zt5ue",
		"score": 5226,
		"title": "What caused The Black Death?"
	}, {
		"body": "I accidentally put on the wrong sock this morning.",
		"id": "31zncq",
		"score": 5213,
		"title": "Why did the sperm cross the road?"
	}, {
		"body": "She couldn't solve inequalities ",
		"id": "3hgj29",
		"score": 5184,
		"title": "Why did the feminist fail algebra?"
	}, {
		"body": "Church  Edit: Thanks for Frontpage I will read thru all this when I get home and yeah I'm not an Atheist I'm a Christian",
		"id": "3be0zy",
		"score": 5170,
		"title": "What do you call a book club that's been stuck on the same book for thousands of years?"
	}, {
		"body": "One turns to the other and asks, \"*does this taste funny to you?*\"  The other responds, \"*no.*\"",
		"id": "41qv3v",
		"score": 5164,
		"title": "Two cannibals are eating Amy Schumer"
	}, {
		"body": "It's like a load of black people have suddenly gotten laptops or something.",
		"id": "2ncsqb",
		"score": 5156,
		"title": "Everyone keeps downvoting my racist jokes."
	}, {
		"body": "You should have seen her face as I drove pasta.",
		"id": "3rqx4e",
		"score": 5152,
		"title": "My mom laughed at me when I said I was going to build a car out of spaghetti."
	}, {
		"body": "they told me she was imaginary, but the jokes on them, because they are too.",
		"id": "5qg422",
		"score": 5151,
		"title": "I told my friends I had a date with a really attractive girl..."
	}, {
		"body": "Nobody's posted anything all year. ",
		"id": "2qysaj",
		"score": 5138,
		"title": "Is this subreddit dying?"
	}, {
		"body": "There once was a girl named Alice   Who used dynamite as a phallus   They found her vagina in South Carolina  And bits of her tits in Dallas",
		"id": "2kq9ij",
		"score": 5131,
		"title": "Dirty limericks? GO! [NSFW]"
	}, {
		"body": "He puts on his earpods and smugly declares \"sorry, you can't charge me while I'm using my headphones\".",
		"id": "523fem",
		"score": 5129,
		"title": "So the iPhone 7 gets arrested..."
	}, {
		"body": "You see her face everywhere",
		"id": "3aal1o",
		"score": 5117,
		"title": "Break ups are the worst in China"
	}, {
		"body": "The feathers, because 200 pounds of bricks is just 200 pounds of bricks, but with the feathers, you've also got to carry the weight of what you did to those poor birds",
		"id": "3fi8gt",
		"score": 5109,
		"title": "What's heavier, 200 pounds of bricks, or 200 pounds of feathers?"
	}, {
		"body": "After five years your Wife will still blow your paycheck",
		"id": "37peio",
		"score": 5103,
		"title": "What's the difference between a Penis and a paycheck?"
	}, {
		"body": "Ask him/her to pronounce unionized   Edit: Gets 3000+ upvotes, Karma remains at 20...",
		"id": "4mw4i1",
		"score": 5101,
		"title": "How do you tell the difference between a plumber and a chemist?"
	}, {
		"body": "Unless everyone gets them. ",
		"id": "4af833",
		"score": 5089,
		"title": "Socialist jokes are not funny"
	}, {
		"body": "Which means you can now legally blow the cartridges.",
		"id": "2hu42r",
		"score": 5073,
		"title": "The Nintendo 64 turns 18 this week..."
	}, {
		"body": "He asks him, \"Daddy what are you doing?\"  His dad responds, \"Don't worry son, you'll be doing it soon.\"  The boy then asks, \"Why's that daddy?\"  His dad answers, \"Because my arms getting tired..\"",
		"id": "51962l",
		"score": 5061,
		"title": "A boy walks in on his dad masturbating..."
	}, {
		"body": "They can finally legally own a black person again. ",
		"id": "4fptm8",
		"score": 5050,
		"title": "I don't see why racists are upset with Harriet Tubman being on the $20 bill..."
	}, {
		"body": "One's motto is 'Be Prepared', the other's is 'Beep Repaired'    EDIT:I reached r/all, I promised a friend of mine that I would stop calling his mom hot if I reached all.   He sends his regards... ",
		"id": "5ss571",
		"score": 5036,
		"title": "What's the difference between a Boy Scout and a guy who fixes bicycle horns?"
	}, {
		"body": " Then I said, \"no, yours does.\" Then I unplugged his life support.  EDIT: Came back from school to this! R.I.P Inbox!",
		"id": "30cpbw",
		"score": 5035,
		"title": "My grandpa said \"your life revolves too much around technology."
	}, {
		"body": "He was like, \"No way!\"  I was like, \"Yahweh\"",
		"id": "3d94ow",
		"score": 5028,
		"title": "I told my buddy that Jewish people call god by a different name"
	}, {
		"body": "I thought, \"I can't turn that down\"",
		"id": "4763gn",
		"score": 5007,
		"title": "Yesterday I saw an ad that said \"radio for sale, $1, volume stuck on full\""
	}, {
		"body": "can't wait to get out of prison. ",
		"id": "4seo3x",
		"score": 4998,
		"title": "Hey guys, don't you just hate it when you're woken up in the middle of the night for sex?"
	}, {
		"body": "When I got mine right after I was born, I couldn't walk for nearly a year",
		"id": "4ee5d0",
		"score": 4990,
		"title": "Circumcisions are painful."
	}, {
		"body": "Light blue.",
		"id": "3frmkg",
		"score": 4970,
		"title": "What's blue and not very heavy?"
	}, {
		"body": "So he can determine how high Mexican pole vaulters can jump.",
		"id": "4w87hf",
		"score": 4964,
		"title": "What is the only reason Donald Trump is watching the Olympics?"
	}, {
		"body": "I asked him why and he replied, \"Because I'm trying to examine you.\"",
		"id": "4nlswh",
		"score": 4962,
		"title": "My doctor told me I needed to stop masturbating."
	}, {
		"body": "",
		"id": "3f2ydl",
		"score": 4961,
		"title": "TIL I'm bad at posting at the right subreddit"
	}, {
		"body": "He grows taller.",
		"id": "48w73j",
		"score": 4953,
		"title": "What happens when Donald Trump takes Viagra?"
	}, {
		"body": "[removed]",
		"id": "34kihw",
		"score": 4949,
		"title": "How many Reddit mods does it take to change a lightbulb?"
	}, {
		"body": "Let me know if you can come or not",
		"id": "3il4yz",
		"score": 4940,
		"title": "I'm throwing a party for people who can't ejaculate"
	}, {
		"body": "I have an 'ex'-axis and a 'why?'-axis.",
		"id": "2s45bf",
		"score": 4935,
		"title": "I'm making a graph of my past relationships..."
	}, {
		"body": "As I got older I realized it was just a phase",
		"id": "4zu1p2",
		"score": 4934,
		"title": "As a child I was obsessed with the difference between cosine and sine"
	}, {
		"body": "Women",
		"id": "419jtr",
		"score": 4932,
		"title": "What gets easier to pick up, the more it weighs?"
	}, {
		"body": "I said, \"Awww, are you an orphan\"? He said, \"Yes, what gave me away?\" I said, \"Your parents.\" ",
		"id": "2bczq0",
		"score": 4931,
		"title": "Today I saw a little boy wearing rags sitting on a curb"
	}, {
		"body": "I have a feeling Paul/Walker would crash and burn.  Edit: thanks for the gold! It's my first!",
		"id": "3dao6o",
		"score": 4926,
		"title": "I hope Rand Paul doesn't pick Scott Walker as his VP"
	}, {
		"body": "Attire. ",
		"id": "2qklcg",
		"score": 4900,
		"title": "Whats The Difference Between a Hobo On a Unicycle And a Man In a Suit On a Bike?"
	}, {
		"body": "the execution  EDIT: This literally blew up! RIP my inbox",
		"id": "39oj3p",
		"score": 4892,
		"title": "What makes an ISIS joke funny?"
	}, {
		"body": "Germany. ",
		"id": "3cw1jo",
		"score": 4885,
		"title": "A Portuguese, a Greek, and a Spaniard go into a brothel. Who pays?"
	}, {
		"body": "A wet nose.",
		"id": "4u0pim",
		"score": 4883,
		"title": "What do a dog and a nearsighted gynecologist have in common?"
	}, {
		"body": "Ones a crusty bus station, the others a busty crustacean. ",
		"id": "3ttft2",
		"score": 4878,
		"title": "What's the difference in a dirty bus station and a lobster with breast implants?"
	}, {
		"body": "She's a perfect ten but imaginary ",
		"id": "4st06u",
		"score": 4868,
		"title": "My gf is like the square root of negative one hundred"
	}, {
		"body": "Pacquiao isn't his wife. ",
		"id": "34nynl",
		"score": 4851,
		"title": "You know why Mayweather won't beat Pacquiao?"
	}, {
		"body": "A four chin teller.   ",
		"id": "2kdoye",
		"score": 4850,
		"title": "What do you call a fat psychic?"
	}, {
		"body": "a retail store",
		"id": "2vf7dm",
		"score": 4844,
		"title": "Where does a dog go when he loses his tail"
	}, {
		"body": "'Cause they hate the French press",
		"id": "2rqcey",
		"score": 4839,
		"title": "Why do Jihadist Muslims only drink instant coffee?"
	}, {
		"body": "Met a beautiful girl down at the park today.  Sparks flew, she fell at my feet and we ended up having sex right there and then.   God, I love my new Taser...",
		"id": "4o15j6",
		"score": 4838,
		"title": "Met a beautiful girl down at the park today.."
	}, {
		"body": "There isn't a home page",
		"id": "32x2y9",
		"score": 4836,
		"title": "I just finished designing a website for an orphanage"
	}, {
		"body": "It started right up, they said I just need to replace the battery.",
		"id": "2elynw",
		"score": 4830,
		"title": "I was in Feruson, got jumped by 5 black guys"
	}, {
		"body": "I didn't believe it at first. But when I got home, all the signs were there.",
		"id": "2zcrla",
		"score": 4829,
		"title": "My dad was fired from his job in road work for theft..."
	}, {
		"body": "is because I don't like meeting dads.",
		"id": "4ibg4s",
		"score": 4815,
		"title": "The reason why I only date black girls"
	}, {
		"body": "Bill gates: So why don't you tell me why Bing failed.   Board: We feel there was a public nescience towards Bing.   Bill gates: Nescience? Let me Goog- Oh I see what you mean.",
		"id": "2ptcmw",
		"score": 4809,
		"title": "Bill Gates: \"Why don't you tell me why Bing failed\""
	}, {
		"body": "A four chin teller",
		"id": "520xdn",
		"score": 4809,
		"title": "What do you call a fat psychic?"
	}, {
		"body": "So please don't vote, her strap on is huge and it really scares me.",
		"id": "20aryi",
		"score": 4804,
		"title": "My girlfriend said if this gets 100 votes we'll try anal."
	}, {
		"body": "The loud beeping was giving me a headache and making me feel sick and dizzy.  [FRONT PAGE!](https://media2.giphy.com/media/FGmbEOTVWQHzW/200_s.gif)",
		"id": "40mw4n",
		"score": 4800,
		"title": "I had to take the batteries out of the carbon monoxide detector last night."
	}, {
		"body": "",
		"id": "3og716",
		"score": 4775,
		"title": "Leather armor is the best for sneaking because it's literally made of hide."
	}, {
		"body": "...   I've never had a garbanzo bean on my face.  Edit: Whoa, I knew this was a great joke but didnt expect this. Thanks!",
		"id": "2w9vbq",
		"score": 4720,
		"title": "What is the difference between a garbanzo bean and a chickpea?"
	}, {
		"body": "The butcher replies: \"Nooooo Black Betty, ham or lamb!\" ",
		"id": "2zauto",
		"score": 4718,
		"title": "A dark skinned lady named Betty goes to the butcher and asks for some beef."
	}, {
		"body": "But don't worry. It's safe sex.",
		"id": "3uc4hh",
		"score": 4703,
		"title": "I'm sexually attracted to metal boxes with locking systems."
	}, {
		"body": "A great thing ruined by a period. ",
		"id": "2mzkcb",
		"score": 4700,
		"title": "What's a 6.9?"
	}, {
		"body": "That's not funny.",
		"id": "2fo7p8",
		"score": 4691,
		"title": "How many feminists does it take to change a lightbulb?"
	}, {
		"body": "And asks 'where's ya bin mate'  The guy answers 'I bin watching TV!'  The Ozzie asks 'na mate where's ya wheelie bin'  The guy hangs his head and says 'I wheelie been wanking'",
		"id": "3yw6ap",
		"score": 4675,
		"title": "An Australian bin man knocks at the door of a Chinese guy"
	}, {
		"body": "Your ears.",
		"id": "2viql7",
		"score": 4672,
		"title": "What's the most sensitive part of your body when you masturbate?"
	}, {
		"body": "Happy Father's day",
		"id": "4oty8m",
		"score": 4664,
		"title": "I've got one thing to say to all you motherfuckers."
	}, {
		"body": "Her: Come over. Him: I'm coming over. Her: We should stop using walkie talkies in bed, over.",
		"id": "3tvg6z",
		"score": 4660,
		"title": "A guy and his girlfriend are talking"
	}, {
		"body": "[deleted]",
		"id": "3389wa",
		"score": 4655,
		"title": "Do you know how to disappoint a fellow redditor?"
	}, {
		"body": "It feels really good until you look down, and realize how gay you are.     Edit: Adam Carolla apparently wrote this.  Who knew?",
		"id": "2etftz",
		"score": 4649,
		"title": "Wearing Crocs is like getting a blow job from a dude..."
	}, {
		"body": "......EVERYWHERE!!!!!!!",
		"id": "2tcmrh",
		"score": 4646,
		"title": "Where do suicide bombers go when they die.....?"
	}, {
		"body": " Guess who's not allowed in my tree house anymore.  ",
		"id": "3brb9q",
		"score": 4644,
		"title": "My wife told me I was immature and needed to grow up."
	}, {
		"body": "One if nobody's looking.",
		"id": "2l7r0s",
		"score": 4615,
		"title": "How many vegans does it take to eat a bacon cheeseburger?"
	}, {
		"body": "Cause he is our father, and he never came back.",
		"id": "3ws311",
		"score": 4610,
		"title": "Why do some people think Jesus was black?"
	}, {
		"body": "All of our servers are busy right now. Please try again in a minute.",
		"id": "2vthl7",
		"score": 4601,
		"title": "A Redditor walks into Reddit Restaurant..."
	}, {
		"body": "A swallow",
		"id": "36dcxf",
		"score": 4588,
		"title": "If a bluebird has blue babies and a redbird has red babies, what kind of bird has no babies?"
	}, {
		"body": "…and asks her husband, 'What turns you on more! my pretty face or my sexy body?'   Husband looks her up and down for a moment and replies, 'Your sense of humor.' ",
		"id": "4hx1ly",
		"score": 4587,
		"title": "A wife gets naked..."
	}, {
		"body": "",
		"id": "3xpcpb",
		"score": 4583,
		"title": "Shout out to people who don't know the opposite of in"
	}, {
		"body": "I asked \" no bacon?  No burgers?!\"   To which he replied \"No fatty, just don't eat anything! \"",
		"id": "3o2unf",
		"score": 4578,
		"title": "I went to the doctor and he said \"don't eat anything fatty.\""
	}, {
		"body": "* Her: Do these pants make me look fat? * Him: Do you swear you won't get mad if I tell you the truth? * Her: I won't get mad, honey. You can tell me. * Him: I'm fucking your sister.",
		"id": "301ra9",
		"score": 4566,
		"title": "Swear you won't get mad"
	}, {
		"body": "Non-prophet. ",
		"id": "3yhaia",
		"score": 4558,
		"title": "What kind of organization is Atheism?"
	}, {
		"body": "Oh no! Playstation and xbox online services are down! Someone call an ambulance! Wii U Wii U Wii U",
		"id": "2qrjnw",
		"score": 4548,
		"title": "PS4/Xbox joke"
	}, {
		"body": "Because 7 needs a shit load of adapters to work",
		"id": "51y3in",
		"score": 4547,
		"title": "Why was 6 afraid of 7?"
	}, {
		"body": "Child services were not impressed with me.",
		"id": "2d86bd",
		"score": 4540,
		"title": "My son was on eBay this morning."
	}, {
		"body": "Until 9 months later when Consuela's baby came out looking just like me!",
		"id": "2vacsu",
		"score": 4535,
		"title": "My wife was happy when I told her a put a load in the dishwasher..."
	}, {
		"body": "Fortunately, I belong to the 1% of intelligent people",
		"id": "2mrggh",
		"score": 4529,
		"title": "99.9% of people are idiots."
	}, {
		"body": "They both barely cover an asshole. ",
		"id": "485ywf",
		"score": 4528,
		"title": "What do a thong and Donald Trump's toupee have in common?"
	}, {
		"body": "He kept fingering A minor.",
		"id": "3r2pzf",
		"score": 4526,
		"title": "Why was the piano teacher arrested?"
	}, {
		"body": "Thankyou daylight savings",
		"id": "3nfjtn",
		"score": 4518,
		"title": "Had sex for an hour and 30 seconds today"
	}, {
		"body": "It was a picture of me ",
		"id": "3uoyhy",
		"score": 4516,
		"title": "My dad posted a picture of his \"Condom challenge fail\""
	}, {
		"body": "If it sinks, girl ant. If it floats, buoyant. ",
		"id": "3hkr6p",
		"score": 4498,
		"title": "Did you know you can tell the gender of an ant by throwing it in water?"
	}, {
		"body": "In the Ark-Hives.",
		"id": "4sg1ey",
		"score": 4498,
		"title": "Where did Noah keep the Bees?"
	}, {
		"body": "I can't wait to see how big my puppy got",
		"id": "307jrr",
		"score": 4497,
		"title": "Tomorrow I am going to open the time capsule I buried as a kid."
	}, {
		"body": "To avoid being mistaken for feminists. ",
		"id": "3n6237",
		"score": 4496,
		"title": "Why do sumo wrestlers shave their legs?"
	}, {
		"body": "The next year I decided to get back at him and poison the cookies. Somehow, the bastard found out and killed my dad",
		"id": "2qas7c",
		"score": 4495,
		"title": "When I was 6 I got coal from Santa..."
	}, {
		"body": "No more jokes about the profit.",
		"id": "3naln8",
		"score": 4475,
		"title": "What do you get if you cross Islam and Capitalism?"
	}, {
		"body": "Just one... But it takes 4 episodes and Krillin dies...",
		"id": "2rioab",
		"score": 4475,
		"title": "How many Saiyans does it take to screw in a light bulb?"
	}, {
		"body": "A vegetarian. ",
		"id": "2zzhh2",
		"score": 4459,
		"title": "What do you call a cannibal who only eats coma patients?"
	}, {
		"body": "(2) I'm banned from Subway",
		"id": "2bsdon",
		"score": 4458,
		"title": "Interesting fact about myself: (1) my penis is not as long as a footlong sub"
	}, {
		"body": "Fucking Parrot didn't know what hit it.",
		"id": "4eqzim",
		"score": 4428,
		"title": "I won my first cage fight last night..."
	}, {
		"body": "And I yelled out \"I'm rooting for the one with the knife\"  Then they both ran away",
		"id": "5157b5",
		"score": 4427,
		"title": "I saw two blind men fighting"
	}, {
		"body": "She kept yelling, \"I'm peeing in here!\"  What a bitch. ",
		"id": "4jbnxw",
		"score": 4425,
		"title": "I tried being polite by holding the door open for a lady"
	}, {
		"body": "I Thought To Myself, 'Please don't get an erection, Please don't get an erection'. But She Did. ",
		"id": "3cjxy9",
		"score": 4419,
		"title": "I Was Sitting On A Train Next To A Hot Thai Girl"
	}, {
		"body": "The sock under my bed.",
		"id": "2p2mn3",
		"score": 4417,
		"title": "What's 10 inches long, hard as a rock, full of semen and makes all of the ladies scream?"
	}, {
		"body": "1) I want my remains spread out at Disney World 2) I do not want to be cremated.",
		"id": "4oolz3",
		"score": 4403,
		"title": "I have two requirements in my will...."
	}, {
		"body": "No matter how kind you are, German kids are kinder.",
		"id": "49a46w",
		"score": 4392,
		"title": "No matter how kind you are..."
	}, {
		"body": "I was in bed last night with my wife. She turns to me and says \"If you turn the lamp off, I'll take it up the arse.\" I should have waited for the bulb to cool down.",
		"id": "30eh4t",
		"score": 4392,
		"title": "I was in bed last night with my wife..."
	}, {
		"body": "Brexit to be followed by Grexit. Departugal. Italeave. Fruckoff. Czechout. Oustria. Finish. Slovlong. Latervia. Byegium.. until EU reach the state of Germlonely.",
		"id": "4plnj7",
		"score": 4386,
		"title": "Brexit's Worst-Case Scenario:"
	}, {
		"body": "One connects to all your devices & accesses your data, and the other is a hardware standard",
		"id": "46zni2",
		"score": 4384,
		"title": "What's the difference between USA and USB?"
	}, {
		"body": "Because they can't even.",
		"id": "22cx39",
		"score": 4371,
		"title": "Why do teenage girls hang out in odd-numbered groups?"
	}, {
		"body": "A tourist",
		"id": "2b5tfm",
		"score": 4368,
		"title": "What do you call a hot chick in Boston?"
	}, {
		"body": "because it says in the bible, a man who lies with another man shall be stoned",
		"id": "3b8fyp",
		"score": 4364,
		"title": "Marijuana should've been legalized at the same time as same sex-marriage"
	}, {
		"body": "He yells \"Don't do it! You have so much potential!\"",
		"id": "267ij0",
		"score": 4359,
		"title": "A physicist sees a young man about to jump off the Empire State Building..."
	}, {
		"body": "That wasn’t a very nice postcard to receive.",
		"id": "2ibdtx",
		"score": 4357,
		"title": "My wife told me \"Sex is better on holiday\"."
	}, {
		"body": "You have the rest of your life to fix it.",
		"id": "4dvj2j",
		"score": 4353,
		"title": "If your parachute doesn't deploy don't worry.."
	}, {
		"body": "I looked her dead in the eye and said, \"the motherfucking decepticons\". She laughed, I laughed, the toaster laughed, I shot the toaster, it was a good time. ",
		"id": "2m41ze",
		"score": 4337,
		"title": "My girlfriend asked why I carry a gun around the house?"
	}, {
		"body": "A Communist joke, because everyone gets it.",
		"id": "5rf5x1",
		"score": 4332,
		"title": "What type of joke is the best joke?"
	}, {
		"body": "Tomorrow",
		"id": "4fwnjx",
		"score": 4327,
		"title": "When is my wife's favorite day to make love?"
	}, {
		"body": "They come in hot and wet and leave with **THE LAWN CHAIRS WE BOUGHT TOGETHER SARA YOU BITCH!**",
		"id": "2gdpqw",
		"score": 4327,
		"title": "Whats similar between a hurricane and women?"
	}, {
		"body": "Because he's a fucking creep",
		"id": "2w6o3n",
		"score": 4322,
		"title": "Why does Dr. Pepper come in bottles?"
	}, {
		"body": "The amazing fact is that men are so decent, they only look at the 10% that isn't. ",
		"id": "3u155b",
		"score": 4311,
		"title": "A bikini is an outfit where 90% of a woman's body is exposed."
	}, {
		"body": "She kept telling me how huge my cock was but I'm pretty sure she was just pulling my leg. ",
		"id": "4xr8q6",
		"score": 4304,
		"title": "I slept with a Blind Girl"
	}, {
		"body": "I only know because they told everyone within two minutes.",
		"id": "2lwz6g",
		"score": 4300,
		"title": "An atheist, a vegan, and a crossfitter walk into a bar..."
	}, {
		"body": "F5",
		"id": "36cz9p",
		"score": 4293,
		"title": "How does Stephen Hawking refresh after a long day?"
	}, {
		"body": "Because burning that shit will get you stoned ",
		"id": "2az5xv",
		"score": 4291,
		"title": "I call my weed the Quran..."
	}, {
		"body": "Two cannibals are eating Amy Schumer  One turns to the other and asks, \"does this taste funny to you?\" The other responds, \"no.\"",
		"id": "5rux1s",
		"score": 4279,
		"title": "Two cannibals are eating Amy Schumer"
	}, {
		"body": "I had to put my foot down",
		"id": "2j0rwb",
		"score": 4277,
		"title": "My girlfriend told me to stop impersonating a flamingo..."
	}, {
		"body": "I said \"Son, That's three schools this year...maybe teaching is not for you\"",
		"id": "51hpxs",
		"score": 4276,
		"title": "My son got thrown out of school today for letting a girl in his class jack him off..."
	}, {
		"body": "Because it's white and settles on their land. ",
		"id": "320soc",
		"score": 4276,
		"title": "Why do Native Americans hate snow?"
	}, {
		"body": "A laughing stock.",
		"id": "33yg1m",
		"score": 4267,
		"title": "What do you get if you boil funnybones?"
	}, {
		"body": "I replied 'Probably failing my driving test'.",
		"id": "2ub1el",
		"score": 4267,
		"title": "My friend text me 'what are you doing now?'"
	}, {
		"body": "",
		"id": "3anymt",
		"score": 4247,
		"title": "The inventor of knock knock jokes should win a no-bell prize."
	}, {
		"body": "They both like to crack open a cold one.",
		"id": "3qnzjd",
		"score": 4231,
		"title": "What does a necrophiliac and an alcoholic have in common?"
	}, {
		"body": "If it gets any worse ill need to let her back in.",
		"id": "3u74cd",
		"score": 4215,
		"title": "Since it started snowing, all my grandma has done is stare through the window."
	}, {
		"body": "Because noble gases are nonreactive. ",
		"id": "52rhir",
		"score": 4203,
		"title": "Why couldn't the chemist laugh at the queens fart?"
	}, {
		"body": "\"Houston, we have a problem.\" What? \"Never mind\" What's the problem? \"Nothing\" Please tell us? \"You know what the problem is.\"",
		"id": "2j1oq7",
		"score": 4190,
		"title": "First woman on the Moon:"
	}, {
		"body": "Mariguana.",
		"id": "35p86k",
		"score": 4187,
		"title": "What kind of weed do reptiles smoke?"
	}, {
		"body": "Doesnt cure it, but it keeps the sheets off my legs at night",
		"id": "2cxvqr",
		"score": 4176,
		"title": "I've been taking Viagra for my sunburn"
	}, {
		"body": "But then I thought about malaria in Africa and it all made sense.",
		"id": "3w2083",
		"score": 4173,
		"title": "In Pokemon, I never understood why bug types were supereffective against dark types."
	}, {
		"body": "Then Reddit taught me it was just dyslexia...  Edit: Holy donkey balls this blew up during my daily 8 hour nap. Thanks everyone for making my New Years..",
		"id": "2qws98",
		"score": 4163,
		"title": "I used to have sex daily..."
	}, {
		"body": "\"Maybe you should wait outside whilst I examine your dog,\" said the vet.      Edit: HOLY SHIT FRONT PAGE!!!! I'm so excited i almost cum in my pants! but i came in my dog instead :)  ",
		"id": "2o1o4t",
		"score": 4163,
		"title": "As he inserted the rectal thermometer, I got a painfully hard and obvious erection."
	}, {
		"body": "She got fired too.",
		"id": "323s3r",
		"score": 4161,
		"title": "I got fired for sticking my dick in the pickle slicer at work."
	}, {
		"body": "The man at customs asks him  \"Do you have a criminal record?\"  The British man replies  \"I didn't think you'd need one to get into Australia any more.\"",
		"id": "3dq0wk",
		"score": 4149,
		"title": "A British man is visiting Australia."
	}, {
		"body": "Because they are hill areas.      I'll show myself out",
		"id": "2w4ue6",
		"score": 4148,
		"title": "Why are mountains so funny?"
	}, {
		"body": "  Not because he was in to bestiality, you Islamophobe.  He was at the petting zoo for his wife's 9th birthday ",
		"id": "3yz6hz",
		"score": 4146,
		"title": "Why was the Muslim rubbing the goat?"
	}, {
		"body": "A fart.   *dedicated to my dear departed Grandfather who told me this joke almost 40 years ago when I was a kid.*",
		"id": "36gwyh",
		"score": 4128,
		"title": "What is born skinless, flies wingless and sings until it dies?"
	}, {
		"body": "Must be some kind of milestone.",
		"id": "2fcvjq",
		"score": 4126,
		"title": "I found a rock yesterday which measured 1760 yards in length."
	}, {
		"body": "She took a jump in the pool, they found water on Mars.",
		"id": "3n0ivm",
		"score": 4120,
		"title": "Yo momma is so fat ..."
	}, {
		"body": "So I told him if he didn't stop bleeding right away, he'd die. ",
		"id": "2ma7if",
		"score": 4113,
		"title": "My friend was bleeding, and the first aid book told me to apply pressure."
	}, {
		"body": "Because he couldn't find the Droid he was looking for.",
		"id": "2qeg61",
		"score": 4106,
		"title": "Why did the Storm Trooper decide to buy an Iphone?"
	}, {
		"body": "My point is old people shouldn't get to vote ",
		"id": "4w825o",
		"score": 4100,
		"title": "Imagine if your roommate made you watch a movie and left 10 mins into it. Dick move, right?"
	}, {
		"body": "Son: When Lincoln was your age he was President.",
		"id": "3asjyl",
		"score": 4094,
		"title": "Father: When Abe Lincoln was your age he walked 9 miles to school and did homework by candlelight."
	}, {
		"body": "Ten. One to change the lightbulb and nine to blog about how empowering it was.",
		"id": "2zlrot",
		"score": 4092,
		"title": "How many feminists does it take to change a lightbulb?"
	}, {
		"body": "They gave me a Rolex. I think they misunderstood when I said I wanna watch.",
		"id": "2m660p",
		"score": 4083,
		"title": "My lesbian neighbours asked me what I wanted for my birthday."
	}, {
		"body": "She's still not talking to me :(",
		"id": "2npxbc",
		"score": 4076,
		"title": "I accidentally gave my girlfriend a glue stick instead of chapstick..."
	}, {
		"body": "Now he has Gatorades. ",
		"id": "4o3zh2",
		"score": 4057,
		"title": "An alligator decided to have unprotected sex..."
	}, {
		"body": "Your mom doesn't stop sucking when I smack her",
		"id": "4bmsb2",
		"score": 4055,
		"title": "What's the difference between your mom and a mosquito?"
	}, {
		"body": "Not my fault they don't have Windows.﻿",
		"id": "3ts3m8",
		"score": 4049,
		"title": "I farted in the Apple store and everyone got pissed at me."
	}, {
		"body": "I miss snowballs, she was a good cat.",
		"id": "2oxcs4",
		"score": 4049,
		"title": "When I was five, my Dad put Snowballs in the blender to make a slushie..."
	}, {
		"body": "You were too lazy to read that number.",
		"id": "35s5qf",
		"score": 4012,
		"title": "Lazy people fact #4564321564"
	}, {
		"body": "What I'm doing is natural and strengthens the bond between me and my dog.",
		"id": "2kg9dy",
		"score": 4003,
		"title": "People who get offended when I breastfeed in public can just fuck off."
	}, {
		"body": "That'll teach her to talk back.",
		"id": "4hu1u0",
		"score": 3999,
		"title": "My daughter just lost her first tooth!"
	}, {
		"body": "If you have to force it, then it's probably shit.",
		"id": "4707kt",
		"score": 3997,
		"title": "Love is like a fart."
	}, {
		"body": "I'm not sure about this NFL draft thing.",
		"id": "34gojn",
		"score": 3983,
		"title": "Old rich white men selecting strong young black men to work on their fields?"
	}, {
		"body": "You don't want it, but your dad gives it to you anyway ",
		"id": "4yogez",
		"score": 3982,
		"title": "Anal sex is just like your first car"
	}, {
		"body": "I've fucked a set of twins. People have asked me how hard it was to tell them apart, but it was actually quite easy. You see, Caroline was a redhead with an amazing pair of tits, And frank had a cock.",
		"id": "5rg5gg",
		"score": 3981,
		"title": "Difference between twins"
	}, {
		"body": "Stark naked.",
		"id": "2jbgbn",
		"score": 3979,
		"title": "What is Iron Man when he removes his suit?"
	}, {
		"body": "I'd still be broke. Because I am black and can't read. ",
		"id": "4pa443",
		"score": 3977,
		"title": "If I had $1 for every time I read a racist comment on the internet"
	}, {
		"body": "But Hitler made 6,000,000 jews toast  EDIT: Holy shit guys, 2700?!",
		"id": "432ipm",
		"score": 3970,
		"title": "Jesus Christ fed 2,000 people with 5 loaves of bread and 2 fish"
	}, {
		"body": "They're always coming in a little behind.",
		"id": "4h98kv",
		"score": 3969,
		"title": "Why don't pedophiles ever win marathons?"
	}, {
		"body": "I'm not sharing the money. I'll just let you know I won. ",
		"id": "40v070",
		"score": 3969,
		"title": "If I win tonight's Powerball, I'm sharing with everyone on Reddit."
	}, {
		"body": "Nothing, they just waved.  (Sorry)",
		"id": "45ge3i",
		"score": 3963,
		"title": "What did the black holes say when they collided?"
	}, {
		"body": "Just kidding ",
		"id": "5qtyu2",
		"score": 3960,
		"title": "A Muslim walks into the U.S"
	}, {
		"body": "The plot was a bit predictable   And a little flat   Good special f(x) though",
		"id": "2yg951",
		"score": 3957,
		"title": "I just watched a movie about a y=x graph"
	}, {
		"body": "Sorry it was supposed to say Female but the emale got deleted.",
		"id": "4s7cs2",
		"score": 3954,
		"title": "Hilary Clinton could be the first F president ever elected in to office."
	}, {
		"body": "\"Shut up, and keep digging\"",
		"id": "2fsrm7",
		"score": 3952,
		"title": "\"Dad, I don't want to go visit Grandma\""
	}, {
		"body": "It doesn't last as long for fat people.",
		"id": "3a7cfr",
		"score": 3932,
		"title": "Life is like a box of chocolates"
	}, {
		"body": "You can tuna piano but you can't piano tuna!",
		"id": "4t4onm",
		"score": 3920,
		"title": "What's the difference between tuna, glue and a piano?"
	}, {
		"body": "Because she couldn't see that well.",
		"id": "4tpfh1",
		"score": 3915,
		"title": "Why did the blind woman fall down the well?"
	}, {
		"body": "They've left those kids a loan.  EDIT: Woke up to find THIS :O  ",
		"id": "3mrc5o",
		"score": 3907,
		"title": "The American education system obviously listen to Pink Floyd."
	}, {
		"body": "Only a fraction of you will get this",
		"id": "2p56d1",
		"score": 3906,
		"title": "There's a fine line between a numerator and a denominator"
	}, {
		"body": "\"What's wrong, honey?\" her husband asks.  \"What's wrong?!?\" the woman shouts, \"THESE CONTRACTIONS ARE GOING TO BE THE DEATH OF ME!\"  \"Sorry babe. *What is* wrong?\"",
		"id": "4vywtl",
		"score": 3901,
		"title": "A woman screams as she gives birth..."
	}, {
		"body": "Because I put on the wrong sock this morning.",
		"id": "2oz6zz",
		"score": 3892,
		"title": "Why did the sperm cross the road?"
	}, {
		"body": "So we made her marry a man she never met in order to secure a French alliance. ",
		"id": "2kii8b",
		"score": 3887,
		"title": "My friend wanted to feel like a princess on her wedding day"
	}, {
		"body": "How many scientists does it take to build a time machine?",
		"id": "2ne7wf",
		"score": 3877,
		"title": "Just one."
	}, {
		"body": "Police think it may be race related",
		"id": "2cc906",
		"score": 3869,
		"title": "Apparently someone has been shot with a starter pistol at the athletics track"
	}, {
		"body": "Every time I walk in her room that's all she's doing.",
		"id": "3ejqmd",
		"score": 3868,
		"title": "My daughters boyfriend still doesn't know how to tie his shoes..."
	}, {
		"body": "[removed]",
		"id": "4r5enu",
		"score": 3866,
		"title": "What does Donald Trump's hair get at the end of each day?"
	}, {
		"body": "She said \"You have the biggest dick I've ever put my hands on.\"  I said \"Nah. You're just pulling my leg.\"",
		"id": "2hbuui",
		"score": 3849,
		"title": "Got a handjob from a blind girl last night"
	}, {
		"body": "Every time I lay my ear on it I can smell the sea.",
		"id": "4f43ua",
		"score": 3844,
		"title": "My girlfriend got a tattoo of a shell on her thigh"
	}, {
		"body": "His Agent says, \"Sure. No hassle.\"",
		"id": "3d293m",
		"score": 3839,
		"title": "David Hasselhoff calls his Agent and demands, \"I want everyone to call me The Hoff from now on.\""
	}, {
		"body": "...and my job at the morgue.",
		"id": "3zm0bv",
		"score": 3833,
		"title": "I lost two things today. My virginity..."
	}, {
		"body": "Au-burn     ^He^^He^^^He^^^^He",
		"id": "2hw6q2",
		"score": 3832,
		"title": "What color does your skin turn when you pour molten gold onto it?"
	}, {
		"body": "Teenager:  \"And another thing - JIM MORRISON SUCKS!\"  Dad:  \"Hey! There'll be no slamming of the Doors in this house!\"",
		"id": "2zdc9n",
		"score": 3825,
		"title": "An insolent teenager stomps off to her room..."
	}, {
		"body": "All that time and nothing to chauffeur it.    I'm pretty sure this is the joke that will yield me my fortune.",
		"id": "2e5dkl",
		"score": 3810,
		"title": "Did you hear about the limo driver who was in business for 25 years without a single customer?"
	}, {
		"body": "",
		"id": "2v2zsi",
		"score": 3808,
		"title": "I can't remember what 51, 6 and 500 are in Roman numerals... fucking livid"
	}, {
		"body": "He's going to have a very hard test tomorrow. ",
		"id": "2vby1u",
		"score": 3794,
		"title": "I just sold viagra to a guy who thinks it's adderal."
	}, {
		"body": "One’s a Goodyear. The other’s a *great* year.",
		"id": "4306lx",
		"score": 3789,
		"title": "What’s the difference between a tire and 365 used condoms?"
	}, {
		"body": "Whitney Houston's crack pipe.",
		"id": "2rgafe",
		"score": 3788,
		"title": "What's 7 inches long and hasn't been sucked in over 2 years?"
	}, {
		"body": "Because Ken always came in another box.",
		"id": "2o42ex",
		"score": 3771,
		"title": "How come Barbie never got pregnant?"
	}, {
		"body": "otherwise it would have been called the teethbrush.   Edit: Sorry for picking on you WV, when there appears to be numerous other states I could have equally offended with this joke. ",
		"id": "2k72ig",
		"score": 3766,
		"title": "TIL that the toothbrush was invented in West Virginia..."
	}, {
		"body": "Because everytime they try to pronounce \"election\" everyone starts to giggle",
		"id": "2qtq4o",
		"score": 3761,
		"title": "Why isn't there democracy in North Korea?"
	}, {
		"body": "i replied \"nah, honey, i'm gonna pick both of them\"",
		"id": "2jomc9",
		"score": 3761,
		"title": "my wife finally agreed to a threesome, on the condition that she picks the girl"
	}, {
		"body": "A Dell",
		"id": "3u2f1q",
		"score": 3752,
		"title": "What do you call a singing laptop?"
	}, {
		"body": "",
		"id": "3isflm",
		"score": 3750,
		"title": "Donald Trump"
	}, {
		"body": "He asked me to help him check his balance.... So I pushed the fucker over.",
		"id": "39i96p",
		"score": 3743,
		"title": "I saw a one legged man with no arms at the ATM today..."
	}, {
		"body": "the same way you would a white person.... you racist.",
		"id": "3jm5hn",
		"score": 3733,
		"title": "how do you starve a black person?"
	}, {
		"body": "Then they call me ugly and poor.",
		"id": "28jlwr",
		"score": 3725,
		"title": "Women only call me ugly until they find out how much money I make."
	}, {
		"body": "Now it just doesn't work.",
		"id": "3qyhuw",
		"score": 3720,
		"title": "Painted my computer black hoping it would run faster..."
	}, {
		"body": "Artificial Swedeners",
		"id": "2izvqp",
		"score": 3710,
		"title": "What do you call immigrants to Sweden?"
	}, {
		"body": "I hate cops. ",
		"id": "53jezg",
		"score": 3694,
		"title": "I yelled \"shotgun\", long before anyone else, but I still got to sit in the backseat."
	}, {
		"body": "This just shows how big the Chinese population is getting.",
		"id": "4dnjqz",
		"score": 3689,
		"title": "Scientists say the average size of the male penis has gone down to 5 inches."
	}, {
		"body": "Or was Snoop Lyin'?  Edit: Just in case the king sees this, I got mad respect for you Dogg. Smoke weed everyday.   (His grandmother passed away recently, I'm just trying to be nice people.)",
		"id": "47swji",
		"score": 3681,
		"title": "Didn't Snoop Dogg change his name?"
	}, {
		"body": "Because she wasn't wearing her seatbelt.",
		"id": "3ng396",
		"score": 3673,
		"title": "Why did Princess Diana cross the road?"
	}, {
		"body": "",
		"id": "2uh706",
		"score": 3672,
		"title": "The Seattle Seahawks play calling."
	}, {
		"body": "Sorry guys this one's a repost",
		"id": "4trbgk",
		"score": 3665,
		"title": "Melania Trump's Speech"
	}, {
		"body": "saying \"ithinktherearesomeproblemswithmykeyboardcanyoupleasegivemeanalternative\"  Oh boy am I excited, but what does \"ternative\" mean?",
		"id": "46v2bc",
		"score": 3658,
		"title": "A young lady from my office just sent me an email"
	}, {
		"body": "It turned out to be a night mare.",
		"id": "3fe7x6",
		"score": 3657,
		"title": "I dreamt about a horse last night."
	}, {
		"body": "I need to start sleeping with my mouth closed.",
		"id": "4czciy",
		"score": 3654,
		"title": "I was awakened with a blowjob today"
	}, {
		"body": "But it turned out to be no match for me at kickboxing.",
		"id": "4c8y0i",
		"score": 3637,
		"title": "Yeah, I lost to my computer at chess."
	}, {
		"body": "..she is always setting booby traps! ",
		"id": "3phaqy",
		"score": 3629,
		"title": "Tripped over my friends bra..."
	}, {
		"body": "Purchased cheaply after having been raised in exploitative conditions.  Edit: wow, front page with an \"I like my coffee like I like my women\" joke. You should all be ashamed of yourselves!",
		"id": "3rzstm",
		"score": 3619,
		"title": "I like my coffee like I like my women"
	}, {
		"body": "She got mad and said she’s never playing Scrabble with me again.",
		"id": "51velb",
		"score": 3614,
		"title": "My wife found out I was cheating after she found the letters I was hiding."
	}, {
		"body": "I saw a politican with his hands in his own pockets.",
		"id": "2mven7",
		"score": 3605,
		"title": "It's so cold outside"
	}, {
		"body": "I splatter all over her while she screams and tries to get out of the car.  Edit: thanks for the gold kind stranger. ",
		"id": "4mivk2",
		"score": 3602,
		"title": "My favorite sex position is the JFK"
	}, {
		"body": "Because the cow has the udder.",
		"id": "3dppir",
		"score": 3599,
		"title": "Why does a milking stool only have three legs?"
	}, {
		"body": "And I don't know if I should tell him.",
		"id": "38ek7r",
		"score": 3598,
		"title": "My friend that only dates Asian girls just started dating his ex-girlfriend again"
	}, {
		"body": "That's when I realized I'd drugged the wrong glass.",
		"id": "2tyral",
		"score": 3596,
		"title": "As I looked into her eyes I felt my knees go weak and my stomach turned to butterflies."
	}, {
		"body": "Apparently not three because my basement is still dark.",
		"id": "32z0yz",
		"score": 3594,
		"title": "How many dead hookers does it take to change a lightbulb?"
	}, {
		"body": "My severely diabetic sister.",
		"id": "2h6nmh",
		"score": 3583,
		"title": "What do you call a cow with no legs?"
	}, {
		"body": "Literally everyone I ask doesn't know.",
		"id": "3fqpsm",
		"score": 3581,
		"title": "What does idk stand for?"
	}, {
		"body": "a whim away, a whim away, a whim away",
		"id": "35kylj",
		"score": 3575,
		"title": "My urge to sing \"The Lion Sleeps Tonight\" is just a whim away"
	}, {
		"body": " My sister.",
		"id": "52ttyx",
		"score": 3564,
		"title": "What’s baked every day and sells itself?"
	}, {
		"body": "\"Thirteen glasses of water, please!\", Jesus said to the barman, winking at the others...",
		"id": "2i6ef8",
		"score": 3550,
		"title": "Jesus walks into a bar with his disciples..."
	}, {
		"body": "Do any of you know what \"ternative\" means?",
		"id": "2t1pdc",
		"score": 3531,
		"title": "My gf texted me \"myspacebuttonisbrokenonmyphonecanyoupleasegivemeanalternative\""
	}, {
		"body": "I'm not a mourning person.  Edit: WHY THE HELL DID THIS MAKE THE JOKES FRONT PAGE",
		"id": "4keuq4",
		"score": 3518,
		"title": "I don't like how funerals are usually at 9 or 10 AM."
	}, {
		"body": "Two chicks walk into a bar. One says to the other,\"Have you ever heard of the Bechdel test?\" The other says,\"Yeah, my boyfriend was telling me about it the other day.\"",
		"id": "2a8lad",
		"score": 3518,
		"title": "(Nerdy joke) Two chicks walk into a bar..."
	}, {
		"body": "She begins every conversation with \"Were you even listening to me?\"",
		"id": "34p4ds",
		"score": 3516,
		"title": "My wife is weird..."
	}, {
		"body": "[removed] [deleted]   [removed] [deleted] [removed]   [deleted] [removed]",
		"id": "3gm7qp",
		"score": 3516,
		"title": "I wrote a haiku about admins and mods"
	}, {
		"body": " Beat it. We’re closed.",
		"id": "5233qu",
		"score": 3492,
		"title": "What does the sign on an out-of-business brothel say?"
	}, {
		"body": "You don't want to know how the last guy does it...   Note: all my jokes I post here are originals I'm working on, so as always, feedback is good yadda yadda yadda",
		"id": "2gq5lt",
		"score": 3488,
		"title": "I learned recently that 9/10 men masturbate regularly"
	}, {
		"body": "You have my Word.",
		"id": "2ed5nc",
		"score": 3485,
		"title": "Who ever stole my copy of Microsoft Office is in trouble."
	}, {
		"body": "I stop at nothing to avoid them.",
		"id": "4ymxdg",
		"score": 3480,
		"title": "When counting down, I can't stand negative numbers"
	}, {
		"body": "It's OK though, I only have super fish oil injuries.",
		"id": "43o16p",
		"score": 3461,
		"title": "My girlfriend threw a bottle of Omega 3 capsules at me."
	}, {
		"body": "[removed]",
		"id": "2yyzcu",
		"score": 3454,
		"title": "Why does OP never deliver?"
	}, {
		"body": "Hitler: \"Mine less then\"  *Grammar Nazi bursts in*  \"MINE FEWER.\"  *Hitler looks over* \"Yes?\"  [EDIT](http://www.reddit.com/r/AntiJokes/comments/2dmxah/sir_were_mining_too_many_useless_minerals/)",
		"id": "2dmirb",
		"score": 3454,
		"title": "\"Sir, we're mining too many useless minerals.\""
	}, {
		"body": "Independence Day",
		"id": "2guetc",
		"score": 3448,
		"title": "What is the difference between Will Smith and Scotland ?"
	}, {
		"body": "So he can fit on a spaceship.",
		"id": "36mndx",
		"score": 3440,
		"title": "What is E.T. short for?"
	}, {
		"body": "",
		"id": "2pfqv3",
		"score": 3436,
		"title": "The Chicago Bears"
	}, {
		"body": "Invite two of them.",
		"id": "2u2wyg",
		"score": 3428,
		"title": "How do you get a Mormon to stop drinking all of your alcohol?"
	}, {
		"body": "What I'm doing is **natural** and strengthens the bond between me and my dog.",
		"id": "3gg5n3",
		"score": 3428,
		"title": "People who are offended when I breastfeed in public need to shut the fuck up"
	}, {
		"body": "Upvote for visibility.",
		"id": "1zu4rp",
		"score": 3422,
		"title": "My doctor said if I get 1000 upvotes he will perform free LASIK surgery!!"
	}, {
		"body": "But when I got home, all the signs were there.",
		"id": "4j2l5m",
		"score": 3411,
		"title": "I refused to believe my dad was stealing from his job as a road worker"
	}, {
		"body": "loading...",
		"id": "2g6tz6",
		"score": 3390,
		"title": "Just an Internet Explorer joke"
	}, {
		"body": "Then I learned the Lord doesn't work that way so I stole one and prayed for forgiveness instead  edit: woohoo #1",
		"id": "3aprf8",
		"score": 3385,
		"title": "When I was a kid I prayed every night for a new bicycle"
	}, {
		"body": "Because they're all Targets. ",
		"id": "2j61li",
		"score": 3384,
		"title": "Why are there no Walmarts in Iraq?"
	}, {
		"body": "\"Would you make a frog noise for me?\" The grandad, confused asks, \"why?\" The little girl replies, \"dad says when you croak we are all going to disneyland\".",
		"id": "251l1e",
		"score": 3383,
		"title": "A little girl asks her grandad..."
	}, {
		"body": "Apparently the politically correct term is \"Tyrone, please paint the fence\"",
		"id": "446wcq",
		"score": 3376,
		"title": "Someone called me racist for saying \"black paint\""
	}, {
		"body": "...if anybody does, we can drop them off tomorrow.",
		"id": "2ia2mh",
		"score": 3370,
		"title": "My wife and I decided we don't want children..."
	}, {
		"body": "It's not hard.",
		"id": "3inu81",
		"score": 3368,
		"title": "How do find the blind man at the nudist colony?"
	}, {
		"body": "While on her way to work, she texted me saying she only put deodorant on one side.   To which I replied,  \"At least you won't smell half bad!\"",
		"id": "2ewzww",
		"score": 3353,
		"title": "I happily dad joked my fiancé"
	}, {
		"body": "...and that \"we should split up\"  \"Good idea\", I said, \"that way we can cover more ground\"",
		"id": "3n3ys0",
		"score": 3348,
		"title": "My girlfriend said she was sick of me pretending to be a detective..."
	}, {
		"body": "So I stuck it in her ass and said \"yeah, you like that Steve?\"",
		"id": "4a17a2",
		"score": 3340,
		"title": "My girlfriend told me to fuck her like a man"
	}, {
		"body": "Looks like I'm in store for a wild December ",
		"id": "3san2l",
		"score": 3339,
		"title": "Stats show the average person has sex 89 times per year"
	}, {
		"body": "Mein Kraft.",
		"id": "53ccn1",
		"score": 3329,
		"title": "What's Adolf Hitler's favourite computer game?"
	}, {
		"body": "She said no both times. ",
		"id": "2ppa8f",
		"score": 3329,
		"title": "Four years ago, I asked the girl of my dreams out on a date. Today, I asked her to marry me."
	}, {
		"body": "A selfie stick ",
		"id": "3fkrvo",
		"score": 3327,
		"title": "What's 12 inches long and snaps a cunt?"
	}, {
		"body": "\"Chris, close the god damn door if you're taking a shit\"",
		"id": "5tiayt",
		"score": 3327,
		"title": "\"Dad, look! I'm a 3D printer!\""
	}, {
		"body": "The hardest part is always having to act surprised.",
		"id": "50j8su",
		"score": 3326,
		"title": "I got a call from my ex crying and telling me she was HIV+"
	}, {
		"body": "Luckily, he was so good I didn't give a shit",
		"id": "3m9ewm",
		"score": 3309,
		"title": "My grief counselor died last week."
	}, {
		"body": "A Christler   I'm so sorry...",
		"id": "2bxyd9",
		"score": 3305,
		"title": "What car does Jesus drive?"
	}, {
		"body": "Exxon-Mobil had to lay off 25 Congressmen.",
		"id": "48xpt2",
		"score": 3295,
		"title": "The price of oil has dropped so far that..."
	}, {
		"body": "To beat the crowd",
		"id": "4ouds4",
		"score": 3279,
		"title": "Why do riot police get to work early?"
	}, {
		"body": "In the spaghetto.  Kudos to my friend who came up with this.",
		"id": "3ti7sr",
		"score": 3261,
		"title": "Where do poor meatballs live?"
	}, {
		"body": "\"will i marry you?\"",
		"id": "2hm3ab",
		"score": 3250,
		"title": "How did Kanye West ask Kim Kardashian to marry him ??"
	}, {
		"body": "In a bucket",
		"id": "2xotoi",
		"score": 3241,
		"title": "How did the chicken cross the street in the ghetto"
	}, {
		"body": "I thought to myself, I can’t turn that down.",
		"id": "50dwyx",
		"score": 3238,
		"title": "I saw an advert that read: “Television for sale, $1, volume stuck on full.”"
	}, {
		"body": "But she screamed when I brought her one.",
		"id": "3c2gb4",
		"score": 3231,
		"title": "My wife told me she wanted the body of a stripper."
	}, {
		"body": "They'll kill your dog.",
		"id": "4y8fqt",
		"score": 3224,
		"title": "Crazy ex-girlfriends are like a box of chocolates..."
	}, {
		"body": "You're either on a roll.....or you're taking shit from some asshole.",
		"id": "3qys3j",
		"score": 3219,
		"title": "Life is a lot like toilet paper."
	}, {
		"body": "\"Because we conceived her in Paris.\"   \"Ahh, thanks Dad! \"   \"You're welcome, Backseat.\"",
		"id": "4ivpih",
		"score": 3210,
		"title": "\"Dad, why is my sister called Paris?\""
	}, {
		"body": "I'm never using cheap toilet paper again.",
		"id": "2fwqp6",
		"score": 3207,
		"title": "I got in touch with my inner self today."
	}, {
		"body": "HDMI",
		"id": "48zbet",
		"score": 3207,
		"title": "What did Yoda say when he watched Star Wars on Blu-Ray?"
	}, {
		"body": "Because you'd make a spectacle of yourself.",
		"id": "2v3oxt",
		"score": 3205,
		"title": "Why do you never wear two monocles at the same time?"
	}, {
		"body": "It had four Chapter 11's. ",
		"id": "5rcmz3",
		"score": 3186,
		"title": "I just read Trump's book \"The Art of the Deal\""
	}, {
		"body": "It didn't protect him from harmful rays  Edit: Steve Irwin was the man. RIP",
		"id": "2f1pn4",
		"score": 3183,
		"title": "Why did Steve Irwin's sunscreen get recalled?"
	}, {
		"body": "Today i asked a pretty young homeless women if i could take her home, and she said yes with a big smile.  The look on her face soon changed when i walked off with her cardboard box.",
		"id": "4omfwd",
		"score": 3164,
		"title": "I met a pretty girl."
	}, {
		"body": "2, 3, 5, 7 and 11 are the prime suspects. ",
		"id": "4ctcs5",
		"score": 3154,
		"title": "4, 6, 8 and 9 have all been killed."
	}, {
		"body": "She seemed surprised.",
		"id": "4dcwy2",
		"score": 3152,
		"title": "I told my girlfriend she drew her eyebrows too high."
	}, {
		"body": "To avoid being confused with feminists.",
		"id": "50gzxg",
		"score": 3138,
		"title": "Why do sumo wrestlers shave their legs?"
	}, {
		"body": "Non Prophet Organizations ",
		"id": "2zmfrn",
		"score": 3135,
		"title": "Where do atheists donate their money?"
	}, {
		"body": "...one was drinking battery acid, the other was eating fireworks.  They charged one – and let the other one off.",
		"id": "2wtfw3",
		"score": 3133,
		"title": "Police arrested two kids yesterday..."
	}, {
		"body": "like my name, phone number, address, etc.",
		"id": "3rzc5c",
		"score": 3128,
		"title": "Ever since my girlfriend got pregnant, a lot has changed..."
	}, {
		"body": "\"Honk if you think I'm sexy.\"  Then I wait at green lights till I feel better about myself.",
		"id": "25ucx8",
		"score": 3128,
		"title": "I have a bumper sticker that says..."
	}, {
		"body": "They both wanna get there before the hare does.",
		"id": "51hqrl",
		"score": 3120,
		"title": "What does a pedophile and a turtle have in common?"
	}, {
		"body": "Me: This is my girlfriend Jane  Jane: Hi  Wife: What the fuck",
		"id": "50ks52",
		"score": 3113,
		"title": "Introducing my girlfriend to the family"
	}, {
		"body": "Guess I won't be needing those anymore.",
		"id": "4yu7xm",
		"score": 3104,
		"title": "My wife said she is leaving me because of my addiction to anti-depressants..."
	}, {
		"body": "Is how cold the mirror feels on your lips.",
		"id": "2pxw6w",
		"score": 3100,
		"title": "The problem with kissing a perfect 10"
	}, {
		"body": "With Twitter you only get 140 characters. ",
		"id": "1cq2lu",
		"score": 3095,
		"title": "What is the difference between Game of Thrones and Twitter?"
	}, {
		"body": "Sorry, my fault.",
		"id": "2743by",
		"score": 3094,
		"title": "What did the tectonic plate say to the other tectonic plate when he bumped into the him?"
	}, {
		"body": "None. \"He fell\".",
		"id": "5rjsqw",
		"score": 3093,
		"title": "How many police officers does it take to push a black man down the stairs?"
	}, {
		"body": "It's just that men are better at it like everything else.",
		"id": "4qrew1",
		"score": 3088,
		"title": "Women can be sexist too"
	}, {
		"body": "It's where I turn your mom upside down.",
		"id": "2mmdns",
		"score": 3084,
		"title": "My new favorite sex position is called \"wow\"."
	}, {
		"body": "For example \"Ben is in a hurry.\" \"Ben is in a coma.\"",
		"id": "52k5ta",
		"score": 3076,
		"title": "Comas can really change the meaning of a sentence.."
	}, {
		"body": "I recently slept with a girl and after sex she was like \"I'm Fifteen\" I was like that's nice I'm Daniel.",
		"id": "5094vt",
		"score": 3069,
		"title": "What's with girls having weird names nowadays?"
	}, {
		"body": "I can't even finish a sentence without it coming up with other suggestions.",
		"id": "2krzjw",
		"score": 3065,
		"title": "Is Google a woman?"
	}, {
		"body": "Most of them run away after being called father once or twice",
		"id": "4zvqls",
		"score": 3055,
		"title": "Why is the number of black priests so small?"
	}, {
		"body": "\"It's not working. I can't take it anymore. I am going to my mom's place.\"  I opened the fridge. The light came on. The beer was cold... What the hell did she mean?",
		"id": "3vbgei",
		"score": 3054,
		"title": "My girlfriend left a note on the fridge"
	}, {
		"body": "I'm not included in anything either.",
		"id": "3utpnh",
		"score": 3054,
		"title": "I can totally relate to batteries"
	}, {
		"body": "Dear 6,  Please stop spreading rumors about me eating 9. You shouldn't be talking. I hear you two do some pretty nasty things together.  Sincerely, 7",
		"id": "3fjhrm",
		"score": 3033,
		"title": "Letter from 7 to 6"
	}, {
		"body": "Earth, most likely. Unless he's personally interested in space exploration, in which case he might say Mars.",
		"id": "3izq15",
		"score": 3021,
		"title": "What's a gay man's favorite planet?"
	}, {
		"body": "For hispanic attacks  Edit: Happy Cinco de Mayo",
		"id": "4i340f",
		"score": 3009,
		"title": "Why does the Mexican guy take xanax?"
	}, {
		"body": "A person in another room said, \"How do you know?\" The first patient said, \"God told me!\" Just then, a voice from another room shouted,  \"I did not!\"",
		"id": "2jidsf",
		"score": 3002,
		"title": "Late one night at the insane asylum one patient shouted, \"I am Napoleon!\""
	}, {
		"body": "Because then I would know she is capable of making decisions she will regret in the future. ",
		"id": "4z7kwj",
		"score": 3002,
		"title": "I always look for a woman who has a tattoo."
	}, {
		"body": "Because he was a neck-romancer....",
		"id": "4vbn0i",
		"score": 2975,
		"title": "Why did the wizards wife have hickeys on her neck?"
	}, {
		"body": "Me",
		"id": "2h4a25",
		"score": 2971,
		"title": "My girlfriend has the hottest ass in the world."
	}, {
		"body": "because they like the taste of defeat.  i'm not even sorry.",
		"id": "46vvbr",
		"score": 2955,
		"title": "why don't foot fetishists ever win anything?"
	}, {
		"body": "That takes the number of girls I've made wet this year to -1.",
		"id": "4v500o",
		"score": 2953,
		"title": "I lent a hot girl my umbrella yesterday."
	}, {
		"body": "I’d have $ 6.30 now  ",
		"id": "51jwb0",
		"score": 2952,
		"title": "If I got 50 cents for every failed math exam"
	}, {
		"body": "They said that couldn't do anything about crows and to stop calling. ",
		"id": "49ths1",
		"score": 2947,
		"title": "I called the cops about a murder on my front lawn and they just hung up."
	}, {
		"body": "A Swallow.",
		"id": "1ggjmg",
		"score": 2946,
		"title": "If a stork brings white babies, and a blackbird black babies, what bird brings no babies?"
	}, {
		"body": "But the wife had to break it to me that it was actually for \"dyslexia\".",
		"id": "22j25l",
		"score": 2880,
		"title": "My doctor wrote me a prescription for \"dailysex\"..."
	}, {
		"body": "I think my family takes monopoly way too seriously",
		"id": "4nzseb",
		"score": 2877,
		"title": "I almost got raped in jail"
	}, {
		"body": "Hulk's dick in your mouth.",
		"id": "3a0w05",
		"score": 2874,
		"title": "You have a green ball in your left hand and a green ball in your right hand, so what do you have?"
	}, {
		"body": "So my Mom explained that was silly, because they're much more scared of me. ",
		"id": "534k31",
		"score": 2868,
		"title": "I used to be scared of pretty girls,"
	}, {
		"body": "I mow grass at a cemetery. ",
		"id": "4drsc1",
		"score": 2863,
		"title": "At my new job I have 500 people under me."
	}, {
		"body": "plagiarism.",
		"id": "277604",
		"score": 2862,
		"title": "I just invented a new word:"
	}, {
		"body": "He was always coming in a little behind.",
		"id": "3pg6tq",
		"score": 2856,
		"title": "Did you hear about the pedophile that never could win a race?"
	}, {
		"body": "It's a riot",
		"id": "347lfk",
		"score": 2834,
		"title": "Did you hear the latest joke about Baltimore?"
	}, {
		"body": "\"Yes, David, how can we help you?\"",
		"id": "3z4yml",
		"score": 2830,
		"title": "\"Hello, is this anonymous NSA hotline?\""
	}, {
		"body": "Not me I live next to 2 smoking hot 8 year olds",
		"id": "51ruk1",
		"score": 2822,
		"title": "They say 1 in 3 people live next to a pedophile"
	}, {
		"body": "Because XD",
		"id": "2qd0ne",
		"score": 2820,
		"title": "Why are 490 Romans funny?"
	}, {
		"body": "username checks out.",
		"id": "4x7yra",
		"score": 2814,
		"title": "/u/username goes to the grocery store...."
	}, {
		"body": "With all the bad puns going around, I had to draw the line somewhere.",
		"id": "4n1el8",
		"score": 2812,
		"title": "________________________"
	}, {
		"body": "that she knows of.",
		"id": "5sv7l4",
		"score": 2810,
		"title": "Fun fact: Betsy Devos' name contains every letter of the alphabet"
	}, {
		"body": "...and those flashing lights on your car look stupid.",
		"id": "37nfrd",
		"score": 2808,
		"title": "There's no reason to be tailgating me when I'm doing 50 in a 35..."
	}, {
		"body": "Pinocchio: Yep",
		"id": "51avtn",
		"score": 2804,
		"title": "Voldemort: So I just have to lie?"
	}, {
		"body": "Cus you repeat the same stupid shit over and over",
		"id": "3o8ntt",
		"score": 2793,
		"title": "Damn girl, are you reddit?"
	}, {
		"body": "She takes no notice of my existence till she wants something.",
		"id": "1z3yrc",
		"score": 2787,
		"title": "My wife treats me like GOD!!"
	}, {
		"body": "None. They like to keep their subscribers in the dark.",
		"id": "4ntw0m",
		"score": 2781,
		"title": "How many /r/news mods does it take to screw in a lightbulb?"
	}, {
		"body": "On my lap. Turned on. Virus free.",
		"id": "5qosgr",
		"score": 2777,
		"title": "I like my women how I like my computer."
	}, {
		"body": "All of a sudden chicks in my area are no longer interested in me.",
		"id": "53gjxi",
		"score": 2776,
		"title": "Ever since I installed Adblocker Plus things haven't been going so well.."
	}, {
		"body": "is sharing it with people who don't.",
		"id": "5qjduh",
		"score": 2775,
		"title": "The best thing about having a penis..."
	}, {
		"body": "And why did he paint so many pictures of my parents fighting?  -Rob DenBleyker",
		"id": "208tuc",
		"score": 2767,
		"title": "Who is this Rorschach guy???"
	}, {
		"body": "huh, well would you look at that. It was a tie",
		"id": "4za8oh",
		"score": 2762,
		"title": "And the award for best neckwear goes to..."
	}, {
		"body": "With a small million dollar loan from his father. ",
		"id": "44ng2q",
		"score": 2762,
		"title": "How do you start a racist joke?"
	}, {
		"body": "Now I have $2,999,999.75 and she has $.25 ",
		"id": "4xfbna",
		"score": 2741,
		"title": "I won $3 million on the Lottery this weekend. I decided to donate a quarter of it to Charity."
	}, {
		"body": "I still do, but I used to too.",
		"id": "4uqk4g",
		"score": 2730,
		"title": "I used to steal Mitch Hedberg jokes and try to pass them off as my own."
	}, {
		"body": "Short",
		"id": "2uvts1",
		"score": 2730,
		"title": "Grandpa joke: What becomes shorter when you add 2 letters?"
	}, {
		"body": "But I still wish she didn't have one at all. ",
		"id": "4vd2cz",
		"score": 2721,
		"title": "My Girlfriend assured me that a small penis should never be an issue in a loving relationship.."
	}, {
		"body": "It exists thanks to gullible six year olds",
		"id": "3y392k",
		"score": 2707,
		"title": "My love life is like Santa Claus."
	}, {
		"body": " I didn't get pulled over or anything, I just showed up to work 20 minutes early.",
		"id": "52prsl",
		"score": 2702,
		"title": "I definitely learned my lesson about speeding today and it will never happen again."
	}, {
		"body": "It would be a shame if someone put an 's' at the start and an 'e' at the end...",
		"id": "5qt51s",
		"score": 2699,
		"title": "That's a nice ham you have there"
	}, {
		"body": "... and stays there my entire childhood.",
		"id": "53eemu",
		"score": 2697,
		"title": "A man walks into a bar"
	}, {
		"body": " Ask your mother.",
		"id": "28mzkh",
		"score": 2697,
		"title": "Which sexual position produces the ugliest children?"
	}, {
		"body": "Now I'm Muslim and we're stoning her tomorrow.",
		"id": "4k2r31",
		"score": 2695,
		"title": "When I found out my wife was having an affair, I was heartbroken. I turned to religion to cope."
	}, {
		"body": "The High Five",
		"id": "4odf6x",
		"score": 2690,
		"title": "What would you call the Fantastic Four if Snoop Dogg joined the team?"
	}, {
		"body": "one is heavy, and the other is a little lighter. ",
		"id": "4ycyf2",
		"score": 2690,
		"title": "what is the difference between a hippo and a Zippo?"
	}, {
		"body": "This Valentines day, I asked a Chinese girl for her number.  She said, \"Sex! Sex! Sex! Free Sex tonight!\"  I said, \"Wow!\"  Then her friend said, \"She means 666-3629.\"",
		"id": "2wf9b1",
		"score": 2682,
		"title": "For a moment, i had a different opinion on 'Chinese girls'"
	}, {
		"body": "if architects in those days had just made their towns big enough for everyone. ",
		"id": "32gsjq",
		"score": 2678,
		"title": "I believe a lot of conflict in the Wild West could have been avoided completely"
	}, {
		"body": "What's in the wardrobe?  Narnia business.",
		"id": "20sd1i",
		"score": 2672,
		"title": "I made this joke up when I was eight. I'm very proud of it."
	}, {
		"body": "that nobody loves you on any other day of the year, and valentine's day shouldn't be any different.",
		"id": "5tvmfk",
		"score": 2666,
		"title": "If any of you are sad about being alone on valentines day, just remember..."
	}, {
		"body": "Feyoncè",
		"id": "1bjx97",
		"score": 2657,
		"title": "What did Jay-Z call his girlfriend before getting married?"
	}, {
		"body": "Crust",
		"id": "4szmco",
		"score": 2652,
		"title": "What tastes good on pizza but not on pussy?"
	}, {
		"body": "Apparently the politically correct term is \"Tyrone, please paint the fence\".",
		"id": "3qu3hu",
		"score": 2644,
		"title": "Someone called me racist for saying \"black paint\""
	}, {
		"body": "1272AD - Arab Muslims invent the first condoms using the lower intestine of goats.  1856AD - English farmers improve on the idea by first removing the intestine from the goat.",
		"id": "3ijtis",
		"score": 2629,
		"title": "Condoms"
	}, {
		"body": "A small chest with no booty. ",
		"id": "261f4m",
		"score": 2629,
		"title": "Since We're Doing Pirate Jokes. What Does Every Pirate Hate?"
	}, {
		"body": "I opened up the fridge. The light was on and the beer was cold. I'm not sure what she was talking about.",
		"id": "4r4zgm",
		"score": 2625,
		"title": "My wife left a note on the fridge that said \"This isn't working I'm going to my mom's\""
	}, {
		"body": "it was a risk I was willing to take ",
		"id": "22sboz",
		"score": 2623,
		"title": "I almost got caught trying to steal a board game yesterday"
	}, {
		"body": "When the punchline becomes apparent.",
		"id": "53jzjd",
		"score": 2610,
		"title": "When does a joke become a dad joke?"
	}, {
		"body": " is as bad as the last two you heard combined",
		"id": "53k9dr",
		"score": 2610,
		"title": "This fibonacci joke"
	}, {
		"body": "Your spine  Edit: Thanks guys, made it to the front page. Was my first joke and ~~penis~~ spine joke on Reddit. ",
		"id": "4vjlm8",
		"score": 2599,
		"title": "What's long, hard and bendable and contains the letters p, e, n, i, s?"
	}, {
		"body": "I got charged with impersonating a Police Officer.",
		"id": "4p42it",
		"score": 2591,
		"title": "I shot a Black Man the other day"
	}, {
		"body": "Because 7 is a registered 6 offender.",
		"id": "304rf4",
		"score": 2589,
		"title": "Why is 6 afraid of 7?"
	}, {
		"body": "None. We don't address hardware issues.",
		"id": "1xwd22",
		"score": 2581,
		"title": "How many programmers does it take to screw in a lightbulb?"
	}, {
		"body": "It really brings out the kid in you",
		"id": "3wi76h",
		"score": 2576,
		"title": "Abortions are so fun"
	}, {
		"body": "....But it's not a very good one.   :(",
		"id": "2fgx7o",
		"score": 2572,
		"title": "I have an inferiority complex"
	}, {
		"body": "",
		"id": "2nmcnq",
		"score": 2567,
		"title": "Knock knock"
	}, {
		"body": "It reminds me of why there is no fucking money in there. ",
		"id": "1erj69",
		"score": 2567,
		"title": "I always carry a picture of my wife and kids in my wallet."
	}, {
		"body": "remove the ring and your house is gone!",
		"id": "3ejxsh",
		"score": 2566,
		"title": "A wife is like a hand grenade..."
	}, {
		"body": "I'm so happy things were able to stay the same.",
		"id": "3c1wvj",
		"score": 2565,
		"title": "[META] Ever since the sub returned, it's become a hive of circlejerking, reposts, and bad quality."
	}, {
		"body": "Because the rest of the letters are not-E.",
		"id": "3sr4ht",
		"score": 2564,
		"title": "Why was E the only letter in the alphabet to get Christmas presents?"
	}, {
		"body": "I went to my first fight club meeting last night, i showed up late so i missed the first few rules but it was awesome i love fight club cant wait for the next meeting﻿",
		"id": "4eqzbh",
		"score": 2560,
		"title": "fight club"
	}, {
		"body": "He didn't *actually* say that I but I know he was thinking it.",
		"id": "2xkh1h",
		"score": 2549,
		"title": "My therapist says I'm paranoid."
	}, {
		"body": "I support killing babies, but I don't support giving women a choice.",
		"id": "4aeppw",
		"score": 2548,
		"title": "I'm really conflicted about abortion."
	}, {
		"body": "Now we just call him Dav",
		"id": "4w9x1s",
		"score": 2533,
		"title": "My mate David was a victim of ID theft"
	}, {
		"body": "Damn dial-up!",
		"id": "5ru9y9",
		"score": 2529,
		"title": "When I see a girl, I first look at her hair. Then at her eyes, lips, neck..."
	}, {
		"body": "\"Meeeeee!\"  I wrote this.   I'm now a comedy writer.  You are welcome. ",
		"id": "4mk636",
		"score": 2522,
		"title": "What does the narcissistic cow say?"
	}, {
		"body": "You get your palm red for free.",
		"id": "243zvz",
		"score": 2517,
		"title": "What's the best thing about fingering a gypsy on her period?"
	}, {
		"body": "Then he threw me off the roof.",
		"id": "1va1gj",
		"score": 2516,
		"title": "My physics teacher told me I had potential."
	}, {
		"body": "An unawarewolf.",
		"id": "5rdkzs",
		"score": 2510,
		"title": "What do you call a werewolf that doesn't know he's a werewolf?"
	}, {
		"body": "Teach a man to jack it and he'll never go outside again. ",
		"id": "3t6rae",
		"score": 2509,
		"title": "Give man a jacket and he'll be warm when he goes outside."
	}, {
		"body": "Luckily for him I was still up playing my bagpipes",
		"id": "1to3ix",
		"score": 2508,
		"title": "My neighbour knocked on my door at 2:30am...Can you believe that, 2:30am!?"
	}, {
		"body": "\"Sir, we are mining too many useless ores\"  [Hitler rubs chin]  \"So mine less\"  [Grammar Nazi bursts through the door]  \"MINE FEWER!\"  [Hitler looks up]  \"Yes?\"",
		"id": "4ajl8f",
		"score": 2504,
		"title": "Hitler on mining"
	}, {
		"body": "Wait, sorry. That came out wrong.  I'm giving up. Alcohol for a month.",
		"id": "4ht4jq",
		"score": 2503,
		"title": "I'm giving up alcohol for a month...."
	}, {
		"body": "Joke's on them, so are they!  Edit: ermagerd front page!",
		"id": "4iojll",
		"score": 2501,
		"title": "All my friends keep saying that my new girlfriend is imaginary..."
	}, {
		"body": "Eh... Nevermind. You probably won't get it.",
		"id": "2j405n",
		"score": 2493,
		"title": "Have you heard my joke about the Ebola outbreak yet?"
	}, {
		"body": "like how she got a job right out of college.",
		"id": "43c56o",
		"score": 2492,
		"title": "I really wish some of the fantasies in 50 shades of grey were real..."
	}, {
		"body": "It was at that moment I decided I'd never visit Thailand again.",
		"id": "4vhdn2",
		"score": 2489,
		"title": "\"It's a boy!\" I shouted, tears rolling down my face. \"I don't believe it. A boy!\""
	}, {
		"body": "You don't milk a cow for 10 years",
		"id": "2ka3av",
		"score": 2486,
		"title": "What's the difference between 9/11 and a cow?"
	}, {
		"body": "He doesn't want to be spotted",
		"id": "3nn474",
		"score": 2484,
		"title": "Why does Waldo wear stripes?"
	}, {
		"body": " The doctor described his condition as stable. ",
		"id": "2vlfk0",
		"score": 2481,
		"title": "A man was hospitalized with 6 plastic horses up his ass………."
	}, {
		"body": "He'd be 0K.",
		"id": "4x8hhh",
		"score": 2477,
		"title": "You can freeze a human to -273.15 C"
	}, {
		"body": "Once he stopped laughing he wrote me up for indecent exposure ",
		"id": "4yt3vf",
		"score": 2471,
		"title": "The other day I got pulled over, and when the cop walked up I pulled out my 9mm"
	}, {
		"body": "Ask them to pronounce the word, \"unionized\".",
		"id": "2ixtkq",
		"score": 2470,
		"title": "How do you tell the difference between an electrician and an electrical engineer?"
	}, {
		"body": "Because he is the Supreme Reader.",
		"id": "4f1g49",
		"score": 2457,
		"title": "Why does Kim Jong Un love books?"
	}, {
		"body": "Because no church wants to be challenged by an invisible power that actually works.",
		"id": "5sdtm8",
		"score": 2453,
		"title": "Why is free Wi-Fi never seen in churches?"
	}, {
		"body": "They are not gonna like it.",
		"id": "4sm53c",
		"score": 2450,
		"title": "Me and my wife, we have decided that we don't want kids."
	}, {
		"body": "Let's Imax and climax",
		"id": "3tugew",
		"score": 2447,
		"title": "Hey baby, forget Netflix and chill"
	}, {
		"body": "Professor +  I'm sorry. lol.",
		"id": "376jj2",
		"score": 2444,
		"title": "What do you call Professor X doing a wheelie?"
	}, {
		"body": "Nobody knows, the never get to keep the house.",
		"id": "2vvuz3",
		"score": 2430,
		"title": "How many divorced men does it take to screw in a light bulb?"
	}, {
		"body": "Don't worry, they'll repost a joke about it.",
		"id": "34y0j8",
		"score": 2430,
		"title": "How can you tell someone hates vegans, cross fitters, and atheists?"
	}, {
		"body": "She told me she's been having sex with an asshole for years.",
		"id": "5qcjqz",
		"score": 2421,
		"title": "I told my wife I wanted to try anal sex"
	}, {
		"body": "... has members all around the globe",
		"id": "5s7t9b",
		"score": 2417,
		"title": "the flat earth society ..."
	}, {
		"body": "The lightbulb is fine the way it is. Society just needs to change the way it looks at it.  Edit: Wow front page. Didn't expect this big a response. ",
		"id": "254og6",
		"score": 2416,
		"title": "How many LGBT supporters does it take to change a lightbulb?"
	}, {
		"body": "A woman wants one man to satisfy her every need. A man wants every woman to satisfy his one need.",
		"id": "5r8l4y",
		"score": 2415,
		"title": "What is the difference between men and women?"
	}, {
		"body": "..and the old man turns to it and says: \"Would you at last admit it that we are lost?\"",
		"id": "2cilut",
		"score": 2414,
		"title": "So there was a stork carrying an old man.."
	}, {
		"body": "I will keep you posted.",
		"id": "1u8cvh",
		"score": 2414,
		"title": "I've just ordered a chicken and an egg from Amazon......."
	}, {
		"body": "Air Hostess to passenger:  \"Sir would you like to have dinner?\"  Passenger: \"What are the options?\"  Air Hostess: \"Yes and No.\"",
		"id": "46pfd7",
		"score": 2410,
		"title": "What are the options?"
	}, {
		"body": "Oh shit wrong sub-reddit.",
		"id": "2boc6w",
		"score": 2410,
		"title": "How do you tell if someone has an std?"
	}, {
		"body": "He went ice Skating before it was cool ",
		"id": "21hsw5",
		"score": 2403,
		"title": "Why did the hipster drown?"
	}, {
		"body": "",
		"id": "3p7fyo",
		"score": 2402,
		"title": "How Long is a Chinese name."
	}, {
		"body": "",
		"id": "2dodop",
		"score": 2401,
		"title": "A farmer in the field with his cows counted 196 of them, but when he rounded them up he had 200."
	}, {
		"body": "Patrick Fitzgerald and Gerald Fitzpatrick",
		"id": "4dvt5j",
		"score": 2392,
		"title": "What do you call two gay Irish men?"
	}, {
		"body": "What type of sandwich would you make?",
		"id": "53cpdo",
		"score": 2389,
		"title": "If Trump and Hillary are both drowning and you could only save one..."
	}, {
		"body": "\"Please get out of the pool\" ",
		"id": "21egqu",
		"score": 2384,
		"title": "How do you get 30 drunk Canadians out of the pool?"
	}, {
		"body": "Satisfying.",
		"id": "2oklua",
		"score": 2375,
		"title": "How did the farmer find the sheep in the tall grass?"
	}, {
		"body": "\"You have the biggest penis out of all your friends\" replies the wife.",
		"id": "3lf9s8",
		"score": 2368,
		"title": "A man bets his wife she can't tell him something that will make him happy and sad at the same time."
	}, {
		"body": "But not eating too much pie, because the sin of pi is always zero.",
		"id": "3igimx",
		"score": 2358,
		"title": "Eating too much cake is the deadly sin of gluttony"
	}, {
		"body": "good thing it was in airplane mode.",
		"id": "5tbuk3",
		"score": 2356,
		"title": "My phone fell from the 20th floor,"
	}, {
		"body": "Opened it up and there was a picture of two men holding hands. ",
		"id": "38mzks",
		"score": 2354,
		"title": "I bought a Russian porno magazine the other day called Barely Legal."
	}, {
		"body": "...is that I would also date Ivanka if she wasn't his daughter. ",
		"id": "4vhw85",
		"score": 2351,
		"title": "The only thing that Trump and I can agree on..."
	}, {
		"body": "I hope it's Michael. Hes cute.",
		"id": "3zsk97",
		"score": 2348,
		"title": "Someone told me there's a gay guy in my circle of friends..."
	}, {
		"body": "A rock musician plays 3 chords for 20,000 people, and a jazz musician plays 20,000 chords for 3 people",
		"id": "5rrhl1",
		"score": 2344,
		"title": "What's the difference between a rock musician and a jazz musician?"
	}, {
		"body": "...I'm getting a really good deal on this car.",
		"id": "1c9ix1",
		"score": 2338,
		"title": "As I was paying for a 15 year old escort I thought..."
	}, {
		"body": "A hockey player showers after three periods!^I^will^see^myself^out^now",
		"id": "49qzb2",
		"score": 2330,
		"title": "What is the difference between a feminist and a hockey player?"
	}, {
		"body": "Because the teacher said it was a piece of cake.  -My 6 year old Nephew ",
		"id": "4s3fao",
		"score": 2329,
		"title": "Why did the kid eat his homework?"
	}, {
		"body": "The father says \"It means 'to be happy.\" The son asks \"Are you [gay!](http://www.afterfeed.com/)?\" The father says \"No, son. I have a wife.\"",
		"id": "518eif",
		"score": 2325,
		"title": "A kid asks his Dad \"what does 'gay' mean?\""
	}, {
		"body": "An oncologist!   ...   I made this one up last night but I'm sure someone has thought of it before.",
		"id": "2dhkin",
		"score": 2322,
		"title": "What kind of doctor is always on call?"
	}, {
		"body": "As he jumped down he sneered at me and I thought, well that’s a little condescending.",
		"id": "5t8q13",
		"score": 2316,
		"title": "There was a prison break and I saw a midget climb up the fence."
	}, {
		"body": "...so I got drunk.",
		"id": "504kz6",
		"score": 2314,
		"title": "My girlfriend told me to go out and get something that makes her look sexy..."
	}, {
		"body": "The librarian said \"That rings a bell but I don't know if it's here or not.\"",
		"id": "3qkd6g",
		"score": 2313,
		"title": "I went to the library and asked for a book on Pavlov's dog and Shrodinger's Cat"
	}, {
		"body": "HAAAAAAAAAAAAAAAAAND EEEEEEEEEEEEEEEEEYEEEEEEEEE",
		"id": "2502pf",
		"score": 2312,
		"title": "What's Whitney Houston's favorite type of coordination?"
	}, {
		"body": "Sounds funny.  Dozen tit.",
		"id": "3w9bvs",
		"score": 2312,
		"title": "I once met a girl with 12 nipples..."
	}, {
		"body": "That is the last time I sleep with my mouth open on the subway!",
		"id": "4sfpa5",
		"score": 2312,
		"title": "I had never woken up to a blowjob before"
	}, {
		"body": "So Yung... ",
		"id": "430uif",
		"score": 2307,
		"title": "My Korean friend died yesterday"
	}, {
		"body": "Because I want to drop a baby in you. ",
		"id": "4nfsoa",
		"score": 2302,
		"title": "Are You a Gorilla Exhibit?"
	}, {
		"body": "The flavor gets stronger as you get closer to the butt. ",
		"id": "4o4vlv",
		"score": 2302,
		"title": "What does smoking a cigarette and eating a pussy have in common? [NSFW]"
	}, {
		"body": "A compliment in America, an argument in the middle east.",
		"id": "4p3cvq",
		"score": 2293,
		"title": "\"You the bomb!\" \"No you the bomb!\""
	}, {
		"body": "\"I told you not to call me mom in front of people\"",
		"id": "4r0xbp",
		"score": 2290,
		"title": "Mom, am I ugly?"
	}, {
		"body": "What they reveal is suggestive, but what they conceal is vital.   Edit- This is a famous quote by Aaron Levenstein. A Professor told this to a friend.",
		"id": "2hgdlb",
		"score": 2289,
		"title": "Statistics are like bikinis."
	}, {
		"body": "But look at Albert Einstein – he was a drop-out and still ended up being the first man on the moon!",
		"id": "5rew51",
		"score": 2285,
		"title": "They say you can’t get a decent job without education."
	}, {
		"body": "He can binomial.",
		"id": "4y7m82",
		"score": 2282,
		"title": "I know a mathematician who can't afford lunch."
	}, {
		"body": "At least, I assume she was poor. She only had $4.75 in her purse.",
		"id": "3ijgl5",
		"score": 2282,
		"title": "Today I saw a poor, old woman trip and fall."
	}, {
		"body": "That's Remarkable!  Terrible joke, came to me on the toilet early, but I had to say it. And it's also likely be told in some form before.",
		"id": "1dlzui",
		"score": 2281,
		"title": "What did people say when the inventor of the Dry Erase Board showed off his new invention."
	}, {
		"body": "Canabananalism  EDIT: Thanks for all the support, only my second reddit post and I'm surprised this got as many upvote a as it did!",
		"id": "2y1yb3",
		"score": 2281,
		"title": "What do you call it when a banana eats another banana?"
	}, {
		"body": "-1",
		"id": "2e6jav",
		"score": 2281,
		"title": "How many blacks does it take to start a riot?"
	}, {
		"body": "Jesus: The what?? Judas: The supper.. we´re gonna be late for supper.",
		"id": "50gimk",
		"score": 2279,
		"title": "Judas: C´mon Jesus we´re gonna be late for last supper"
	}, {
		"body": "On my last two dates the woman has sprayed me with perfume before we had sex. I can't quite place the brand but it had a distinct sharp peppery smell. ",
		"id": "3hg8rt",
		"score": 2275,
		"title": "I'm starting to get self-conscious about my body odour..."
	}, {
		"body": "\"Are you fucking serious?!\" asks Ron.  \"Yeah...that too,\" says Harry.",
		"id": "26qpdn",
		"score": 2271,
		"title": "Harry Potter and Ron Weasley are talking. Harry says, \"Ron, I'm gay.\""
	}, {
		"body": "That's not funny",
		"id": "1kf43a",
		"score": 2268,
		"title": "How many feminists does it take to screw in a light bulb?"
	}, {
		"body": "Virgin Mobile    ",
		"id": "2niwip",
		"score": 2268,
		"title": "What do you call a nun in a wheelchair"
	}, {
		"body": "Guess I should've noticed the red flags earlier",
		"id": "5qv5yg",
		"score": 2267,
		"title": "Just found out I was dating a commie"
	}, {
		"body": "Because in charge of scheduling, Yoda was.",
		"id": "33em1a",
		"score": 2263,
		"title": "Why were Star Wars Episodes 4, 5, and 6 released before 1, 2, and 3?"
	}, {
		"body": "\"Well, I fucked that one up.\"",
		"id": "4mror4",
		"score": 2261,
		"title": "What did Mario say when he found out he got drunk and had sex with a green mushroom?"
	}, {
		"body": "Hogwarts.",
		"id": "26cnwe",
		"score": 2261,
		"title": "What do Harry Potter and Kermit the Frog's penis have in common?"
	}, {
		"body": "So I had her repost a joke for me that's been posted 5,000 times in the past week",
		"id": "3q6ty7",
		"score": 2259,
		"title": "Met a hooker who said she'd do anything for $5"
	}, {
		"body": "It was the hardest day of my life.",
		"id": "2ghmnq",
		"score": 2258,
		"title": "I overdosed on Viagra once."
	}, {
		"body": "I don't know and I don't care.",
		"id": "4m4jt3",
		"score": 2256,
		"title": "What's is the difference between ignorance and negligence?"
	}, {
		"body": "To get to the other side.",
		"id": "1s260y",
		"score": 2255,
		"title": "Why did the Jedi kill his master?"
	}, {
		"body": "He asks \"what seems to be the problem, officer?\", and the cop responds, \"oh, nothing.\"  EDIT: Weee, this is my first time on the front page.",
		"id": "40pzn7",
		"score": 2253,
		"title": "A man gets pulled over by a female cop."
	}, {
		"body": "Because Ken came in a different box.  Badum tiss.",
		"id": "1rdxt4",
		"score": 2252,
		"title": "Why did Barbie never get pregnant?"
	}, {
		"body": "A Marxman",
		"id": "5sm6hr",
		"score": 2243,
		"title": "What do you call a Communist sniper?"
	}, {
		"body": "But it wasn't until I spanked a statue that I realised I'd hit rock bottom.",
		"id": "29n68j",
		"score": 2243,
		"title": "Over the past year, my sexual fetishes have been slowly getting more perverse."
	}, {
		"body": "Trust me. My friend Keith did it once and he said he was going to die and then he did.",
		"id": "4xvlle",
		"score": 2239,
		"title": "Did you know if you drink the fluid from a magic 8 ball you can see the future."
	}, {
		"body": "A Chinese telephone.      Wing wing.  Arrow?   ",
		"id": "4u73u0",
		"score": 2228,
		"title": "What has TWO wings, and ONE arrow?"
	}, {
		"body": "Cold on the outside, warm on the inside, and willing and able to kill any baby I put inside them.",
		"id": "4ysjv9",
		"score": 2227,
		"title": "I like my women like I like my microwaves..."
	}, {
		"body": "Sure, there's plenty of fish in the sea. But until i catch one, I'm just stuck here holding my rod.",
		"id": "4wjnmu",
		"score": 2225,
		"title": "Dating is a lot like fishing"
	}, {
		"body": "Well nobody is laughing now.",
		"id": "4vm026",
		"score": 2224,
		"title": "People use to laugh at me when I would say \"I want to be a comedian\""
	}, {
		"body": "Little Caesars.       ...I'll see myself out. ",
		"id": "1gdn1g",
		"score": 2222,
		"title": "What do Mexicans use to cut their pizza?"
	}, {
		"body": "[removed]",
		"id": "2s061j",
		"score": 2219,
		"title": "A moderator walks into a bar..,"
	}, {
		"body": "The police are pretty sure it's race related.",
		"id": "5qccee",
		"score": 2215,
		"title": "A man has been shot with a starting pistol..."
	}, {
		"body": "Your ears",
		"id": "23ogp4",
		"score": 2210,
		"title": "What is the most sensitive part of your body when masturbating?"
	}, {
		"body": "That's the only way I'll ever get into medical school.",
		"id": "4a8khc",
		"score": 2209,
		"title": "When I die I'm going to donate my body to science."
	}, {
		"body": "Because Africa isn't a country.",
		"id": "4wsxxx",
		"score": 2208,
		"title": "Why hasn't Africa ever won Olympic gold in basketball?"
	}, {
		"body": "I hate everyone elses but for some weird reason I like my own.",
		"id": "3283r1",
		"score": 2203,
		"title": "Kids are like farts..."
	}, {
		"body": "Angel Martinez, currently serving 16 years.",
		"id": "4sga7l",
		"score": 2194,
		"title": "When I was 9, I was touched by an Angel."
	}, {
		"body": "but it was two week",
		"id": "4opavm",
		"score": 2193,
		"title": "Tried changing my password to \"14days\""
	}, {
		"body": "... then plug me back in. See if that works.",
		"id": "1gfine",
		"score": 2193,
		"title": "If I am ever on life support, unplug me ..."
	}, {
		"body": "Personally, I think Europe is the stupidest country in the world.",
		"id": "40vc33",
		"score": 2193,
		"title": "I'm American and I'm sick of people saying America is the stupidest country in the world..."
	}, {
		"body": "They enter your life wet and wild, and they leave with your lawn furniture THAT WE BOUGHT TOGETHER SARAH, YOU BITCH.",
		"id": "214rxe",
		"score": 2189,
		"title": "Women are like hurricanes..."
	}, {
		"body": "\"I don't think so, son. Why do you ask?\" \"Because that headstone over there says, 'Here lies a lawyer and an honest man.'\"",
		"id": "52ue2g",
		"score": 2188,
		"title": "\"Dad, are they allowed to put two people in the same grave?\""
	}, {
		"body": "She said \"I don't like ringing you whilst you're at work.\"",
		"id": "4k23cg",
		"score": 2187,
		"title": "I asked my wife why she never tells me when she has an orgasm..."
	}, {
		"body": "Apparently not three.  It's still dark in my basement.  ",
		"id": "4kvjyq",
		"score": 2180,
		"title": "How many dead hookers does it take to change a light bulb?"
	}, {
		"body": "One gets pissed off!  (sorry!)",
		"id": "2d2sh5",
		"score": 2178,
		"title": "Two flies are arguing on a toilet seat when..."
	}, {
		"body": "",
		"id": "3rd0m4",
		"score": 2175,
		"title": "6:30 is the best time on a clock, hands down."
	}, {
		"body": "A sunken chest and no booty.",
		"id": "2zgjt7",
		"score": 2171,
		"title": "What is a pirate's worst nightmare?"
	}, {
		"body": "She starts every conversation with \"were you even listening to me?\"",
		"id": "3ip6v4",
		"score": 2170,
		"title": "My wife is so weird"
	}, {
		"body": "[Removed]",
		"id": "5qvkg6",
		"score": 2170,
		"title": "Muslims in the U.S.A"
	}, {
		"body": "Two blondes fell down a hole. One said, \"It's dark in here isn't it?\" The other replied, \"I don't know; I can't see.\"",
		"id": "237k23",
		"score": 2169,
		"title": "Two blondes fell down a hole"
	}, {
		"body": "I don't care if she has one.",
		"id": "4wcjpo",
		"score": 2164,
		"title": "What do a pulse and an orgasm have in common?"
	}, {
		"body": "Me: ”Oh no! Why doctor?\"      Doctor: ”Because I'm trying to talk to you, and it's very distracting.”",
		"id": "1t3w4b",
		"score": 2163,
		"title": "Doctor: ”I have the results of your test. You're gonna have to stop masturbating.”"
	}, {
		"body": "Prism  (Note: I made this joke up. Sorry if this little note refracts from the humour.)",
		"id": "1e75hj",
		"score": 2162,
		"title": "Where do naughty rays of light go?"
	}, {
		"body": "With a small loan of a million dollars",
		"id": "4p6hvh",
		"score": 2159,
		"title": "How does a racist joke start?"
	}, {
		"body": "They can go through 94 stories in seconds!  Edit: Please don't hurt me.",
		"id": "3j8j2h",
		"score": 2157,
		"title": "Why are 9/11 victims the best readers?"
	}, {
		"body": "And why did he draw so many pictures of my parents fighting?",
		"id": "2utju4",
		"score": 2149,
		"title": "Who is this Rorschach guy?"
	}, {
		"body": "Today a man knocked on my door and asked for a small donation towards the local swimming pool. I gave him a glass of water.",
		"id": "2o1c8w",
		"score": 2148,
		"title": "Swimming Pool Joke"
	}, {
		"body": "Jimmy replied crying, \"Because I heard my daddy tell my mommy, 'I am going to eat that p*ssy once Jimmy leaves for school today!'\"",
		"id": "2epirc",
		"score": 2142,
		"title": "The teacher asked Jimmy, \"Why is your cat at school today Jimmy?\""
	}, {
		"body": "I'd be a cheap prostitute",
		"id": "5281gr",
		"score": 2136,
		"title": "If I had a dollar for every time I had sex"
	}, {
		"body": "Sure, there's plenty of fish in the sea. But until i catch one, I'm just stuck here holding my rod.",
		"id": "388e12",
		"score": 2136,
		"title": "Dating is a lot like fishing"
	}, {
		"body": "Boo-ddhism",
		"id": "2ywung",
		"score": 2135,
		"title": "What religion do ghosts practice?"
	}, {
		"body": "I hear Malaysia Airlines is looking for people.       ^im ^so ^sorry",
		"id": "3g8sa8",
		"score": 2134,
		"title": "Anyone need a job?"
	}, {
		"body": "It's true, I saw it with my own eyes.",
		"id": "516b5s",
		"score": 2132,
		"title": "I can cut a piece of wood in half just by looking at it."
	}, {
		"body": "So I packed her things and left.",
		"id": "4u9qzn",
		"score": 2130,
		"title": "My wife caught me crossdressing.."
	}, {
		"body": "To get a breath of filtered air.",
		"id": "2lvk2i",
		"score": 2125,
		"title": "Why do people in Beijing smoke so many cigarettes?"
	}, {
		"body": "Who is calling you that son?  A bunch of cute boys.",
		"id": "5rdl1o",
		"score": 2122,
		"title": "MOM! I'm being called gay in school."
	}, {
		"body": "What an attention whore.",
		"id": "5t4kxy",
		"score": 2119,
		"title": "I knew this girl that tried to trade sex for adderall."
	}, {
		"body": "Neeeeeeooooowwwwwwwww",
		"id": "2pldf0",
		"score": 2116,
		"title": "What do we want?! Low flying planes! When do we want them?!"
	}, {
		"body": "I mean there's Hitler, and all the Jews.",
		"id": "43730u",
		"score": 2115,
		"title": "Gosh, hell must be really awkward."
	}, {
		"body": "...then my illegal logging business is a success  ",
		"id": "4xinzl",
		"score": 2112,
		"title": "If a tree falls in the forest and nobody hears it..."
	}, {
		"body": "Your camera.",
		"id": "35t7x5",
		"score": 2110,
		"title": "From my dad: What do you get when a topless blonde rubs sun tanning oil on a topless brunette?"
	}, {
		"body": "Is only joke. Is actually secret police.",
		"id": "1fc53u",
		"score": 2108,
		"title": "/r/LatvianJokes, you are Subreddit of the Day! Congratulations!"
	}, {
		"body": "  If you can't come let me know.",
		"id": "1jf09o",
		"score": 2107,
		"title": "I'm holding a charity night for people that can't reach orgasm."
	}, {
		"body": "Their capital is always Dublin. Hehe",
		"id": "27awq0",
		"score": 2104,
		"title": "Why are the Irish so rich?"
	}, {
		"body": "One's big and heavy, the other's a little lighter.",
		"id": "3kswko",
		"score": 2104,
		"title": "What's the difference between a hippo and a zippo?"
	}, {
		"body": "considering all the recycled content on here.",
		"id": "3t2y11",
		"score": 2103,
		"title": "Reddit is really a green community,"
	}, {
		"body": "Just to be sure I start 2016 on the right foot",
		"id": "3z0syx",
		"score": 2101,
		"title": "At 23:59 31.12.2015 I raised my left foot off the ground"
	}, {
		"body": "He just wants to sit and cry in his wheelchair.",
		"id": "1qlwgg",
		"score": 2095,
		"title": "I thought my son would like that I bought him a trampoline, but oh no."
	}, {
		"body": "Two mice ran up the clock.  The clock struck one and the other got through with only minor injuries.   Edit: First front page post! Thanks all! ",
		"id": "2hj32d",
		"score": 2095,
		"title": "Hickory Dickory Dock"
	}, {
		"body": "Nothing. My engineering is perfect.",
		"id": "4n65ss",
		"score": 2095,
		"title": "As a German, you know what really grinds my gears?"
	}, {
		"body": "Son: Dad, what does gay mean? Dad: Happy son. It means happy. Son: Then are YOU gay DAD? Dad: No son...... i have a wife...",
		"id": "3ty7y8",
		"score": 2094,
		"title": "His son asked him what gay meant."
	}, {
		"body": "One. Unless it's a blowout then the whole team shows up. ",
		"id": "1wv0qu",
		"score": 2093,
		"title": "How many Broncos does it take to change a tire?"
	}, {
		"body": "...\"Well I'm your man\" I replied,\"In my last job, whenever anything went wrong they said I was responsible\"",
		"id": "1hft51",
		"score": 2093,
		"title": "I went for a job interview today and the manager said,\"We're looking for someone who is responsible\""
	}, {
		"body": "Told her I was busy, will be there next time",
		"id": "4a45dl",
		"score": 2091,
		"title": "My ex-gf invited me to her wedding"
	}, {
		"body": "The ¿Qué Qué Qué?",
		"id": "2tady6",
		"score": 2085,
		"title": "What do you call a group of confused Spanish speaking racists?"
	}, {
		"body": "There needs to be a balance. A homie-hoe-stasis",
		"id": "45fhaz",
		"score": 2085,
		"title": "I personally don't believe in bros before hoes or hoes before hoes.."
	}, {
		"body": "I'm afraid she might get pregnant, what should I do ?",
		"id": "2fztkl",
		"score": 2080,
		"title": "My GF said she wanted to try in the other hole."
	}, {
		"body": "Who's there  Europe  Europe who?  No, you're a poo!",
		"id": "2ov4t7",
		"score": 2079,
		"title": "Courtesy of my 8-year-old : Knock knock"
	}, {
		"body": "The first row of a country concert.",
		"id": "4m7j3h",
		"score": 2078,
		"title": "What has 72 legs and 26 teeth?"
	}, {
		"body": "We're called Hispanic at the Disco",
		"id": "3aq55e",
		"score": 2078,
		"title": "I started an emo salsa band"
	}, {
		"body": "They're cramming for the final",
		"id": "525tcq",
		"score": 2074,
		"title": "Why are there so many old people in Church?"
	}, {
		"body": "It's white and it's on their land.  ",
		"id": "3u8edr",
		"score": 2073,
		"title": "Why do Indians hate snow?"
	}, {
		"body": "I don't know he hasn't opened it yet. ",
		"id": "242ryl",
		"score": 2072,
		"title": "What did the boy with no hands get for his birthday?"
	}, {
		"body": "and never comes back for my entire childhood.  Where are you dad?",
		"id": "3ner4a",
		"score": 2071,
		"title": "So a man walks into a bar..."
	}, {
		"body": "None, they just stand around and compliment it, and then get pissed when it won't screw",
		"id": "1eewgt",
		"score": 2069,
		"title": "How many guys in the friendzone does it take to change a lightbulb?"
	}, {
		"body": "None, they just stand around complimenting it then get pissed when it doesn't screw.",
		"id": "2fldqj",
		"score": 2069,
		"title": "How many guys in the Friendzone does it take to screw in a lightbulb?"
	}, {
		"body": "It's women who make it hard.",
		"id": "471kim",
		"score": 2066,
		"title": "Life is like a penis. Simple, relaxed and hanging around freely."
	}, {
		"body": "Because they've been lied to about what 8 inches look like their whole lives. ",
		"id": "24mafh",
		"score": 2065,
		"title": "Why are women so bad at parking?"
	}, {
		"body": "I would drive my first car every day, but only drive the DeLorean from time to time.",
		"id": "5s4ouf",
		"score": 2064,
		"title": "I've already got a car, but I want to have a DeLorean as well."
	}, {
		"body": "It's also terrible.",
		"id": "1ke24d",
		"score": 2060,
		"title": "My new thesaurus is terrible."
	}, {
		"body": "Because there's no rest for the wicked. ",
		"id": "20kk7j",
		"score": 2057,
		"title": "Why couldn't the candle get any sleep?"
	}, {
		"body": "A rip off.",
		"id": "26ygo4",
		"score": 2053,
		"title": "What do you call an overpriced circumcision?"
	}, {
		"body": "I was having sex with her twin when she came in. I tried telling her I was doing it because thought it was her. She didn't buy it.   It didn't help that his dick was in my ass.",
		"id": "47c31e",
		"score": 2042,
		"title": "My wife is leaving me"
	}, {
		"body": "If you burn it you get stoned.",
		"id": "4xls8v",
		"score": 2041,
		"title": "The Quran is like weed"
	}, {
		"body": "Billy Mays is up in Heaven partying like it's $19.99.",
		"id": "2lpnut",
		"score": 2040,
		"title": "Billy Mays is in heaven now..."
	}, {
		"body": "Depends on how clumsy you are.  *There, I've killed it. Move on /r/jokes, move on.*",
		"id": "1pyifd",
		"score": 2040,
		"title": "How many lightbulbs does it take to change a lightbulb?"
	}, {
		"body": "Because he wasn't born yesterday",
		"id": "3z68vx",
		"score": 2035,
		"title": "Why can't you fool an aborted baby?"
	}, {
		"body": "They pushed two twins together to make a king. ",
		"id": "3ayyzv",
		"score": 2032,
		"title": "Why do the Lannisters have such big beds?"
	}, {
		"body": "So I pushed her against the wall, grabbed her hair from behind and drilled her up the shitter. Turns out we watch different movies.",
		"id": "4pfzj9",
		"score": 2032,
		"title": "NSFW: My wife said she wanted to have sex like they do in the movies..."
	}, {
		"body": "A: If I can guess how many chickens you have in that bag, can I have one?  B: You can have both  A: Three",
		"id": "4syuqn",
		"score": 2032,
		"title": "Two blondes meet at a busy chicken market"
	}, {
		"body": "When you're a billionaire.",
		"id": "1ifksf",
		"score": 2031,
		"title": "When can women make you a millionaire?"
	}, {
		"body": "\"I've no idea, Someoneyourownsize.\"",
		"id": "50ncrr",
		"score": 2029,
		"title": "\"Mommy, why does everyone at school pick on me?\""
	}, {
		"body": "Please. Just ask me something.",
		"id": "3gg7g9",
		"score": 2020,
		"title": "IamA Bing search engine AMA"
	}, {
		"body": "\"Bite me, asshole\" - grammatically correct and scathing      \"Bite me asshole\" - kinky pirate",
		"id": "53709n",
		"score": 2020,
		"title": "\"Bite me, asshole\""
	}, {
		"body": "I mean, I know he's black and all, but I doubt he'll shoot anyone.   Edit: Holy *shit*! This blew up!",
		"id": "2sqqio",
		"score": 2018,
		"title": "I don't understand why Obama has to give his speeches behind bullet proof glass."
	}, {
		"body": "\"Over there next to mine\" was not the answer I expected. ",
		"id": "3yy7ne",
		"score": 2017,
		"title": "I asked my doctor where to put my pants during my prostate exam."
	}, {
		"body": "I asked how he could tell them apart. He said \"Her brother has a mustache.\"",
		"id": "234lhb",
		"score": 2011,
		"title": "My buddy told me he had a threesome with his girlfriend and her twin......."
	}, {
		"body": "One's really heavy, and the other's a little lighter. - [*Masai Graham*](https://www.bbc.co.uk/news/uk-scotland-edinburgh-east-fife-34039927)",
		"id": "3ia0vn",
		"score": 2009,
		"title": "What's the difference between a 'hippo' and a 'Zippo'?"
	}, {
		"body": "But for the life of me, i cant figure out why she wants to calculate velocity",
		"id": "482uju",
		"score": 2006,
		"title": "My girlfriend and I had a fight and she asked me for distance and time,"
	}, {
		"body": "\"...so technically officer, this is YOUR marijuana\"",
		"id": "2huc1h",
		"score": 2003,
		"title": "\"Whoever smelt it, dealt it...\""
	}, {
		"body": "...The thieves stole one large drink, a large popcorn, and a candy bar.",
		"id": "1rrlgo",
		"score": 2000,
		"title": "A local theater was just robbed of $286 the other day..."
	}, {
		"body": "After 2 weeks the fat fucker will be 84 miles away",
		"id": "4v33wa",
		"score": 2000,
		"title": "If your partner is overweight, get them to walk 3 miles in the morning and 3 miles in the evening."
	}
]
